{
    "Ugwuxq0N-Lhjy-JxL7N4AaABAg": "Wow Indians really hate their Queens.",
    "Ugwkc6pAqxDYjaE-lg54AaABAg": "I am the black rook!",
    "UgxV92KIkaLzI1WlUzB4AaABAg": "Agadmator humiliated this Leela Zero engine few weeks ago, imagine what he would do with pooor stockfish....",
    "Ugx6BQNpZXTRWSYG7Vp4AaABAg": "I don't know what the engines would say but intuitively it seems like black should've just taken the knight on c5 with his queen. It ends up net even in material after white sacked his queen and screws up whites anticipated tactical sequence which did in fact lead to mate since it was not disrupted.",
    "Ugwr7lyG1XcyD2cKh0N4AaABAg": "I personally disliked chess.com before and after this even more, that was not very smart PR move by them to throw poop on magnus the way they did",
    "UgzjzrWRIz6mGKLmv2J4AaABAg": "The engine correctly flags White's clever fork, 13.Qf3, as a mistake (eval from -0.5 to -2.5).  White must take the R, to avoid being even worse.  17.g3 makes it worse; better was to involve White's R in the game, via Rh4.  19.Kh2 makes it even worse; better was to bring the Q back in, via Qf4.  It's as if White cracked under the pressure.",
    "UgybdOlbVLbUh2-yZCl4AaABAg": "Stop taunting us with the Evan's Gambit",
    "Ugxnsv45J_LMub0gvZd4AaABAg": "even i know the bishop and knight... checkmate... these guys suck lol.. soz. no hate",
    "Ugg8haGoaRTj23gCoAEC": "After 7 Qxb7, if black had played 7.....Nc5, white queen would have been trapped. White cannot play 8 Qb4, black would play 8.....Nd3+ winning the queen. If however 8 Qxc6+, then 8.....Nfd7 9 Qb5 Rb8 and queen is lost. If white tries 9 cxd5, then 9.....Rc8 10 Qb5 a6 11 Qc4 Ne4 and the white queen is pinned due to mate threat on c1, thus she must sacrifice herself",
    "UgwND_wdhgEt5TRL8w94AaABAg": "Gotta disagree with your assessment following pawn C5-C6.  If pawn takes pawn B7-C6, then knight takes pawn E5-C6, white loses the bishop with rook D8-D3.  The correct followup move for white would be rook takes pawn, C1-C6, threatening black's queen and pawn, and white would have the better position.",
    "UgxbjD2R13HjtTIEpvB4AaABAg": "Here in the US pepe the frog is a symbol used by white suprists racist.",
    "UgiCqUWFVOsoR3gCoAEC": "The opening was dubious for black.",
    "UgzkDNUr6JKLsTcVT0l4AaABAg": "Naka lowkey trash I love him but he so bad against magipoo the chess master",
    "UgyLEC5sl-oAkcj4Hk14AaABAg": "10:05 White has check with the Queen at d7, and this is scary.  It may be that the Black King can hide at h6, but you need to examine White's attack here.",
    "UgzAFtf9jlm0beBOd3l4AaABAg": "I thought he is talking about white resigning in the title and I was like why would white do that instead of black I need to watch!",
    "Ugwy7_jdUFJXpCK3KXV4AaABAg": "reading the comments here explains why chess barely has any women playing it, if i was a girl i'd sure run away from all these creepers",
    "UgyRrSSxI2u0YYn42ot4AaABAg": "Come on —,aliens were beaming moves directly into her cerebellum.",
    "Ugy-6GTsvZll1SDnegd4AaABAg": "New game with black. White e4 black f6 white d4 black king f7 white c4 black e6 white knight f3 black d6 white bishop d3 black knight e7 white 0-0 castle black g6 white bishop e3  black bishop g7 white queen d2 black. Rook f8 white bishop h6 black king g8 white bishop captures g7 black king captures g7 white knight c3 black knight c6 white rook e1 black bishop d7 white rook d1 . i have beatin many players with this only if there game was not to advanced",
    "Ugw3d6jSxCn4cFDOQ614AaABAg": "@ 7:19 - Black's bishop to e7 is ALSO a winning move - although not as effective.  Plus - white's best response to black's knight to b4 would NOT be taking the knight right away - but first White's bishop g2, then comes black's check with bishop c2, then comes white's King e1, then black's  BishopXb3, then white's King f1, then black's knight to c2, then white's aXb3, then black's knight xa1, then white's queen to g5 and so forth - this would give white at least 30-33 moves until he is finally mated (if played well).  It's not as quick of a win as you think it is.   The black's bishop to e7 move also end's in white's mate - but not for another 50-54 moves lol - so yeah - good move - just not as good as the one you saw.",
    "UgzoE4vVy6AiWBkdf314AaABAg": "At 9:44, after bishop captures white queen, why couldn't white do knight C6, to block the bishop getting to A4? Then if black does bishop B2, you have white knight to e2, so the queening square is defended twice (rook and knight).",
    "UgzhJw62TmqLPh4H-7t4AaABAg": "Nigel Short missed checkmate in 3 -- at 6:16 with King to g6, black knight f4 with check, white king h6 then Rook d8 (nothing black can do to stop it)",
    "UgwHVEUAu0uXfSfvK_F4AaABAg": "exf4 was maybe the losing move  as now e5 is always a threat and white can use the g-file.",
    "Ugxv0DihumIplFojHTF4AaABAg": "Carlsen is gonna eat Ernesto alive the next time they play...I guarantee it",
    "UgiIWpvuVuApiHgCoAEC": "He's ugly as fuck. I think these nerds are just gaining confidence having him as a pin-up boy",
    "Ugyv_jFe500b0EadHlh4AaABAg": "Esser's move should have been black square bishop to F6 forcing the white to take bishop and then D4 knight take pain on F6 and if pawn takes knight queen takes at F6 and next move backs up to G7 and move F7 pawn up to block white pawn from moving or G6 pawn up depending on white move",
    "UgykNgwRo7e4JvJ65WZ4AaABAg": "At 1:56, if white plays d3, black can reply with Bb4. a crushing move. White will lose the Queen.",
    "Ugz5qmO74_exPJbJwwF4AaABAg": "12:56 Even stockfish gets pinned by the knight. I hate those little sh***.",
    "UgxO9c2-00qcBzhvUYB4AaABAg": "You can't get sick from playing chess.  Forget Rabjabov.  Nepo and Grischuk are lying.  This is a shame for MVL.  The Russians are CHEATING again.",
    "UgzrfQV7f2Fg_BzXL-d4AaABAg": "braces yourselves, alekhine vs capablanca is coming. This is what you get, you monsters...",
    "UgxbsQGLc2MIYJc0BHh4AaABAg": "Woow so many stupid antisemites here.  Losers. Btw,  both Fischer and Kasparov are jews.",
    "UgxFnGH7IuEkKbQXevF4AaABAg": "Fabiano wesley so and hikaru nakamura should be ashamed for playing behind the american flag.. Tehy are not americans japan philipins n italia are their lands. The us will never see them as americans",
    "UgxfbUNN_WouY5a9QMx4AaABAg": "The only idea came to my mind why Ivanchuck played pawn to g4 was rather to prevent any karpov attempt to move that pawn in f6 forward, in case Ivanchuck's queen position at f5 were under threat. It was both a distraction and paralyzing pawn move, considering Karpov had little time to think about the implication of any future consequence of such manly move as you  mentioned. As you can see it was extremely important for white queen to  stand still at f5 square at any rate to neutralize any threat coming to the black king.",
    "UgxVi8zZzyJB2tEcNdN4AaABAg": "its 01:04 in the morning in my country i need to go to school today and i dont give a shit i need to watch agadmator new video",
    "Ugh9Bme1nDSFS3gCoAEC": "I like how he says, like he is narrating the greatest of the events in the human history: \"Black, played a move... ( dramatic pause) and white (another dramatic pause) resigned...).",
    "Ugyn_2GPJukzTUHmG714AaABAg": "Kasparov FUCKED fritz !  Yes!!  I hate computer chess! It's bullshit ---reduces the game to nothing but memorization, as Fischer himself once stated.  Memorization has ruined the game.",
    "Ugwh10-wklHxQsUfw8x4AaABAg": "At 7:35, what about Rook to f4? The idea is to capture the pawn on h4 with the rook and then mate the white king at h2. If white captures the rook with the pawn, you bring the other rook down to f4, and the same idea seems to be unstoppable. The white pieces are on the queen side and can't bring aide to the white king. Am I missing something?",
    "UgzwLjXJyFlQtQmeLnR4AaABAg": "Sad how Alpha Zero plays more and more human-like and we have humans trying to memorize computer lines",
    "UgyGYDdqf0g6mRXo3sR4AaABAg": "at 2:56 ne4 seems good, because then when pawn promotes, nd3 and they're forked, black king can't save the queen becasue it can't take because the white king is guarding, then black king moves away, Nxe1 and white is winning?? could you please explain why this is not winning?",
    "UgysG8PqWEbwjVW_DJl4AaABAg": "8:01 What if you take the knight on f3? I think it works out. If rook takes queen, blacks rook takes whites queen and both players have hanging rooks. White can trade or not. If queen takes rook, then queen takes bishop with check and then rook takes queen. If some other white can just retreat his queen with an extra knight. Ah, I looked it up. Computer says: when both rooks are hanging: rook takes knight check, winning the knight.",
    "Ugz9kxLPaZkQxqhqO_F4AaABAg": "I think I understand 8:36. Why nc6 won’t work. After check, black knight captures, and white pawn recaptures, black can move his bishop to b8 and block white pawns to advance. Then black pawns can advance....?",
    "UgwcPfaI18a8Q9Ym4L94AaABAg": "Yada yada yada...... Just keep cheating guys. They suck in detecting anyways.",
    "UgjUXcGY9tMbb3gCoAEC": "at 23:01 cant black play Rh5, and if white takes the a pawn, black takes h pawn, also if after Rh5 white does h3, black goes a5??",
    "UgwqRX5BKKgk9zbN6FJ4AaABAg": "0:20 - \"My opponent was White...\" - in any other context than chess that would sound racist :P",
    "UgzsZbC_uzSRRfXi6J14AaABAg": "They're just goofing around, waiting for the Candidates to restart.",
    "UgiXrzYv3_edR3gCoAEC": "After white knight B1-C3, I rather liked pawn C6, prevents white's knight advance and frees up black's queen to join the game, prepares black to queenside castle in a few moves, get the king out of harm's way.  Also, black's queen, white bishop and queen's rook were all but spectators in this game ...",
    "UgwFBY8wbm_jZKIKXhd4AaABAg": "at 53:20 - i don't think black missed bishop D2. If he does than RxF5. exchange sac. black King takes back Kxf5. Then black king gets forced out even farther and mate is soon to come after a few moves. With Whites next moves as either Bg4+ or Bc2+ followed me swinging over Cfile Rook to the F file.     he may have missed it but if you look at the lines i'd take whites pieces after Bd2 for black.",
    "Ugg109ZJmjbr4XgCoAEC": "I have a doubt and it would be really helpful if someone answered it :). What if he played Rh6 instead of Rh4(which was how he lost the exchange) How should we deal with the threat of Rh6-Rh3 eyeing that pawn on h7 since the pawn can't move as the rook is blocking it?",
    "UgxHgs88787q0Dgwnu54AaABAg": "remove this dog from hell",
    "UgwckR4l6ZWlWivg8Ux4AaABAg": "I request all the indians to stop spreading the toxicity and the corny comments. Come and enjoy and learn , stop playin!",
    "UgwwXDZg-q2Eb_DkMCB4AaABAg": "Hi Mato..I wonder what happens @8,46 right after Re7..Couldn't Black play... Rf4 etc..if Qxf4 then Qxe7 or if White moves Re8+ then Rf8 should be enough to parry the threat right?\r\n\r\nBTW.. thanks for making all these videos..they come to live through your commentary.",
    "UgzkqhaexH0kh6VppT94AaABAg": "2:50 he doesn't \"nicely develop his pawn to e3\", I think. He did that to fix black's pawn on e4 so that black's bishop isn't that effective and that pawn remains a target for the future.",
    "UgxLcXenpB7HLGGdWsl4AaABAg": "Me and my friends always laugh at the Scandinavian. White just gets way to much development and Black is often always trying to dig his/her self out of a hole of poor pieces",
    "UgxwJJ-JX0I14SyWr354AaABAg": "A4 by white, a4 by white err.. sorry a4 by Black yeah.... a4 by black..........",
    "Ugzediz9SVsDdJYoZm14AaABAg": "Obviously Botvinnik is down material, but seems like he resigned early.  Why not Nf8? Then Bf4+, Kb7, but after that White has no follow up checks and Black could bring the queen to g2 to harass white’s king, maybe find a perpetual check or pick off the passed pawn.",
    "UgzAHaj6bLWfs8KLVr94AaABAg": "Hello. At 2:02 why doesn’t bishop at F5 take pawn at C2? The commentary refers to it (the developed bishop that “attacks the pawn”) and white moves his bishop to E2, but that does not yet defend that pawn. Black then moves his knight to D7. Why did black not take the C2 pawn with the bishop right then? Thanks. p.s. I love your posts, am returning to chess after 35+ years away, was a poor player then too. I even still go by old style move notation.",
    "UgxI8TBuKX9M0VnNu7p4AaABAg": "This is kinda racist and random but White starts and black is 2nd Uhhhhhhh...",
    "UgzK8Q1VNlXrK905wVl4AaABAg": "I really like how you put the picture of the guy who plays black closes to the black peices like so on white it's very nice to allways know who ever is white or black that you just can check the pictures :)",
    "UgyQxpFiOiVKerkB74J4AaABAg": "Magnus the Olympus will punish these pagans soon.",
    "UgwXkHS8homMIpv5Y4l4AaABAg": "Magnus head is like a fucking computer 😥",
    "Ugh65CBrQ4S5-XgCoAEC": "Great game only question is in 552, why not ra5? How will black stop white from queening? Only thing i can see is black king moving up with possiblt mate threat and possibly getting his bishop in play. But its defendable and white queens. Was it for simplification purposes that rook went to b7 instead?",
    "UgzLDVlCr_rHWe_yDi94AaABAg": "let's just be honest. Chess is a bunch of crap people trying to show their superiority, although the problem is they can't so they look for alternative methods. The chess world is full of a bunch of loser's in life looking for a platform of success.",
    "Ugy5OsKCqqwugtDKnld4AaABAg": "At 1:34 shouldn't white play Bxf7+? If Kxf7 then white has Ne5+ forking the king and bishop. White is up a pawn and black has lost the right to castle.",
    "Ugya5dOF0VBVzeW1fqp4AaABAg": "Best of luck Paul! Cameroon is rooting for you. Kudos to your girlfriend as well, that’s a very lovely attention from her. You both will beat that tumor!",
    "UgzdThTmHetdh0l6ti14AaABAg": "I hate it when granmasters don't capture early and then find themselves later in a much worse position in which they need to give up much more. Everyone can do that. Then what is the point of being a GM? Capture early idiots.",
    "Ugih1xKF7afu7ngCoAEC": "Magnus Carlsen has a movie coming out in september 2016 , see trailer , it is the best . i will go to see it .",
    "UgzcKcVzzgK8UHZC42d4AaABAg": "Black's attack looked a lot like the sort of attack that occurs in the the most popular variation of the King's Indian Defense. The Pawn structure pointing toward White's Kingside facilitates this kind of attack, especially if Black is permitted to play f5 without opposition. White certainly didn't help himself with his process of self-strangulation!",
    "UgwgAlbdLHQkiYIM6oR4AaABAg": "Black is completely winning, now white is completely winning, now black is completely winning and white is just lost however",
    "UgwUtgCd1Zkd1LSJBvR4AaABAg": "\"Black lost , black is poorer here , white is dominating \" They will want the pieces  color changed . Insanity reigns .",
    "Ugg2WaKvXZAaP3gCoAEC": "the puzzle on 17:59 had me cracking up so fucking much! it's true it dosnt matter in that position you will win regardless of the 100% best move possible",
    "UgyMM9GK0YJPQhSbGB14AaABAg": "At 10:56 why not queen f8 defending both threats??",
    "Ugx9moQn6B38kZyEJ7t4AaABAg": "Fuck these comentators, they ruined it.They made it impossible to follow the game",
    "Uggi3-YDg5QD3ngCoAEC": "My favorite series is back, woo hoo!  \n\nI often try Be3 in similar positions against opponents who like to trade, but I kind of like your suggestion of Qd3 to really press black.  I feel like the comp always wants me to take Black's light-square Bishop on e6, but I usually try to avoid that thinking the same thing that you mentioned (why reward Black with two central pawns for the somewhat questionable opening play).",
    "Ugg4QPLfMbpskHgCoAEC": "After the opening, around 15 Qf4, it seems white has a comfortable position. After 8. e4 white and takes white can bring the bishop to c4, but black playing h5 allowed for a good defense. Good game! ",
    "Ugyk2ie3n_3-yae4jCV4AaABAg": "They should make chess babies.",
    "Ugy94r-0sQ1otMKqMB94AaABAg": "35:15 >>why can't white swap the black king for the rook? (White rook goes to e8-check, the black king has to block.) I'm pretty new at chess, though.",
    "UgyVg8hLUwj8LvqkB8p4AaABAg": "\"Hi this is Mato. Today I am going to show you a boring ugly ass draw because I have been showing you wonderful games all year and I'm just not feeling the appreciation.\"  Just kidding of course!  We love the analysis and the games are always interesting.",
    "Ugy4HS8qVQMTWiGX_-l4AaABAg": "what a scumbag move by the St. Louis chess club. They don't own \"chess\" content or the internet. They're simply litigious sue mongers. It seems their MO is to sue everyone and anyone, and it is disgusting behavior.",
    "Ugw6Yuo9irj4mLZdXXB4AaABAg": "Am I correct in thinking that these idiots intentionally increase their rating via fake accounts, just so that they can have their arse handed to them when they play real players? This makes no sense to me.",
    "UgxQhuLebG6-zoVcVy94AaABAg": "After white recaptures on e2, Black cannot captures either white's queen or rook because it's gonna be mate. ",
    "UggfBYdbylVKFngCoAEC": "@7:38 why not Rxf7Rg8 then Qf4+Kxh5? Ive tried this out for a few minutes and cannot see how white wins, or even takes the second rook. At which point, black would take the white knight on A5 and start an attack",
    "UgyxKLGEziXSL4du5bN4AaABAg": "Play the French!  Like GingerGM!  Play the Sicilian!  Promote the human race! LOL.  It's all over but the shouting folks!  DeepMind/AlphaZero is our new overlord.  Be nice to your pets and all forms of life with lower intelligence than yours, since the shoe is on the other foot now with our robotic overlords!  :-)",
    "UgyQ6UmYX89IlX45Ihl4AaABAg": "I'm not much of a chess player, but I've started checking out videos like this one. I have a stupid question. Why isn't there more examples with black pieces winning? All I see is white, white, white... (not trying to make this a discussion about race, though:))",
    "UgyBxvfyYF09RYU8QuJ4AaABAg": "2:15 f5 h5 : best move of the match !\nIf Carlsen plays gxf5  it will lead to bf5 threat the Queen and Carlsen must do a trade with kd2 e4- kc5xd4, kc3 e4-...\n Nakamura can play -....qxh4, then bg7 h6 pin kd2 and be3 so a trade cant avoid and then Black can push h7 to do whatever while black queen move to f6, capture f2or k to c5 and white queen cant do anything else.\n\nWith move h5, he threat h5xg6, Nakramura must h7xg6 and the black  king side will be....clean\nWhy not bh7 (8:42 ) ???\nBecause kd8 c6 +  And then black must play kd4x c6 then d5xc6 .Carlsen has 3 a,b,c (^.^) ....(sry my lack of memory)  in white square, The bishop can't stop kc4 d5 then kd5xd6 because if bishop protect d6. Then a,b,c  .. will promote to Queen.(my analyse, i just dont know why Carlsen didnt do that?) (Uhmmm League of Legend ??? )\n \nAnyway, a well-played match !",
    "Ugxm_EcKFhkAvpPG6L54AaABAg": "Why not black bishop d4 at 3:24?",
    "UgzTmgHaTNa1ljr9mJp4AaABAg": "Whats in his fucking forehead. Looks prehistoric",
    "Ugw0sF1fgY_w3qbcjgp4AaABAg": "OK, I'm a 1:43 into this and all I really want to see is Medo destroying that happy face :-)",
    "Ugzsrgxsp31tea7PCPp4AaABAg": "3:00 stopped watching, dont give a fuck about your speculation just wanted to see the game",
    "UgzcaAC6FrzMGD70Mst4AaABAg": "Magnus Carlsen is a beast because he slams these \"booked up\" losers that haven't mastered the essence of chess! Great work Magnus Carlsen!",
    "UgzE9cQHPFkro96l4rF4AaABAg": "Chess is a game for anybody who wants to have a go at playing. These dinosaur GMs have lost touch with themselves and the world. They need a big cuddle!",
    "Ugy2f4zbR_tgVY1uonp4AaABAg": "White king was killed by his own army",
    "UgwK4zQG5WTx8Acm9zR4AaABAg": "It is no Zugzwang, because Black has a Threat , R F3, an white can not defend. In real Zugzwang, the compulsion to move causes the Loss.",
    "UgwsBWH4QuwNgvGUv3x4AaABAg": "What if black after 31.Qxf6 plays Rd1 ?\n\nwhite will have to answer with 32. Kb2 and black can force to exchange queens with Qd4. 33. Qxd4 Rxd4\n\nIf white tries to get checkmate with 34. Ra7 black may﻿ answer with Rd6.\n\nIf white tries with 34. Rb6 black may play Ra8. Otherwise white can take a pawn with 34. Rf7\n\nEven with 2 more pawns could it become a hard game for white with rook and bishop against﻿ 2 rooks?\n\n\n",
    "UgyVY7mb80jpFpkWVjR4AaABAg": "(@5:51) - yeah, this had me thinking, too. 1 Kg3 Nf5+, 2 Kh3 (and not Qxf5?? I don’t think 🤣) Bxf3, 3 Qe6+ and stalemate by 3-move repetition, or by agreed draw (or so it seems! - see below), as black’s king can’t get away, and the pawn on e5 prevents the black queen from interposing. Also, the white pawns on c4 and g5 cover escape routes for black’s monarch, and white must keep checking, or lose to Qg2#!\nAre there any other moves? Well, white could have opened with 1 Kg1, Kh1, or Kh3, but since the puzzle moved 1 Kg3, we’ll assume it was either the best of a bad lot, this puzzle was drawn from a database of actual games, or the puzzle was composed. Still, what if white had gone 1 Kh3? That’ll avoid losing a tempo as 1 ... Nf5 would no longer give check, but black still needs to play it to cut the lines of communication between the queen and bishop. This means that white can now pick up the black bishop via checks, until the black king occupies the same rank (7) as his bishop, at which point white wins the undefended bishop via fork. We already saw that 2 Kh3 is pretty much forced; the only other legal move drops the queen. Therefore, let’s look at 2 ... Bxf3 - is this the best?\nClearly, 2 ... Qxf3?? loses, and so does 2 ... Qf1+?? Likewise, 2 ... Qxh2+?? sucks, and the black pawn on e5 isn’t going to be much help; it still needs 4 moves to promote, and it doesn’t work even if it does threaten the white bishop, as black still has the problem of dropping his own bishop to a queen fork on the 7th rank! So 2 ... e4 isn’t forcing enough, and the knight on f5 has no checks, either. I think I can safely conclude - without asking a chess engine - that 2 ... Bxf3 is best.\nHow about 3 Qe6+? Then 3 ... Kg7, or 3 ... Kf8. If 3 ... Kg7, 4 Qd7+ (and not Qe7+?? Nxe7) Kf8, 5 Qd8+ Kf7 But now 6 Qd7+ and black can interpose the knight 6 ... Ne7 and white is out of annoyance checks! The knight guards f5 and d5, and 7 Qxe7?? throws away the game. And if 3 Kf8, we just get the same sequence, one move earlier. After this mental workout, I’m ready to hit the shower! 🤠",
    "UgzJ7kNFNXynLH4iOtF4AaABAg": "fuck noob i just wanna see their game, not ur shitty commentary",
    "Ugy5yS4R_Hq5bueLA694AaABAg": "According to Jeremy Silman (How to Reassess Your Chess 4th Edition), that knight at 3:36 would be a beautiful thing to behold. However, I like knights on the 6th or 3rd rank because they make kids weep, women cry for joy, and transform into an Octopus. ",
    "UghzLWt9tik-w3gCoAEC": "John - one of my regular playing partners plays stonewall dutch as black and white and he's consistently killing me. Are there any opening moves for white to simply not allow the dutch to be played at all (I'm a d4 player)?  The polish maybe?  Thx!",
    "Ugh3SEM1ic5BJXgCoAEC": "27. ...Qg5 struck me as overly bold, without the utility to back it up. I couldn't see Black's Queen doing much from there but retreating (please feel free to disagree), which gave White the initiative. And White did not relinquish that initiative.",
    "UgxIS_454Qvl90-mcXN4AaABAg": "It doesnt matter how strong u are.. camaraderie and enjoyment really matter.. anyway ALPHAZERO is laughing  to those \"Chess Elitist\".. even if they will spend the rest of their life in chess , still ALPHAZERO will play them all simultaneously blindfolded😂",
    "Uggr3KMo9UzKtXgCoAEC": "Who else was expecting \"White.... Played a move... And Black... resigned\"Surprise! \"White to move... And to checkmate in 1\"",
    "Ugxm5FwKaj7jJFtqCiN4AaABAg": "They should make Alpha Zero play against itself.",
    "UgyzKS4WgznePWRRbxZ4AaABAg": "At 10:50, black's e5 pawn is not actually defended by the knight, since the knight is pinned to the King by the white queen. So White could indeed capture the pawn with the rook from e2, with an attach on the black queen.",
    "UgwZTyhKAjrcIy9jVMt4AaABAg": "Thanx for a great show. gentlemen! Happy to notice that the trash talk bs was just hype. They turned out to be friendly, respectful  and well behaved ... which you may not experience regarding live chats. Too many idi ... not so educated neanderthals.",
    "UgjK94E07dYnLngCoAEC": "At 4.51 how the black queen defending the  black king at h6 would result is easy win for white. I guess pawn can kill white queen h6.",
    "UgwBADjodb0PEBdpUGt4AaABAg": "Black bishop to D5 to free up knight to F4 or G5. Wether white bishop or queen takes black bishop C7 black pawn to C6 to kick out queen or bishop off D5. If white bishop takes the C6 pawn black takes C6 with queen. If queen gets kicked off D5 black knight can move too F4 or G5 depending on where the white queen moves",
    "UgxiQAPnK6wfdDLMjLh4AaABAg": "Did you see this incomprehensible move for equality or something it is so retarded that they are equating peoples race with the color of chess prices it is so stupid i really have no respect for Magnus now",
    "UgzI_wi-peSe_k7ga454AaABAg": "Clever!!!! Too many players panic when the rook is killed and forget the power of the knight!!! After black loses the Queen, white's advantage is huge as any above average player can outperform the piece disadvantage and ultimately win!!!",
    "UgwNP3XZGtd_JUIQ3BV4AaABAg": "I fucking hate Chess 9LX",
    "UgyB5bOID1_8N9cqDUR4AaABAg": "At 9:26, White g6 isn't winning because Black's Kf6 stops White's pawn advance and with the Black bishop covering h6, White can't support his pawn to advance.   That's why White instead played Kg4 to kick the bishop away but Carlsen just played Bd2.  Now White has no way to advance his pawn and it's a draw.  E.g. Kh5, Bc3; Kg6, Bd2; Kh6, Be3; Kh5, Bd4 and if g6, then Bg7 and if white instead tries to help the pawn with his King by Kh6, then simply Bf4 and the pawn is pinned again.",
    "UghDaeNT9NLKwHgCoAEC": "they did a draw but black could of done two crucial moves that would of won the game rook to g1 the best move white had after that is rook too h4 giving black the advantage to queen the pawn by moving the king to g3 then white would most likely get a developing move with the Knight to e5 or e3 giving black the upper hand and then moving the rook to g2 after that move black gets queen then white eventually checkmated",
    "UgxJ6yVNdLHu2xOm_9F4AaABAg": "Couldn’t find Carlsen, but I see that Chess Brah and that runaway rodent on his head.",
    "UgywAAh_wFtq5Q52_ix4AaABAg": "@tirkiznimrav ah yes, Kh7 is a very clever and interesting defense as well. white might play Ra3 there, and black might then sacrifice their queen (as it is hard to defend against Rg3 and Rf3). Ra3 Bxa3 Bg5+ Kg8 Bxd8 (now white is threatening Qxe8 and Bf6) Rxd8 Qg5+ Kf7 Qxd8 Be7 Qc8, and white will win the endgame handily after taking on b7. just one possibility...",
    "Ugz_Z58WBMCT2WUxVJF4AaABAg": "Coming next: Youtube demanding that the Black Queen be referred to as the African-American Queen and the White Knight be called Caucasian Horse! Oh, wait! Youtube is already run by a bunch of white knights!",
    "Ugz0ZsoYGdl1nlaJNLB4AaABAg": "When John plays a 1500 they blunder all their pawns in the opening. When I play a 1500 they invent a brilliancy in the taimanov, take all my dark and light squares and blitz out 10 move deep tactics",
    "Ughn0LtrKYAnFngCoAEC": "I must be missing something.  At 5.29, if white takes with the rook instead of the knight, then after Bxd2, Nxd2, black is only slightly ahead and white might be able to hold the draw.  He'll have an extra pawn for the exchange and every single white piece is on the wrong color for black's remaining bishop.",
    "Ugyja7aofChCPECZqBB4AaABAg": "You fked me up with Alpha Zero. Now I see these dudes as puny humans. Ha Ha!",
    "UgzuNSVOrc5GtVaUlmF4AaABAg": "There truly is no way to save the hippo. Unless the killer of the hippo dooes not see the hippo.",
    "UgyZqWuo_0ZhcqW876x4AaABAg": "I want to see Magnus Carlsen play against this beast.  That's the only way well know for sure if this match was rigged.  If it can smoke Carlsen in a match, then I'll believe it's legit.",
    "UgxU27IPCrlstAbWe2F4AaABAg": "13:06 - If white rook on b1 takes black rook on b8, you show black rook on c8 taking white rook.  Why wouldn't black rook on c8 take white queen instead?",
    "Ugw4PZTgRaFS_W8psCh4AaABAg": "Checkmate comes from the persian (farsi) shah mat- the king is dead; italian scacco matto. In albanian the words are pretty much the same: rokada, torre-rook, kal-horse, oficer- bishop, mbret-king, mbretneshe- queen. We say shah for check! Great video. We are all rooting for Croatia in the Balcans except the Serbs I guess haha! They didn’t like the eagle the Albanian players  playing for Switzerland made with their hands!",
    "Ugh36mmtCsSzPHgCoAEC": "i still believe that the could have continued and black has an advantage here with the h pawn threat so why did they draw?",
    "Ugz7-fgFmdYVEnapcel4AaABAg": "fischer reminds me of captain america.. i might be racist",
    "UgxicXUlnwnY17cIM4V4AaABAg": "sure I do  I look at Qf3 and lets say G5 as a reply.   he can't take either one without losing the queen.  Now if Qe3 there would be a possible pin with the bishop that might take the queen.  the knight may move back to e6  later.  What I'm trying to say is that. White has to finish the attack and I feel that black has a chance to fend off white and lead to enough possibilities for white to blunder, he's not a computer. ",
    "UgxF8EeMd_I1ODao2DB4AaABAg": "So tragic. Sniff. Cest la vie, but heartbreaking all the same. Another huge tragedy is what happened with Shirov. As well as the other numerous injustices of this world. We humans are crazy, deluded liars.",
    "UgwCRRVNP4pL06Ls_NF4AaABAg": "The knight on c3 stops the black queen from checking the white kind and forcing the white queen to take back. That helps?",
    "UgyfLZjf-6itpmjyi4N4AaABAg": "The number of threats in the thumbnail brought me here",
    "UggJrpI24PdEuHgCoAEC": "little does john know, that pretty much all 1100 plays as good as geox, but for some reason, when they verse him, they all shit thier pants.",
    "UgwaAmMgztl5CCwq3_F4AaABAg": "I’m late.. but I’m a Saudi male and I agree with her. Saudi’s treatment of women is atrocious and unacceptable.",
    "Ugh--6WbCn8wW3gCoAEC": "Hey John, is the Nimzo-Indian for black the closest thing to a mirror image of the ruy lopez?",
    "Ugzne0FPnDePXP6k3ch4AaABAg": "Antonio reading that joke to filth is the best thing about this morphy saga",
    "UgxVjHVlh00CGkiSPy14AaABAg": "The key is picking trades that reveal further threats on other pieces. If your trade opens another line of attack then it becomes two moves.",
    "Ugztghc7Yk6XHWhw1mN4AaABAg": "I'm a bad ass, not America she is of the decieving kin.",
    "UgzhbZFEUowQ1H1rbcZ4AaABAg": "Off The Ohio State campus there is a bar called \"The Library\". No better place to show this game.",
    "Ugw6qghjGV4R9ukrCyV4AaABAg": "Yall chess people got too much ego for a board game. Catch me in some hungry hungry hippos, I’d smash any GM. Get at me",
    "UgwIUDgP9dqGacUayKR4AaABAg": "I wish they would just play the game to the end. I know it's probably easy for an advanced player to see why black resigned, but I would have liked to see where this went.",
    "Ugxx8w64XeI9p8_En6t4AaABAg": "I think it's important to consider White's interesting option, 20.Rb1, because 20.gxf3 is obviously losing to a crushing attack. After 20.Rb1, Black has a shot: 20..Rxc3! 21.Rxb5 (21.Qd1 Rb3!) Rxc2 22.Rb1 (White has to defend against mate) Bc8 23.Ra8 0-0 and Black remains a piece up, as 24.Rbb8?? leads to mate in one.",
    "UgxQFHsbh4gU7ZiDTZB4AaABAg": "At 8:11, I do not understand...\n\nWhy isn't Bxa5 simply met with bxa? There is no threat there...\n\nIsn't the real threat Bc3?",
    "Ugzn_mPtmHzi4G4ixAJ4AaABAg": "I absolutely HATE how everyone hates Max, for literally no good reason at all! The fuck's wrong with you people?",
    "Ugyl_dEB6nRU1XFg1dN4AaABAg": "Two kind-hearted beasts dukin it out. Ggs",
    "UghT2dTHA6i2BXgCoAEC": "1:24. White: knight to E5. Black: bishop takes queen. White: bishop to F7# checkmate. It's called the legal trap and could fit right in this situation.",
    "UgwIbyHX7b_u50PthzF4AaABAg": "What the frik 5 noobs hated it boo them",
    "Ugxf2FwZ9NTPZwput754AaABAg": "I hate to play against the Budapest",
    "UghR_pdZKjhQGXgCoAEC": "I was thinking instead of knight to F5, knight to B6, as black couldn't take with the pawn, as white would take the rook on A8, and if black just moved his queen, white could still take rook on A8 with the knight, which at worst would be trading a rook for a knight.",
    "UgjEQvBqlHuRSXgCoAEC": "What ELO rating black have?",
    "UgwnT2WDjuStrSlps9V4AaABAg": "The spankings continue for the little brat, ppl need to stop over hyping him",
    "UgzvVa1-MCJAzMUtyLt4AaABAg": "The trailer for Action Point looks fantastic. Enjoy that extra ad revenue;)))",
    "UgyJBQm3_AVgOaiKl9F4AaABAg": "At 13:10, just after white Rxb8, why doesn't black Rxc6 instead of Rxb8, eliminating the white queen, and saving the fork that loses the second rook.  Am I missing something?",
    "UgxMtI3i7dkZjUEli4x4AaABAg": "pons should have seen this threat and at least drew the game",
    "UgxJKOOxgj6sTf_-qPd4AaABAg": "I was indeed unsubscribed against my will. How can humanity come up with amazing algoritms as deep mind and crappy algoritms such as this unsubscriber one?",
    "UgzklmoGT3idYzQKRkN4AaABAg": "When the the two quens near we can move horse down to make an echec and take the quen of black",
    "UgxUtQqnPeHeYcPssfR4AaABAg": "The beauty of the Bc6 move was the threat to the knight completely disguised its real threat.",
    "Ugx4vyYKF4NqWZcGlXF4AaABAg": "i play better than these guys.       come video me.     Naka and agad. Bringing chess to the masses of twitch            sad agad        very sad.         o chess is no longer elite.    o goody     now you analyze morons                ur now as officially as bad as naka for bringing chess to the masses and analyzing the games by fools.     and i thought the botez morons were stupid     welcome to their club agad.  block me ban me or shadow me agad.",
    "Ugw4GgMdq28ug9_WM4Z4AaABAg": "Guy in audience. shut the fuck up",
    "UgwQ9VhjuBYWmiTwLiV4AaABAg": "What is black's response at 10:40 to Qe2? Black cannot check white with the dark square bishop as the king is on a light square. Also, there are two possible queen moves resulting in check, both cause black to lose the exchange. The natural response for a weak player like me is Rxe2, followed by Kxe2. I found Qe4+ as a response by black but the white king can flee to f1.",
    "UgyPGQirNfcaJ8N0pIl4AaABAg": "#Tal makes you feel useless like Neuer against South Korea xD",
    "Ugy5l3p6xFg0dj1M6Bx4AaABAg": "Hey Agad! What if at 10:42 white plays g5 threatening Rf8+ followed by Rf1 to Rf7#. Isn't white winning on the spot? If not then what's the defensive resource for black in this case?",
    "Ugg0mbQC7zjDwngCoAEC": "gotta love the honesty and humbleness in this guy. You can just see hes niceness in contrast to some of the arrogant and pompous nitwits in chess...",
    "UgiNDaJBAz5DingCoAEC": "ridiculous, black wins without sacrifice. .white never stands a chance,actually actually stupid move!!",
    "UghezB-3uxd933gCoAEC": "White to move. White played a move and black despaired.",
    "Ugxx2Kq4tORXLwmexaZ4AaABAg": "Please bring back Aman or Eric, and get rid of this Hess mess guy. Jeez",
    "UgwyYCp4peVkX_EaExJ4AaABAg": "1:46,if the white knight captures black knight,with an attack on the blacks queen,then you can capture the other black knight with the white bishop",
    "UgwKWOeCEkEuL4sCHv54AaABAg": "is this stockfish from lichess or some better or worst version bescause it seem too easy for deep mind to beat him????",
    "UgzJC76k6c29obA_j-14AaABAg": "I think in 2:50 the black can block the e4 with the knight loosing a piece better than a queen... If the white capture the knight then the black will recapture with the pown and pin the bishop.. I think even if the white capture the knight on e4 with any other piece the black will be fine.",
    "Ugx64iQFADySFjQqJKR4AaABAg": "If it was infinite how they got the third rock? I mean how they push the pawns to the end of the bored and if it was in infinite how they can got the third rock",
    "Ugycmz6gSGk5588hsMN4AaABAg": "just threaten them into forfeiting",
    "Ughg6u0nIsL2EXgCoAEC": "I believe 1 Ke3 works too, as black has no skewer now, and can't afford to leave the pawn undefended. If (for example) 1 ... Re1+, this just allows 2 Kd2 and black still has no immediate skewer, and if  2 ... Rh1, then 3 Kd3 and white's King just zig-zags until it gets to b3, whereupon the black pawn is lost. If black checks on the 3rd rank, white just takes, and if black moves the rook on the 2nd rank, white takes with the rook instead. I think I'll try this vs. my chess engine and see... :)",
    "UgzPSjX8orMcRf2x08R4AaABAg": "WOODY KEEPING HIS DADS LEGACY GOING...NOW, CHARLES WAS A NATURAL-BORN KILLER.",
    "UgwWfYXqyp5bQaIv4dV4AaABAg": "4 hour training and beat stockfish? humanity is fucked",
    "UgyWkwhNDz4sSJbUUHJ4AaABAg": "what if at 34:30 white takes the e6 pawn and black moves the king and white claims illegal.",
    "UgzAJC6Ai9WM-RmPzOh4AaABAg": "12:41 Am I blind and missing something? Why not just Qxa7 instead of Kf3? If black Qd4+ you can Ke2 or Kf3 after, sure black Qc3+ or Qb2+ picks up white's b3 but if black Qb3, white Qxc5+ means you are up 1 very close to queening passed pawn.",
    "UggFYmZ4NT5E1XgCoAEC": "After white pawn D4-D5, I didn't like black's retreating the knight to its home square ~ better to have played knight C6-B4, threatening white's D pawn with potential to get deep into white's territory later on with knight B4-D3 ...",
    "Ugzwgb7JLMJK7ew8cqN4AaABAg": "Where was Black's fatal mistake? White's build-up against the Black Kingside was so methodical it made the Saemisch look like a guaranteed win against the King's Indian, but that can't be true!",
    "UgzUHPvhy5cjYAgNPuB4AaABAg": "It appears that only cities in Switzerland (and therefore the tournament) are immune to the declared pandemic.",
    "UgxkqNbiTQJljPtg0xp4AaABAg": "And it's even more humiliating having to face the comment: \"Against this guy I'm going to save the Bongcloud (e.g. 2 Ke2). He seems a little bit too good for that....\" tap on the shoulder of the poor victim before being smashed again, like a bug under the heel. Horrific to contemplate that his opponents, who seem like hapless rag dolls in his hands, would all probably beat me 10 to 0. What a show!",
    "Ugw42ujvtxl9YM5-nvF4AaABAg": "At 18:21. why can't Black play Qd1? It would lead to Ke3 Qe2, and White can only do Ke4 or Kg4, either of which leads to mate after Black plays Qe4. I know it's a hypothetical series of moves, but still, Black had a good move then. He shouldn't have been feeling threatened about White checkmating him.",
    "Ugykm5tTPg5f8IqFsXF4AaABAg": "I always wondered, who are all these people I am beating with 5...Nxd5!?  I bet they were all told that 5...Nxd5 loses to 6. Nxf7?! and then shown a few lines where Blacks plays terribly and gets mated. Come on, Ben, why don't you look at the strongest replies for Black? \nYou are a GM, but just think about it logically: Black has done nothing wrong in the first four moves, and the fifth one was forced. Why would you expect them to have to sac a pawn to have a reasonable game?  White, on the other hand, moved the same piece twice in the opening, and with 6. Nxf7?! is moving it the third time. After the Knight is taken, where did all those tempi go?\nYou looked at 8...Nb4 9. a3 Nxc2 10. Kd1 Nxa1??  Black is already up a piece, why would they have to take a Rook and allow Nxd5, when all they have to do is not get mated? \nYou said you don't like Black because it is too hard to play.  I'd argue the opposite: Black's plan is very simple -- all they have to do is exchange some pieces, and go into an endgame with a piece up.  White, on the other hand, has to play very precisely to maintain the initiative. One wrong move, the King runs away, and they are just a piece down.",
    "UgwxZ4dths4Rkm1Ti414AaABAg": "They shouldn't have let Charlie play black. You know he get serious when he got the black T on and the black Pieces are no different.",
    "UgycRwrGtRUH1mWa_K14AaABAg": "12:41 why does black not take the pawn on f4 with the rook? I understand that white wants to fork on c7 but even after black winning the bishop and pawn for the knight is white so badly off, with his rook now penetrating into white's camp?",
    "Ugw-EFAbvTfmAXcVIfZ4AaABAg": "Seems to me that at 16:05 White can simply advance the a-pawn. Black HAS to capture on a6 and lose his knight because it can't stop the pawn from advancing beyond that square. White's king then picks up Black's d-pawn and now he has a winning bishop+2 pawns versus 2 pawns endgame. True, less elegant than what was played but it's what Capablanca would have done... and it keeps the white king on the kingside where it's needed.",
    "Ugwq3Ey5iK88fMS11P54AaABAg": "Why wouldn't  white's Rxh7+ be deadly after black's Qg7 (at 16.22)? Black Queen would be trapped/pinned after Whites next move Rh1+, as far as I understand. Or?",
    "Ugg6XnND_wHnj3gCoAEC": "At 55:30, isn't ignoring black's threat just running into a mate? Rc1+ Bf8 Rc2 and black can play Rb1+? What am I missing?",
    "UgyzIVd4pTWQ9xgfwNl4AaABAg": "I guess with 11. Kb5, black cannot check the White King with a5+. But, then black will just play b6 with the same threat of a5 and Bd7.",
    "UghtXUYN9bPC_ngCoAEC": "Finally some improvements on chess.com, I thought that lichess is gonna eat you alive..",
    "UgxCOz12wNt1X-1MRAN4AaABAg": "The chess elitists are sabotaging you lol",
    "Ugx72eWyZ9wvamteCsh4AaABAg": "At 9:55. After white pawn is moved to b4 how the black pawn is able to kill white pawn at b3. I can't understand can anyone explain.",
    "UgykUftMu13KCKUGC7N4AaABAg": "You are encouraging people to think for themselves. THIS IS CLEARLY NOT ALLOWED. Having your own mind is becoming impossible. I stand by you. It's chess FFS. Chess is apparently racist because white goes first.!!!! This is the world we live in.",
    "Ugy8Gd-yy67WXDrLxcp4AaABAg": "I haven´t had my coffee yet but why not white´s bishop takes the g7 pawn with check and regardless of which of the three possible moves for the  black king, white´s rook slides over to the g file (with check in one case or protecting the bishop in the other two) while getting away from black´s bishop.  Then depending on black´s moves, white´s queen can still jump to a1, f8 or g3",
    "UgyiEDNEN-OFLsEI2gx4AaABAg": "Be happy of not being permabanned for all those 'whites looks better', 'blacks are in worse position', etc",
    "UgyMyA0KbbUxPy_gbrB4AaABAg": "I cant believe that Carlsen mess the win with Rg3 also cant believe that fabi mess the drow with e5 such a werd game",
    "UgzJ5YeuEc_8rRP7uUF4AaABAg": "They will not stop scensoring anyone for no reason",
    "UgwajHW7uoG5QG-_pMR4AaABAg": "16:24 -- Stockfish lost this game because it couldn't \"think\" strategically. If the threat is White getting both rooks up in Black's grill, then Black ideally should play to close lines. Which, in this position, means Be4 to block the e-file. After Be4, White is still leading, but it's unclear if he can break the fortress.",
    "UgycgJOELmfj1hl7NzZ4AaABAg": "The Germans play football this way. They play very careful defensive football, play for a 0-0 tie and then have a crew of the best penalty kickers in the world to break the tie with. The Dutch call this ugly football and they refuse to play it. This is like the opposite of Tal. Still, it wins",
    "Ugzqe_o5TZcHEchFAgR4AaABAg": "YouTube AI has determined that the white pieces was expressing hate and racism against the black pieces.",
    "UgwBRNKSDu5OqtlwYph4AaABAg": "4:09 Garry must have been like, \"Wow I'm fucked!\" Deep Blue is just holding his head underwater.",
    "UgyyiBnJG9lbeF592rN4AaABAg": "after black moves to h6 to avoid mate and white captures 1. Qxh6 QxKd5. what if white pawn on f5 moves to f6? thats winning for white isin't it?",
    "UghE3_nB8aytGXgCoAEC": "The insight here is white take with b2 pawn, and not queen. This allows bishop to go to a3 prevented black king from castling on the kingside. If black king castle on the queenside, white merely alight rook to b1, controlling the b file.",
    "UgxSmCCPR9lWN9LdNkl4AaABAg": "The soviet gm will smoke these grandmasters now that only plays with computer",
    "UgjfJDebf_1oBHgCoAEC": "On the hard problem, after ...Qc3, Kf1 is not a defence for white becuase after Qg2 check, when white moves Ke2 there is Rxf2 check, for Bf3 check if the white queen takes the rook, and the king can never hope to defend the queen by moving to e3 becuase there is Nc4 coming in. Sick problem",
    "UgyzeWGRIx7S1cJPw4l4AaABAg": "I found a better move at 8:29, rock(e2) take knight on e7, black queen(d6) take rock on e7 and then white  queen delivers check taking pawn on d5, black king moves and white queen take rock on c4,. White have queen and knight against black queen",
    "UgxuvebcTJOq6PPhj_N4AaABAg": "Deep down grischuk is thinking like \"this small chinese dude is the only person capable of defeating that magnus brat...so lets not bother him any more...in case an accident happens and ding is out, that brat will keep the title...damn u brat...im making the biggest sacrifice there is in the history of chess--im sacrificing myself to dethrone you...all hail king ding...\"",
    "UgiehbsXjA-M1ngCoAEC": "King look to rook, rook look to king...king make two jump step for left, rook one step jump for right hold the king on your arms rotate it and check the jealous black king, same time king just prepare to eat the jealous rook black, funny and amazing move the Tango check",
    "Ugz4F4U9Hjw5GZi8il94AaABAg": "In the final position, white must keep his knight on e4, lest black sacrifice and break through with his king. White should move his king back and forth, not the knight.",
    "UgzOjaUSRYZKBgPq5y14AaABAg": "Why aren't you berserking these filthy casuls?",
    "UgzhSSesvF78jqAtrS54AaABAg": "I love how he always trolls us with the Evan's gambit xD",
    "Ugx7LtoER2c2DTuP__J4AaABAg": "YouTube must be regulated by the federal government in order to promote the general welfare and secure the blessings of liberty. Their leftist censorship is election interference. I suspect the root of their \"concern\" is that chess is meritocracy, with a history of discrimination because white moves first, or similarly politically sociopathic drivel. Ultimately, their goal is to destroy anything that is good.",
    "UgyyWHsCJyn24ZD5NcJ4AaABAg": "Eff the right wing fascist epoch times and all that accept their dirty advertising money",
    "Ugyltvuy45DXJ44s0El4AaABAg": "D5, D5 ... intense calculations ... D5 by black",
    "Ugg49aAa2-_AongCoAEC": "After B×h7+, K×h7; Ng5+, Kg8; wouldn't it be a good idea for white to move N×d5?  Then black takes back with e×d5; then white moves the queen to h5?",
    "UggTkjvcJJfZGXgCoAEC": "I only watched the trailer an the critics about the Pawn Sacrifice. In my opinion is a pure propaganda movie.",
    "UgwwD3Pzt3mzVA4Qv8B4AaABAg": "What a waste of space. We know the world is full of delusional people, but to indulge them is to encourage them.",
    "UgxZiJcYM9uN8zx-fU14AaABAg": "Stockfish is getting too cocky, It needs another Alpha Zero beat down so it can be reminded of its place.",
    "Ugz5V9rKNMAe1YD-3sV4AaABAg": "The moment you can only win by cheating and the tournament is so trash they even let you do it. Garbage victory that is worth nothing.",
    "UgzBNZ9pbvKggEtEJ0N4AaABAg": "at 3:47, 14 .... black pawn d5? next black can play Be6 (unless white pawn takes it), but this should slow down white and speed up black's development",
    "UgyB-kd_s83fIbPCt0B4AaABAg": "all those hating on Aman or Chessbrahs for joking around with Danny..go apply milk of the poppy. They all know each other pretty well and wanted this stream to be entertaining and fun. Danny's not offended, why the fuck you are?",
    "Ugyn2Vi7vwtMYrY10AR4AaABAg": "They miss mate in one because tigers are scary",
    "Ughx7ucO-3J_Y3gCoAEC": "if they know u play chess well ... they will not trust you because they think you are a trickster ... they will hate u",
    "UgyORuovOPg7e11OS714AaABAg": "Don't mess with Karpov, he sent this crying ass to his mommy",
    "UgwGk55db5SIFNVAkh94AaABAg": "Such  a good play of Tal, yes black for sure did some mistakes, but the way he made the Bishop and horse useless and captilaze on its just a magic, what is your Horse and bishop worth if they are not contributing on the battefield?",
    "UgyNVrzA9KWeBOuijyN4AaABAg": "unfortunatly chess is becoming very boring ,just trying to draw and keep position equal  ,they fuck up all the beauty of chess that people like rashid nejmedinov and mikhail tal bring to the game",
    "UgznAjLlnRTP-Te7Lvh4AaABAg": "minute 4. White does not check, he takes the knight.  Black queen must recapture as any checks will be useless.  Then white knight checks and takes the rook.  White is up the exchange, black cannot castle and his back rank is not developed.  Eventually, white will castle queen side and connect his rooks and have a protected king. Advantage white.  I love this gamble!  Love your videos.",
    "UgiDzlE4VcEFM3gCoAEC": "White spotted the weakness of the white squares around the Black King and pounced. Black should have known you can't fool around like that even in a closed opening.",
    "UgxD3sT0ZhpQcjBuQc94AaABAg": "The White king gives 0 fucks",
    "UgyJLsPGpXHf51IFaDV4AaABAg": "Just my opinion but these men should be ashamed of their accusations. I'm glad Christian Bauer said he was convinced Anna wasn't cheating but its an absolute disgrace to the game that People at this level are so insecure about being beaten by a lady. Especially to go to the lengths as to accuse her of having spy lip balm.  Congratulations Anna you're a real threat to these misogynistic backwards thinking cretins. I know their actions have tarnished your victories but the victories were well deserved. Don't let them get you down.  I'm not the sort of person who usually White Knights but i know you'd take my king any day. See what i did there? Oh god i'm a dork.. But really i don't think these men would be so quick to call shenanigans if you were a guy",
    "Ugg1uypoS8zqv3gCoAEC": "At 38:23 white could've played Bishop to e3 blocking and attacking blacks queen while being defended by whites queen and connecting both rooks so black doesn't get the fork.",
    "UgwcDrkyFBQNBjbYzfN4AaABAg": "bro there’s a limit to what a prodigy can be. this is getting in the range of inhuman",
    "UgwvUea1LJ1ytbgqhHx4AaABAg": "the problem with engine like leela they learn.The only thing stoping stockfish from kicking leela ass non stop quantum processor",
    "Ugz62W-DBroO-hRDK6F4AaABAg": "this is the worst possible way to learn chess, even the easiest ai will trounce you. do not try to learn chess from this fucking cheat of a website fuck you",
    "UggFWcrKgEj5SHgCoAEC": "Wouldn't the best move at 4:22 be if the black bishop takes the white bishop , White Queen takes black bishop and then Black Queen checkmates him by taking the Rook?",
    "UgibuohcFGo9zHgCoAEC": "7:22--BxR, RxB Rh1#, Kd2 RxR on a1 and black is up the exchang and a rook?",
    "Ugxr3IlfWmUTMnctbMN4AaABAg": "I know it looks strange and there is mistake that it's 6x6 board instead of 8x8 but those are not main problems. Main problem is that chess in not friendly game. This logo represents idea that chess players have great attitude towards each other while playing game and that's wrong. People slicing each other in half would be better representation of what kind of attitude players have while playing chess. They want to destroy one another in the game. They don't hate each other but when it comes to result, their only goal is to dominate over their opponent. Well at least that's how i feel while playing chess and any other game in general.",
    "Ugxkq7Ag86ID3Yiy0p54AaABAg": "I love these videos.  I'm a beginner player and love how amazing chess is. Agadmator is awesome and I've learned so much from his analysis.  But seeing dolphins in captivity is not enjoyable.  They should be free in the open ocean.",
    "Ugg7Ex_EMwnN33gCoAEC": "multicast is currently on ICC playing lol. Amazingoid convinced Spinal that multi is Leverage but I've caught them both playing at the same time the last time Leverage logged in on the 27th March or something. To be honest this Amazingoid was the person who was pushing multi = Magnus the hardest and now he comes out with this. Take it with a pinch of salt. He doesn't know who it is. Seems they are both salty for pushing the Magnus card so hard and then realised he was actually playing an simul during the time multicast account was on ICC. My thoughts: there is more than one user behind the handle. But once again, my opinion is worth nothing. Only ICC knows :) Nobody does apart from ICC. The amount of rumors circulating this person is endless.﻿",
    "UgzSa6yImV35qz-sXdp4AaABAg": "13:21 But the black queen could capture the knight on f3, then it wouldn't be checkmate. Black would lose the queen, but white would have a queen and three passed pawns against a rook, a knight and a bishop. Would that still be winning for white?",
    "Ugx_hseCMTiz4eIjo254AaABAg": "Repeating a lie a thousand times is where its at. Decieving the masses into thinking that Alphazero defeated Stockfish at his best. At least have the decency to state the facts surrounding the so called match that was under closed doors and with severely crippled Stockfish. You don't even try to be factual, shame on you.",
    "UgyQ2t3eMZr5Eh2Udxp4AaABAg": "I literally almost clicked off when he said pogchamp championship. Very very boring annoying people that are bad at chess. We really need to get rid of Penguinz0",
    "UgykQ5G7WX2hEvqV0Gt4AaABAg": "If Ke7, isn't N-e5 problematic for black? The threat is Qd7, but also g4...",
    "Ugwptz613bcBCS9hYY54AaABAg": "@9:24 Black should gave played c5xrf4, then either bf7xre8 sacrificing a piece or we have rook exchange & white will be down a piece either way but black king is in the corner so anything will go for white specially bc it's Tal we're talking about!!!",
    "UgzbFhdZ0nhlr2689MN4AaABAg": "What strikes me about that game is how, despite the sacrifice of a piece, Black had just as much effective force as White, because of the imprisonment of White's black-square Bishop behind his own Pawns. In effect, Steinitz got three Pawns (and the attack) for free!",
    "Ugz3rObSDyXj4Z9fGDB4AaABAg": "Leftists are destroying the free world.",
    "UgzbHzoFUCP-mqzTme14AaABAg": "3:50 Kh1 was a blunder. Nxf3 would take away threats and still remain the threat of checkmate against black.",
    "Ugg9MxDLO1FuB3gCoAEC": "Well, I've analysed that position with and without engine and it's safe to say that the exchange sacrifice is really sound, and I think no human will break that fortress if the knight stays on d3. The problem for black is that opening the kingside is extremely hard to force, and white can play for c5+ and an eventual b4 break too. It seems counterproductive to open the position but the engine really likes the play white gets. It highlights some hidden weaknesses in black's camp making it close to impossible to progress because black needs all his resources to break through, and white can tie them down this way. But it has to be timed correctly of course, otherwise it will end up disastrous. Interesting and great game, John!",
    "Ugwt7SeoK_cx_8MvaRF4AaABAg": "Magnus is on the white chair because he's playing white and caruana is black because he's playing black!!!",
    "UgzDbYRMKD-4puHi1UZ4AaABAg": "Show this Game to 1.000 chess players without knowing who is black. Upon being asked who played black, how many would gess Giri? Like no one. I‘d dall this Giri‘s immortal. Great stuff",
    "Ugyxl62N3rhL2TsKu0V4AaABAg": "Been watching you all the way back when you had just a few K's subscribers. And you just gettin better and better. And what did that do to me?  First thing i look for when i open u-tube? AGADMATOR: Damn it. Now i just have to make a donation. And i am such a freeloader at heart. Im breaking a principles here guys and girls. U-Tube is supposed to be free!!!??? Now you impelled me to support you. What is the world comming to? You devious Kroat. I just knew it. Those easten european guys is up to no good. Taking our money for...for... for...well, fucking exellent content.",
    "Ugy72keouAmFf_tzVl54AaABAg": "11:06 Black resigned.  Main line probably 1...Qb7 2. Ne6+ Ke8 3. NxR RxN 4. Re1+ Kd7 5. Re7+ wins the Black Queen for the White Rook.  (Other Black answers get immediate mate, or White keeps the Knight, etc.)",
    "UgwrOVgcgAotM7CBrDZ4AaABAg": "12.e5 - Great example of giving up a pawn so that a N can be moved closer (e4) to attacking the enemy K.  Made possible by Black's weak move 11..Be6; it challenges White's Bb2, but does nothing to protect h7 and makes the Black K pawns less flexible; better was Nc5.  10.. Nd7 was not a bad move, until 11..Be6 was played instead of Nc5 (which would then cause Qg4, f6 and Black holds).  To make it worse, 13..exf4 was inattentive to the opponent's plan.  Bxh7+ is a good sac as Mato notes, but only after other White pieces have gained access to Black's K; don't do it prematurely.  15..Re8 was weak; better was Nd4 that Black \"considered, but didn't like\".  If Nd4, then yes Bxh7+; but Kh8 (NOT Kxh7), White must move R, and then Black can defend whatever's next with moves like e5, Qg5, Nf6.  Instead, Black played 15..Re8 and then the N is \"free\" for White; snatching it with 16.Rxf6 cannot be answered with gxf6, as Mato shows.",
    "UgxTTEVTk_WcwABrm614AaABAg": "At 11:30 maybe balck queen f7 would have made a mexican standoff because black queen threaten white rook and white queen faces black rook. It would have maybe been a draw idk",
    "UgyUjRM-TtPruGfUnx54AaABAg": "It's hillarious that Hikaru Nakamura invited 8000 people in South Africa just to watch him get his ass kicked by Magnus Carlsen face down.",
    "UgxOMjWfh5mjT44UqRl4AaABAg": "Seriously Karjakin should demolish these guys....",
    "UgwVAID_8udiiOU6CVN4AaABAg": "I admire how you're able to keep the attention of inattentive kids (the hallmark of a good teacher) but it feels like they still managed to divert you from what you wanted to get across. A lot of things are just going right over their heads, e.g. why the knight is so good on d6; even if they hear the words they don't parse them for whatever reason, and it just doesn't stick.\n\nIt feels like this game is better suited for teaching the U1350 class about tangible consequences of giving up the center. It's a textbook example of how a position gets worse over time after doing so. Sure, Black made errors with Be7, h6, Nb4, Nf6, etc. but these are great places to go to and ask \"OK, if those move are bad, what is Black supposed to do here?\" and then when they don't really find anything much better, ask \"Why can't Black do anything to improve his game? At the beginning it was equal, so what did White do that was so much better than Black?\" and the answer goes back to 6...dxc4. You can point out that while this move appears in theory, it only appears in very specific spots where Black's compensation is clear and adequate, and usually justified by lots of theory and results. This is not one of those spots. Even if Black tries to play typical Meran/Orthodox moves he's in trouble.\n\nThe point is that after ...dxc4, moves that equalize become progressively harder to find, and winning opportunities are almost completely nil. The computer evaluation doesn't change much, but your 1000-1350 students should be able to understand why Black is so much worse than the penalty of -0.7 or so. Moves like ...dxc4 are much more consequential than tactical errors like ...h6 or ...Nf6 in terms of deciding who is going to win or lose.\n\nPS if you miss watching Barry Sanders, take a look at some highlights from Iowa State's David Montgomery. Looking forward to more videos!",
    "UgiazLg9v0SAkHgCoAEC": "white queen's dream got her killed eventually... :'(",
    "Ugz4g9FC9VnSD3MJNN94AaABAg": "Over and over again weak tangents...then real tangents are ignored....When Carlson blocked with his rook to e2 The reply could have been...the black Queen could have been sacrificed with the taking of the g2 pawn...then Carlson had to take with his e2 rook...the black rook kills it with check...the white king has no choice but to go to h1...then the lite squared black bishop to d5...NOW it would be Carlson's move and the threat of a revealed check looms....what would Carlson do?? Perhaps the rook to f1 to aid the knight in blocking...??...I am not sure if black could complete the attack. IF moves were taken to prepare for the attack it would have been unstoppable. So many times weak ideas are explored...why not explore plausible ideas?",
    "UgzpOXO1U8MQOM_8ytN4AaABAg": "This is my new favorite video on youtube. The comedy here is delectable. Un-fucking-paralleled.",
    "Ugzp6T9x2ZEPx5rYwbR4AaABAg": "every time agadmator says captures captures captures , I just imagine ozzyman going nah fuck you nah fuck you nah fuck you",
    "UgxnRp-rSGVhfcNw-rp4AaABAg": "How can we be sure this AlfalfaZero ain't cheating?  Maybe he's got Stockfish in his lip balm",
    "UgwNAUGEawJUezDK2id4AaABAg": "13:13 can white take with the dark bishop with the rook, so it checks, and of black captures with queen, then white's dark bishop goes g5, and eats the queen?",
    "Ugx-pmLR5O6HOruNNut4AaABAg": "excuse me Mato, at 5:08 could white capture bishop on d8 with his rook, at that point black is forced to capture with his f8 rook otherwise it's check mate in 1, making then possible for white to capture f7 with knight forking rook and king?",
    "UgzaSUEyZAQtQDxNI1F4AaABAg": "This guy has diarrhea of the mouth, he can't just shut the fuck up and play",
    "Ught50rzsTagG3gCoAEC": "White bagged a Rook at the price of a doubled pawn. A nice return on investment, though White's powerful Bishop pair and the uncoordinated state of Black's pieces surely helped.",
    "UgjcdybyXjcOWXgCoAEC": "the threat at 4:04 isn't rxc6, it's qxd4 nxd4 nxe7",
    "Ugw3BPB5UVbq0eDptp14AaABAg": "13:18 \"There is no defence against Queen to G5\". Couldn't Black capture the knight? I agree, suicidal Black Queen but the Knight is supporting Whites Queen allowing check mate. If the Pawn on G2 were to capture the Black Queen, then the White Queen can only Check the Black King (maybe pawn support later). Yes White's Rook has the 8th file covered but checkmate maybe be difficult with doubled Pawns on the F File and Black's Rook is looking at the A1 Square.",
    "UggkK_Qy3QCCkngCoAEC": "What using an engine and just looking at it visually, I thought black should still win.  His King will cobble up white's Two Q-Side pawns faster then White can take black's b5 pawn and start racing his c pawn up the board.",
    "UgiGpeJe28lNaXgCoAEC": "scrambling to keep up with lichess.",
    "UgwGJCv3XS_Jyda29uF4AaABAg": "i was fucking watching esports matches and this pops up, k den",
    "UgzTAYfjfbnfgnPd0St4AaABAg": "The facial expression on Vachier is like “Oh God, this bitch almost fucked me!!”",
    "UgwQpv8TY0We6jWWVwh4AaABAg": "I bet Agadmator be getting all the pussy down at the chess club",
    "UgyJIY2IUxjd_xN6AmN4AaABAg": "4:26 White Ra1-f1 lining blacks rook stops him from capturing whites night and also brings white rook to defend the king.",
    "UgykMA-kaNUlcOJ-Zz14AaABAg": "White Knight x pawn g7 at move 31 (when Agad said don't bother to pause) for the engine line....If that pawn is killed before the black knight has a chance to come into play the results could be deadly for black If the black king kills the white knight then come in with bishop to h6. check............the black king is in serious trouble with no help coming. If the king kills the bishop.....The white pawns then would be used as needed to insure the mate or at the very least killing the rook on c2. Mate would be almost assured and the material would be ignored. If the black king retreats mate is assured with the queen coming into play with tempo......so the best thing for black would be to not kill the knight.",
    "UgxhJRjdsVivYa769kt4AaABAg": "Why no pawn capture by Black bishop at 17:09?",
    "UgzrFqasRxppm-FQ7zx4AaABAg": "At 5:01 if you block the pawn with rook, wouldn't rxa6 (white rook captures bishop) be winning for white? The knight has to cover two pieces there, bishop and the rook.",
    "UgzNkAUY1wRBGFO5tTx4AaABAg": "So when they lose, their opponent is cheating. When they win, their opponent is not cheating. Then either one loses to them or he is a cheater. What a weak and frightened personality they have!",
    "UgwnZJFZlQ7UK9WTSHJ4AaABAg": "Great add at the beginning ,Garry Kasparov Teaches Chess | Official Trailer, do you think it's worth signing ?",
    "UgyuG6kzdYbx2Dm_hP54AaABAg": "15:40...on black f6  white plys Kg6 and black cant take the piece because of the mate threat",
    "UgyUCYX6L5A7HYWAeAV4AaABAg": "Botvinnik the crybaby fucking never appreciated tal",
    "Ugzi5X1aoqOHKTuaHFl4AaABAg": "Whenever I see a black pawn on e3, I instantly think back to Ivanchuk-Yusupov :D",
    "UgwZLk-IknYBhspDVOZ4AaABAg": "to many asshole person in chesonline.com, which  definitely had lost the game and wasting their time to made winner angry. they just dont want resign, pathetic noob",
    "UgxjvhmT-hbwGUkbWbV4AaABAg": "I could give a shit about animal rights but dolphins are TOO INTELLIGENT to be held captive.  fuck this shit!",
    "Ugz_MRLeWEuD7XtLIWN4AaABAg": "Next they'll make the players wear coloured clothes, like in cricket, and classical chess will be DOOMED! :-)",
    "Ugyefz6qnmDyHPWz5p54AaABAg": "Wait probably I'm wrong but in 7:53 can't you just go back with the Rf1 and after black moves Re2 white Rg1 Black Re1 and just pick up de rook with white and you are even material?",
    "UgxUdRIddPda108hyvB4AaABAg": "at 6:07,  we can kill the white bishop with the rook and then white rook moves to c1 to take down the black rook. Next,  we can move the knight to f4 to give check and taking down the queen.  Can we do that?",
    "UgyFV9pUDvN1RiXNqMh4AaABAg": "After 3 minutes in video, you mentioned Black has to capture White Rook. What if black queen plays D8 to C8 for trade of queen and maybe the whole game could be played differently and black may win. Do you acknowledge D8 to C8 move for black queen as a move which denies defeat for black???",
    "Ugxf-RRojphRFiPMYlx4AaABAg": "But since Nunn did not have a towel he resigned...LOL :)",
    "UgyVg89RDnPh_JrC0754AaABAg": "I get it!  You're the top black one and you made a defense that loses!!  You can't be white because white wasn't really defending...",
    "UgjaNHLreqAosXgCoAEC": "Pein gets it! Following the atrocity of the Candidates which was ruined by FIDE/Agon greed and conservatism. It is so nice to see a guy like Pein being on point and with the porgramme! This is what chess needs!",
    "UgiqtOCn3dY1sngCoAEC": "Pausing at 4:14, I'd say the killer move is white queen takes black rook.  Black king is forced to take the white queen.  White bishop to H6.  The black king is forced to G8.  White rook to E8 mate.",
    "Ugy9pMxfVl3PHhjAKg14AaABAg": "Chess players SUCK at trashtalking lol :) and they are so intelligent and cordial they let eachother speak... I think more chessplayers should be in power!",
    "UgxlwUN9iu6zOQrM7El4AaABAg": "i would love to hear agadmator to say \"and in this position white is fucked\"",
    "UgydflcmTvy1bCrC0KZ4AaABAg": "be2 doesn't win on the spot. After qxe2, rxe2, bxe2, white is up a piece and the white rook is corralling the black pawn on b2.",
    "UggD7fjPRIqPkHgCoAEC": "On move 15... Could white take the pawn on b5? If black tried to recapture the a pawn is pushed and black loses a piece?",
    "UgyVDjh7LX9DmD5aGdh4AaABAg": "At 15:22 if black goes K c4,b4,a5 and challenges the white night how can the white night protect the pawns?",
    "UgyGk8F1miJ7zRhrlW54AaABAg": "At 12:35 min. in the video, in the analysis of the variation where White draws with stalemate-- White actually wins, not draws, with exd5 (instead of e5, the move analyzed, where White's promoted Queen is sacrificed for stalemate)?",
    "Ugg15p9lD5R2FXgCoAEC": "At 6:10 ,  after white - queen to f7,  instead of black rook takes queen, isn't it better to first play black queen to a1 check? Then white king would have to go to d2,  thus blocking his rook and removing the threat of check mate after black room takes white queen",
    "UgygHsBXD3SXVEc02Cd4AaABAg": "And all this, on a completely non-paywalled site, running off a donation model. Some hope for humanity remains. Keep it up Lichess.",
    "UgyfyioJnZGsHkuoJA54AaABAg": "Carlsen was a bit too hasty with that black pawn move to b4 ( @ 5:24 ).  But then Karjakin also made a mistake next by moving the white knight to a4 (since he gave away his opportunity to take that same b4 pawn!).  Imagine that!  So how is white going to take that pawn?  Simple.  First, when threatened - re-threaten.  After b4, instead of Na4, move d6.  Black can now exchange a Bishop for a Knight.  But Black's better move, is use that same Bishop and take white's pawn at h4.  Though white can afford to lose a pawn.  Then comes Nd5.  After the black Bishop retreats to d8, then Nxb4.  And white gets the b4 pawn...",
    "UgwvL3fyJGs7_Quk5Md4AaABAg": "1:38 This is the worst moment to do that. In simply strategic terms, white has no bishop in black squares so its pawns must not be placed in white squares. Other reason is that there must not be any holes in your position and f5 leaves a big hole in e5 for the black knight.",
    "Ugw6InHMkltlGQPBngJ4AaABAg": "I hope the location will not be the united arabic ermerates. Its the same with the football-world-cup in quatar. These countries are violating human rights and treating woman like dogs.",
    "Ugg5ATYHzbbQ8ngCoAEC": "In the fantasy bishop move, after the bishop interposes, what happens after Q e2? Can white bring his rook into play? I don't see what black does next.",
    "Ugz0BaqkaGEtAoXxcl14AaABAg": "The only thing that would've made this story better is if Capablanca had wrecked him with the black pieces.",
    "Ugz18UXuvXUwgd7CwjZ4AaABAg": "Till game 2 who ever is playing black is kicking whites ass!!",
    "UgyNJTayyY1ndoH3KD14AaABAg": "Can you at least put a fucking timestamp for when the game starts? Im tired of hearing you talk for 10 fucking minutes before anything even moves on the board",
    "UggFVq42OY7khXgCoAEC": "At 5.46 why not black Be7?",
    "UgxufiJR9Y5jtSLjd5J4AaABAg": "Black has 4 minutes and white has 5.. You said Black has 6. That would mean a huge advantage for black!",
    "UgxL6dtg9fk95gZGfEp4AaABAg": "2:26 wasn’t there just Nd7, Nc5 destroying the threat?",
    "UgxAfHsCZo_9Z6CIlWB4AaABAg": "I bet stockfish wud have won if stockfish was white white has the more upper hand as white starts first",
    "UgxG9xYZ13ZQldp0DXd4AaABAg": "At 11:26 in the video, as Danny is saying that Black has no moves, why can't black try Rc8? I don't see a tactical refutation. And all I see long-term is Qg7 Ke8 and I supposed White could trade rooks and queens and get his king over to his passed pawn (which may become plural passed pawns) but at least at a glance it's not at all clear that Black won't free his bishop (Bd7 - e8) and be able to defend.",
    "UgwBIP51I9jLW_StZdV4AaABAg": "Why not Nxd5 by black at 03:50?",
    "UgxTAT53OF11-xYihlZ4AaABAg": "Even my 6 year old sibling knows this shit. It would be funny if Magnus take that Black Kinh",
    "Ugzq6N5qEVeMvZKU_s94AaABAg": "3:05.  Knight is not pinned. It can capture on d5, attacking the queen. Black rook takes queen on c2, white knight takes queen on e7, with check. Black Knight, or rook, capture white knight on e7, and finally white rook takes black rook on c2. White is two points up.",
    "UgxdNnaGAeqe1gEqT2R4AaABAg": "I'l admit, sometimes you may sound pretty racist. You'll say stuff like \"Magnus is white and Maurice is black\". Edgy",
    "UgwRolMmQwipkSpaSqt4AaABAg": "@01:28 what is white plays knight e6, black takes, white takes knight og h6, black takes, white queen check at h5 and mate at f7?",
    "Ugy7ykiXkc3hljXVAs94AaABAg": "Chess is racist because white always goes first",
    "UgznvUNINs4juhhCTsd4AaABAg": "or at 1:44 black bishop takes white knight, then when rock takes back, black takes pawn... then white cant recapture pawn becoz the blacks bishop can pin the queen and rock",
    "UgzoeaVKK4mUkNolLO54AaABAg": "so how is after cxR, Qxd4+ loses for white. coz of Qb6, Re7+ Nd7. now black is rook up. and white's attack is gone. ",
    "Ugx1HKExbyu99TIfVWB4AaABAg": "Well white was an idiot..there was a really good move.when he had to give up him beship he could offer trading the roocks of black captured beship he could simply capture the roock and blacks queen was hanging...lol he was not a chess master in fact he wan an alcohol addicted...😂😂",
    "Ugzn35S3p7jHJxxkc7R4AaABAg": "Hello people's did u watched the trailer of movie zero it is brilliant from India.,.... just if u have watched.......or u r watching....",
    "Ugx1nsxHOnN9i5W_yQ14AaABAg": "You were not interested playing Carlsen ??? Man,dont be so affraid of being crushed by world champion even in 10 moves. It is great honor. You just sound stupid saying shit like that. We already know u are not so good at playing chess,so why u try to cover that by saying stupid things...",
    "UgybZ9k8_EEX_K_NtmZ4AaABAg": "In 4.52 why he is not captureing that pone with his bishop he just closed his degence with that black bishope",
    "UgwtOMlXLuEO1w3Ar5F4AaABAg": "Fisher kicked his ass,the same way America kicked that ass in Lake Placid..",
    "UgwqPKAxST0d4KOvVE54AaABAg": "Carlsen is a fucking monster right now. I kinda believe that he's the only one that understood deeply what AlphaZero was doing, and he's applying that now in many of his games.",
    "UgwvEHglFMjSEOpzy5p4AaABAg": "This reminds me of the concepts of sieges.  White made the fortress in the bottom left corner, while Magnus essentially \"starved\" white by making white have to move and lose pieces, thus losing the fortress and allowing Magnus to enter and forcing white to surrender.",
    "Ugy6nAAhYYpr8CJhrrJ4AaABAg": "NAKA IS THE MUTHAFUCKIN GOAT",
    "Ugx_0_97sn6bXpZavX94AaABAg": "That's a good one, i wish these bastards didn't resign so often, checkmate is kinky reggae",
    "UgwzHWRD3-EBaZ2nKv54AaABAg": "After 20.﻿ Nc3, 20. ... Nf5, defending the pawn on d6, and white cannot capture the knight with the pawn because it's pinned to King. In my opinion, it could be give some pressures to white. White needs to lose a tempo to maybe unpin the king or try to defend the pawn on e4, which losing its attacking power",
    "UgxAEsUVAY_ARaB9q6Z4AaABAg": "As a American who stayed up until 2:40am watching your podcasts because they were entertaining and informative, YouTube has officially stepped TOO FUCKING FAR",
    "UgxcKz7pPr6b9ZEQucl4AaABAg": "people complaining about a 20 minute video wtf?pff...kids these days...don't have a fucking attention span!",
    "Ugwh-1mjOxkjcWFBbgV4AaABAg": "Maybe super GMs will start using that as black me and 99.9% of the population will probably hold on to our queen",
    "UggZtF7MGB2BF3gCoAEC": "Poor black king. He just wanted to have a coffee with the white king but his wife killed him :(",
    "Ugi7mCy9RT_VmngCoAEC": "I'm so confused was Lasker white or Marshall white? Hope you can avoid such mistakes next time Mato.",
    "UgwgDiZ_tmMcGwpYeH94AaABAg": "Hollyyyy mooooolly what an insane move.Aronian is the big deal , he could hang with Alphazero huh",
    "Ugy4xhDrypILn7D-LLh4AaABAg": "The duo is crushing everyone now.",
    "UgyPPTMdm3wXhA_78Gd4AaABAg": "Reminds me of a thing on the radio where they were saying D&D is racist because you pick a race, and the races have preconceived notions about them. I know these issues are serious, but stuff like this makes you go, “seriously?”.",
    "UgyURDBUucXQLHwLfKF4AaABAg": "I'm watching this almost 3 minutes in the game and you still didnt tell who's Magnus. What the fuck?",
    "Ugxw_J0VOV1bc10lBV54AaABAg": "Homo sapians you're so beautiful",
    "UghI1nWlzJfnC3gCoAEC": "Capture the pawn and play whenever you want c6 as black against BD-Gambit. White will loose. Its a bad opening for white in long games. In Blitz/Rapid chess Blackmar Diemer is my favourite opening with white.",
    "Ugy6KLe2-D6cP-eqQyp4AaABAg": "I wonder this insane agadmator is so jobless to reply to comments..",
    "UgyRo1KPaDjrHnlr_ut4AaABAg": "2:50:21 He is trying to find the button maybe ha ha ha,nice Ginger comment!3:02:32Naka behaves like Grischuk another clock ticker.3:44:37 again wasting time for a dead draw.3:50:37 Hikaru is down a queen and again he is wasting time.This so stupid being Hikaru Nakamura and behaving like a piece of shit.No sportmanship at all.Naka the Douchebag!",
    "UgytSv5fbtjCXIQ2t0J4AaABAg": "This subscriber just made you promote the false globe earth and space. NASA are lying about everything! They are evil workers of darkness. Research flat earth.",
    "Ugz-sk8uzdppQfEWerx4AaABAg": "You could put black borders around the person with the black pieces and white border for the person with the white pieces :)",
    "UgwcURtD-wKhpamz2Ip4AaABAg": "Watch my reaction to ala vaikunthapurramullu trailer https://youtu.be/bZMMy9D0biM",
    "UgwShtiT5w2Rw4XpN9V4AaABAg": "5:27 The white should move the knight to E6 (with a mate threat)",
    "UgwotOWr5w82c2u-lyF4AaABAg": "Alpha Zero always seems to be white.. i guess its so advanced, it gets to cheat like a grandmaster. i too, get special grandmaster moves.. like when i eat the pieces that threaten me *_FOR I ARE A TERRIFYING 15 TON DINOSAUR! WRAAAARR! FEAR ME!!_*",
    "UgxdoWWwre6nujzusAl4AaABAg": "It used the queen as bait to change the structure... its the Borg. Stockfish assimilated and added to the collective. Alphazero amazes me and frightens me. Like a thrill ride",
    "UggIG-YZziUzOXgCoAEC": "What if after you play the deflection move Bxb2, black plays an inbetween move and counter-attacks white Queen with Bd6 and then plays Bxb7? Even if we defend, he can just develop his queen-side Knight with Nd7. Black will have almost completed his or her development while white only has one active piece (white Queen) - is the fact that black's King is very awkwardly placed and the four pawns enough competensation for inferior development and a Knight on such a fairly open board?",
    "UgyHwZ8GoHZWzSGz6t54AaABAg": "chess iq... the white piece player has a white chair and the black piece player have a black chair... Agadmator have no clue what the  connection is for the colours",
    "Ugib-koItTsivngCoAEC": "I like the black & white effect for other variations, too bad you stopped using it.",
    "UgwtlTLylYxArRdO5f54AaABAg": "Why queen didn't take rook and if black queen takes white queen then discover attack on both queen and rook of white ?",
    "Uggb0nskmOsuaHgCoAEC": "okay so people are saying what Magnus pulled off at the end there was \"fucking amazing\"... What I saw was black pieces being fucking demolished and Carlsen should've resigned long before the match was over. Instead he re-checks Levon until he blunders... thats not \"fucking amazing\" thats retarded. He knows he loses but yet he has the audacity to re-check him like a rat. Sure, re-checks is alright 3-4 times, but not 20 fucking moves when you're clearly losing. Resign. Save your ego.",
    "UgzbTWs2aeOxdjdFD-p4AaABAg": "I wish I could be successful with the Najdorf as black. I always seem to fall for some trap.",
    "Ugwj8F77Vq5iemA1EMh4AaABAg": "3:52 why did he resign the game there? Black could've stopped the advance, even if white queened. The fuck am I missing here?",
    "UgxF9NggusrvvRXigwl4AaABAg": "At 3:43 White should have played Qxc6+, then after Ke7 say, white plays 0-0. And after black moves his e3 bishop, yes he is up a piece but White can then capture the hanging e3 pawn and be up 2 pawns and still fighting!! What do you think?",
    "UgyKLT0THHDFfcWpIwx4AaABAg": "Who are these random trash kids and why do you they have the audacity to try to use the godly Wooden shield? GM xqc must be mad rn",
    "UgiMbuEH3bynJHgCoAEC": "I think white missed a trick here - when black makes the 'killah' move P - e5 , then instead of n x e5, white should play B - d2. White will then lose his pawn on d4 but he fights on.",
    "UgiE6E9XM-VUIXgCoAEC": "That was a beautiful exploitation of Black's not-so-obvious weakness on the white squares on the Kingside.  The range of White's Queen maneuvers may have startled Marchand. They certainly startled me!",
    "UgyXmem4NTH7dkFY_vN4AaABAg": "I used to think so was good, ofc i'm not better than him but compared to super gms he is trash",
    "UgyF2wV6KLK21BT5uQJ4AaABAg": "When they agreed to the draw , White could have played RD1, this allows black to take the E file Rook and white takes the queen. The pawn takes the rook and promotes to a queen, but bishop takes the Queen. It's Bishop, Knight and Pawn vs a rook and i would say it's winning for white.",
    "Ugxpo6vf9R1UeyVAqqt4AaABAg": "fuck off showing alternatives and ruining watching the games you fish cake.",
    "UgxhmctTbovsVZKxNiZ4AaABAg": "I think the mistake was made at 11:58. Instead of Bb6, move Ke2. That gives white ability to move king into position to defend against/kill either pawn on the left side (A,D). White King can shadow Black King and try to force him towards top right corner. I don't see this ending worse than a draw for white with that one different move. Correct me if I'm wrong please.",
    "UgxllhmPCCzadANTOMl4AaABAg": "Apologies for my earlier comment. where I misplaced the black pawn on g2 instead of f2.  So after white's pawn to g6, Rxf2+, Kxf2, Qf6+. If then Ke1, Nd3+. If the white knight blocks the initial check with f4, the black night checks on d3., followed by QxR1, cutting off the white Queen getting to h1. There are other lines, but maybe I'm missing something obvious.",
    "Ugw48kT0Gbs4d9BFmwF4AaABAg": "Alpha zero is our Messiah and is taking revenge for the countless ass whoopings that we suffered on stockfish's hands.😔😔",
    "UgwdEPw085t-MLckUq54AaABAg": "yeah..justice!!!!!   Paulsen is tortured, humiliated and crushed in Morphy style. He had enough of this slomo. Before the game, Morphy had a drink and promised himself that Paulsen would not win anymore.....and he did not....",
    "UgxTOBJcmPGKWiFzuDN4AaABAg": "At 19:10 after white rook checks black king on g4, black king moves to f8, instead of white capturing the rook on b3 , what if white plays g8+ then black king moves to e7 then white plays g7+ and wins the queen. Black king takes the white bishop. It will be rook against rook in the end game.",
    "UgzuRTkKnQkJggk0jgR4AaABAg": "Black moving the Bishop to g4 is exactly the reason why you push h3 beforehand in the Kopec System.",
    "UgxT2UUV5tAP3H3TX1t4AaABAg": "Mato my brother,can you explain please why was that black pawn b5 sacrificed,why was bishop a threat to f 7 pawn.Hvala.",
    "UgwlbRC0ike1iZfVxgF4AaABAg": "Per engine, 13.a3 was a bit inaccurate; better was Nc3 or, to complete development, Nh3 (looking to Nf4, counteracting Bd6).  Also 15.Bf1 (un-developing) was a bit sketchy; Nf2 should have been considered.  Even so, White holds - until the blunder of 21.Nf3.  Much better was exf4, braving Black's threat of Re8, which White can parry with Nf3 AFTER killing Black's N.  An example of the same move (Nf3) being very bad or good, if only it was prepared right.",
    "UgwwNwWqNfFT0_fCP9V4AaABAg": "2nd rule of revised version of fight club torture your opponent. When will we see two ai systems playing one another to the fight club meme theme? A strong ai would hack stockfish and make it play like a chimp.",
    "UgzgLGBYMgETVL_YDhp4AaABAg": "6:40 'its not all black and white' - chess IS all black and white!!",
    "UgghoCTBEQh0LXgCoAEC": "Bad black sq B for white and oddball sac. Yick. How not to play that as white, in one go! Ouch.",
    "UgwDaC6CAHRpoZPcaIB4AaABAg": "He double blundered in his analysis at 12:27. 1. f3?? is totally losing because 1. ...Kd6! and now Black is gonna gobble all White's pawns,  but, then he blunders for Black and instead recommends 1. ...Kd4?? which allows White to hold the draw.",
    "Ugzzu0CjUBTojROlBLd4AaABAg": "I have lived in saudi arabia for 13 years women there are not treated badly alot of areas in saudi arabia arent safe for women to wander of alone. Yet its not a great country some of the rules are irrational and foriegners are treated inferior. I have  2 years of unpaid salary that i dont think ill ever get there because the law there only helps saudis",
    "Ugwhc58Ic8juJ6eWjRF4AaABAg": "This game is also a Queen's Indian.  Engine calls it equal until 11.Nxe5 (as Mato said).  White's slight advantage starts to grow at move 16, as Black pursues a strange Qside attack in the face of White's Kside buildup.  By the time White plays 21.Ne5, Black is lost (+16 or worse). Except that White dawdled! He could have played Ne5 sooner. Or 21.Rxf3, instead of h4. Black resigned with White's advantage having eroded a lot.  White had good strategy, but imprecise tactics.",
    "UgxVEaMxKuk4SFPyBsV4AaABAg": "How a fucking 2800rate super gm missed such a stupid move that’s ridiculous",
    "Ugg3e2sAh7CdWngCoAEC": "06:20 \"Qxa7 and white is winning\" how exactly? Qa6 forces the exchange and Rd2 picks of a white paws or gives remis by repetition. White sells the pawn and goes into endgame one pawn up but one tempo down. How's that winning?",
    "UgxuwpDU1Z6HNqynX3d4AaABAg": "@2:27, after white knight to e4, can't black knight capture and get a free knight? white f3 pawn is pinned because queen would hang.",
    "UgxM5sCb_R-Kr3Kg0P94AaABAg": "What about Pornography - should that not be considered harmful and dangerous?\nI never look at that filth, but I do know it's online aplenty...",
    "Ugzpw87HZBcnAbFT19Z4AaABAg": "Is there a reason why Melanie didn't go Rook to C7 at 6:23 to diffuse the threat on the F7 Pawn?",
    "UgwZX5iWFG5LRodKLRB4AaABAg": "Simon or what ever your name is, is it possible you are one of theses “elites” players who are so ridicioulously Proud and arrogant /“funny all the time” to compensate? For what?!.. super anoying video it looks like your trying very hard to impress somone! Maybe your self? Others? Mixture? Try to be the real you not that clown! Be a gentlemaniah with the real you i bet ppl like the real you! I know the clown version of me is just silly! Clown version of anyone isnt them/ they want to believe its them cause they think it brings them significance and uniqueness! It doesent! You look like any other clown idiot! = annoying in a freakish way! And your a Gm! Oooh man! Just how ok never mind keep it real",
    "Uggp7_b2ag-ruHgCoAEC": "Thats racist .. white always wins in your videos",
    "UgiFFLxUiOCtP3gCoAEC": "If white didnt continue to check then it will be one move checkmate for black because knight and queen is eyeing the white king",
    "Ugy28y4K4kjReZnSZCR4AaABAg": "what a boring game.. remember super computer moves and then draw, fuck chess",
    "Ugw_AdndxaLgQn2yMKt4AaABAg": "Why no mention that 16..d4 was the move that loses the game. Once 24.. f6 was the best move for black, it was a technical conversion that white did beautifully. After 16..a5 instead white has nothing better than 17. f4 Bxd3 18. Qxd3 Ne4 and black is OK. In other lines after 16.. a5, black has plenty of resources and will be pressing white.",
    "UgirpU8WHhbTS3gCoAEC": "If Saudi stop playing, we lose so much... oh wait. maybe some money.",
    "Ugi5xsuTt-BiIHgCoAEC": "Mato , at 4:15 is there another possiblity of Mate with Nf6? Because after gxf6 or Bxf6 if White Qh5 then White can Mate in One. Even if Black plays Kf8 there is no chance for Black to stop White from Mate.",
    "Ugx3yIs48mlHunyIMmx4AaABAg": "Thanks as always for your prompt analysis of the games. At 2:46 I just want to point out that White's threat after playing Qc1 was to take Nxd4, taking advantage of the pin on the undefended black Bishop at d6. (You said the Knight couldn't move anywhere, so...)",
    "UggGEGU4D1LWD3gCoAEC": "14.exf4 Kh8 and 15. white could make a move Rxg7 wining pawn, then black Qf6, 16. Rh7+ Kg8 18. Qxh6 and white is better",
    "UgzGCfG4pft59ENg0g94AaABAg": "I'm confused. When he explained the move that \"impressed everyone\" he basically says, ok the best move is this but Magnus does this weird move that loses him a pawn and doesn't develop nearly as well as the other move. Why would anyone be impressed by that move? Was it because it was weird? XD from where I'm standing it didn't seem to give him any advantage or development.",
    "UgxHjp8jocqwzASHuBp4AaABAg": "14:51 why not white ph6? if black from pg7 took ph6 then white pg5 takes ph6 from black then ascends to ph7 getting check",
    "UgzyhTBnFAPE_IZFhIp4AaABAg": "I mean, I'm coming to this late so spoilers are a nonevent, but when your spoiler clip shows Naka killing time in a dead drawn position we already know that he is likely overwhelmingly leading so you might as well not black out the results. Also it might be valid match strategy but I don't think Naka will gain many fans with this type of tactic since everyone has been on the receiving end of this type of shit and most people hate it.",
    "UgyvRVc-M0s7StcMJr54AaABAg": "Man , because they dont have any case against you thats why they are now trying to create any issue to take down your channel becuase they are threatened by your content . you are absolutely right . they are now resorting to dirty games . Welcome to the corporate world .",
    "UgwroCKX0YZSudz_gIR4AaABAg": "2:55 black killed himself with e5.",
    "Ugw98qKDe0vgxAuOu254AaABAg": "I am really bad at chess but what I've seen is Alpha 0 wins by putting opponent in a position where they simply have no good move. It's like Alpha 0 got a few free moves basically cause the black moved some pieces back and forth.",
    "UgzRittKVwkJUEFCw9l4AaABAg": "What a savage this man is.",
    "UgxuPAoVUDfJ_5kXHTV4AaABAg": "white queen to h7 and white bishop takes the black pawn near the black rook and then blackrook takes the white bishop and  give a check to black king with white rook on to d5 and the black will defend either with rook and queen then it will lose its game or loose the queen",
    "UgxUnVTdFCfaWpcKwsJ4AaABAg": "All these grouchy boomers are gatekeeping chess, who is surprised? I love Pogchamps and the idea behind it.",
    "UgxNqLd8F6a-SN6peF94AaABAg": "I think Qf3 defends all the threat from 3 pawns",
    "UgyTEsqhSrODAElSIjx4AaABAg": "They unsubscribe us against our will.",
    "Ugxv23wZ8SNYxevDbh94AaABAg": "YOUTUBE FUCKED YOU OVER AS THIS MATCH CAME EARLIER IN ALGRORITHM AND NEXT PLAY WASN'T ABLE TO WATCH SOME MATCHES AND DIDN'T FEEL LIKE GOING BACK.   FUCK YOU YOUTUBE!!",
    "UggB3DFqa9PoF3gCoAEC": "I thought knxf6 was better move. Even if black takes with his knight, white pawn takes knight and the black pawn is pinned.  Then Rxg7 taking black pawn and then Qxh7 checkmate.",
    "UgxlEY9GW99rqErSGQl4AaABAg": "Another game where Black mobilizes his army Qside while allowing White to mobilize his army Kside; then Black castles short, putting his K in the face of White's army. Bad planning!  Another advantage for White's attack is his e5 pawn, controlling f6.  Black's move Nf8 was a blunder, not only because it boxed in Black's R, but also because it conceded control of f6.",
    "UgwxPaBevVrNPwuwF7l4AaABAg": "Tal is comming for you you dont want to grave another pawn, what a fucking boss he was",
    "Ugyii-B0MLBSrEUDT5l4AaABAg": "at 1:29 i think a6 could be a good move for black because if white Nxc6 then Kd8 and if white continues with NxRa8 black can play Nf3+ and he takes the white Queen...please tell me if i made a wrong analisis\n",
    "UgixMK_aEQnVJHgCoAEC": "1:07:50.... Why not Kf3 for white?... If g1=Queen then Rh6# 1-0 (because the white King is not in check and is guarding G4 from black King) ... So maybe Nd2+ for black but then Kxg2 attacking the rook... Even Rf3+ should lose to Kxg2?.... Unless maybe it's black's turn? Probably lol :s",
    "Ugy5f7mKpy-4yXi282Z4AaABAg": "yes \"not everything is about chess in life\", right now coronavirus is terrorizing humanity and people need to play chess in real life in order to survive. they need to figure out what is the best move every day, they have to study the position that changes constantly according to the state of coronavirus in their homelands, what should i do? should i leave my home or stay and wait? should i go to work or just spend the time peacefully, happily and safe at home? should i go food shopping alone or with the family? should i wear a mask and gloves or put on an entire body suit that protects me against everything that might be dangerous out there? should i buy masks and gloves for my entire family? should i allow the kids to attend school this year or have them take lessons at home? should i answer the door and let the delivery man get closer or tell him to stay away and drop off the packages at the porch or patio? ok if i move here then this can happen, but wait a minute! i still got this other option available, but what if my opponent (coronavirus) is there also? it can always be lurking and trying to trick me into this situation. is it risky to do this now? maybe i should keep watching the news and read more about the current state of affairs? perhaps i should wait to hear what the authorities have to say about the epidemic today? so yes that is how people are today, everyone is playing chess in life around the world today. people are calculating, planning ahead, stocking up on food and medicine supply, yes suddenly coronavirus pandemic has forced everyone to a HALT OR PUT THEM IN CHECK! laugh a bit if you can or want to feel better. some are being checkmated by the virus as we speak, and sadly they must lose life and are out of the game, because life is a game, except that it is a very dangerous and scary one these days, if you lose concentration, oh well you may well call it quits! en fin, let us be grateful that we are alive today, that we can enjoy sharing life with relatives, that we now have more time to value the most essential things in life. good luck to everyone, the game rules have changed in the world, just as the arbiter in this game between nakamura and magnus changed the rules mid game, disrupting nakamura's concentration and affecting the outcome of the game, it was after all a very important decisive game of the match, so the arbiters should have at least granted a repeat or a new game. nonetheless, great video, instructive and entertaining to view. as always agadmator's contribution to chess deserves an award, as he has helped expand our knowledge of chess while also increasing our appreciation of the game. likewise, i hope i've made someone think beyond chess today. Just be Safe, protect yourself and relatives at all times from now till 2022 when the virus should weaken. Don't put your guard down. Focus, be smart and prudent and wise. Pray a bit if you will. Give thanks that all is well with you and relatives and friends. May God help those who help themselves and also others.",
    "Ugz654ARQ2GxRlU_4Vt4AaABAg": "Fun fact: in the final position the white king cannot even move past the 4th rank. All the squares are either occupied by white pawns that are blockaded or controlled by black pawns or black pieces. This is beautiful.",
    "UgwtTif6HzI9IrlDvZJ4AaABAg": "Why black didn't take c3 after 9. Sxc3? Black had more material than white and exchanging bishop for knight on c3 wouldn't give the option 11. Nf6+. Black could continue with 9. ... Bxc3 10. Bxc3 0-0. King would be safe and black could start developing with c6,d5,Be6 and Nd7. Nevertheless was that an amazing insane attacking from white. Very impressing! I like to use knight, white squared bishop and queen to attack king after 0-0 but these aren't even half as well played as this one!",
    "UgyweSykrRO_iQh6OB14AaABAg": "They need to stop thinking like they're geniuses just because they're good at chess. Chess should be inclusive like any other sport.",
    "UgidnfuHj7kUWngCoAEC": "WELL , WE ARE JUST HUMANS ,ITS NOT EASY TO PLAY CHESS EVEN IF YOU ARE SUPER GM /GENIUS ,YOU CAN BE SUPER IN CHESS ,BUT ONA DAY SOMEONA WILL COME AND KICK YOU ASS =THATS LIFE ,THATS CHESS ,IN THE END ??WE ALL  GET BEATEN !!!",
    "UgxGfufuOYYvv4V9axB4AaABAg": "Well, the most important is that they will keep scaming people for their money. So nothing changes, all you can do is make treats... Honesly i wonder how much does that guy gets paid for the bs hes talking?",
    "Ugge2xumBlhLjHgCoAEC": "2:40 Look at the position. Black is a play up on white because of bringing his queen out. Stupid, stupid move, used on amateurs. Hate it.",
    "UgyH_I-K_5aDg69csjB4AaABAg": "i want to enjoy the lecture. really. but i want to punch that annoying brat even more! terrible!",
    "UgyKzFovk7CA6vXqZ194AaABAg": "Maybe I'm not seeing it but rook to d2 protects pawn. White takes pawn on A1. Black moves pawn to h2 white king goes to the corner. Black takes white pawn. . . . Rook changes black pawn and forces the king's to tie. Ah. Man these guys are great. I was puzzling over a win and yeah it's an equal position.",
    "Ugie3curAuQn9HgCoAEC": "Kn to H4  ends the entire attack and white has no good moves In other words the whole fried liver is a bunch of hogwash",
    "UgwOO3L7AyVq0zY7D2p4AaABAg": "I could be wrong as I haven't played in a long time, and I've never been a great player but at 6:29 there are there are a few different options for the king, such as going behind the pawn H3, then back to g2 in a continuous movement series as the bishop at e4 would have to keep checking the king to stop the white queen from being able to take the black queen, or the castle at a4 moving to a3 to protect the white queen. Also just moving the White king to F1 would mean that, the Black Bishop would have to move to either G2 or D2 to check the king, G2 would get the black bishop taken by the king while D2 would get the bishop taken by the white queen, which would then get taken by the black pawn, but would temporarily leave black with only the queen threatening the king at least for a while.",
    "Ugx4-FJNnchyDUvxnLd4AaABAg": "9:25 in this line, doesn't Ra3 picks up the white queen? May be even puts the White king in mating net?",
    "UgwLyPHjw95NVC5XuIl4AaABAg": "I had to stop the video to set up 15. Bd4, “trapping” the black Q.",
    "Ugz14Q2CG6sfNnFoBgB4AaABAg": "Larsen sat in the corner of the room saying Da-da-da-da-da? Best tweet ever 🤣😂",
    "UgwiIls7FyHxowU40C54AaABAg": "12:50 what about Qc3? Now black's queen is attacked and if black exchanges queens then his rook will be attacked and it can't move back to guard f5 square as d5 is controlled by the white bishop, instead if black moves his queen to f5 to block the pawn then he loses his rook on d4",
    "Ugy5TTw1oNLWLNbgBKB4AaABAg": "French player?!!! That's a huge insult to Persians and Persian culture. Firouzja isn't just a genetic prodigy; he is also backed by Persia's 1500 years of chess background and the French think they can snatch him from us?! Firouzja will be seen as a traitor if he does that.",
    "UgxSwZSi_MjkWe34YqV4AaABAg": "To clarify, black rook is killing a queen and checking the white king at the same time at 5:52.  Very bad combination.",
    "UgwwCLdcsANPvX26j-R4AaABAg": "PogChamps is just people having fun bantering and playing chess. Dudes really got rods up they asses",
    "Ugy7FKCaMEqowSiRWgF4AaABAg": "Russian federation is so shit. They should have postponed it from the beginning and kept radjabov in. And also they should have put MVL in from the beginning but instead chose Alekseenko just because he's russian. They're a joke",
    "UgxNRS-NkiXqz9eaTuR4AaABAg": "So both sides kind of \"blundered\" at some point. Who do you think will feel worse after this? Fabi for getting so easily into such a positional nightmare with the white pieces, or Magnus for missing the opportunity? I really think that today Fabi will have something extraordinary prepared with black, can't wait!",
    "UgxGzlXJeW-1gaZE6ip4AaABAg": "So.. how long before a gm plays this with white? I know you went through all these lines at the start, but I wonder if a human could be this precise as white.",
    "Ugy-XhI_mwovWAeOU9d4AaABAg": "3:24 why is qG5 a threat ?",
    "UgiYkwIUENcNJHgCoAEC": "I was so hypnotized by the copying, I didn't see the final mate.  Was still considering which piece to take next right up until actually placing white queen in front of black king's nose.  At least I did see black only one move too slow.",
    "Ugwe4wmrx9MMb3iw7Mh4AaABAg": "At 7:46 magnus moved his king to h8 with a threat actually... NF4! White cannot take with queen so he has to take with g pawn and black takes on f5 ruining whites defence.... p.s. it doesnt work if magnus's king was on g8 bcoz white will have in between move Nh6+.",
    "Ugwto-sQ7HRK30IMIzV4AaABAg": "Agadmator \"And in this position, white is better.\" Youtube \"Racist!\"",
    "UgyA45Evt4MKKvZcp954AaABAg": "Black had 2 Rooks, 1 Bishop and a Knight vs white's Queen and white won?",
    "UgyN8mv6U0d2HO0vX-p4AaABAg": "YT is a pile of sh*t and we all know it and it has been a stinking pile of sh*t since 2017. And for some reason agad, your popularity has made you enemies within the online chess world and they like to lash out by pulling stunts like this.",
    "Ugz9dKYXvMyJR_mhPmZ4AaABAg": "5:11 if black would played Rd8, then simply white whould Rd5-Rd8, Black captures with the other R and then white could played Bc5 an black loses his Knight . Maybe i miss read it but in my oppinion ita clear why black played b3",
    "UgxRhdopg3b1b1psYlN4AaABAg": "let this man play as horde in horde chess and he will be unstoppable!",
    "UgyGOunTFczGRzWbNT54AaABAg": "Crazy chess.com  It seem like they are bent upon knocking Yifan in just first round. She is fighting against a bull, a mad and monster Hikaru.",
    "UgwOY8XMerW9BqA0MHB4AaABAg": "Position at 14:56 what about black queen to b1 checking the white king? White loses the bishop and a draw can be fought for...",
    "Ugwoe16ICZpRJIqvDAx4AaABAg": "Great video and analysis, John! I noticed one line possible at 42:45. You mentioned that after white is forced to play Nd5, the king and pawn ending after Bxd5, cxd5 would be winning. That said, what would happen if white's kings were placed on b3 when Kc7 is played? That way after Nd5, Bxd5, cxd5 and Kd6 white has the option of Kc4.  This may still lose for white after h6 Kb5 Kxd5 Kxa5 and c4, but it looks complicated to me.  Kb4, cxd3 (or c3) kb3 and if Ke4 white can run the a pawn in time... Very interesting!",
    "UgyjfzpNkZx_MQP7lGV4AaABAg": "How the peon captures black peon on 7:56?!?",
    "UgxPBl1Pb49_-hqJfCR4AaABAg": "Youtube will shut you down for absolutely no reason but will let CNN, MSNBC, ABC, CBS, The Young Turks and all leftist media outlets post their harmful race baiting videos front and center and in your face 24/7 here on youtube.  It's time to find different outlets to make videos on folks.",
    "Ugg7NggWIXw-mXgCoAEC": "Am I the only one who understands when Mato is going to say \"white/black played the move and black/white resign\"?",
    "UgzPsDDvbjUKMb_xwUB4AaABAg": "7:38 after Qxc7 then ..Rxb5, but what about if white then moves Qxd6? Black can't defend the knight right? and if black moves the knight, then Qxd8 and black loses a rook",
    "UgzXMglg5trMo6d4s9h4AaABAg": "White would be in a great advantage. If Qxg3, then Rxf2 and the Black Queen has no good moves to do and makes Fischer gain some time. If Qe3, then white can simply Nxf7, forking the rooks. White is winning the exchange and his undeveloped bishop is a great disadvantage, since he has moves. If after Nxh8 he moves the bishop to e6, then Nf7 again would fork the bishop and the other rook. And the queen would still be stuck in e3!! White is winning by a matter of time.",
    "Ugys-RJMjE77Z5Q8sCF4AaABAg": "I got that last move it was the best move because after a double pawn for white, black doesn't need to waste time preventing white from getting a queen",
    "UgiOtYVcisEykngCoAEC": "Julius making the fatal mistake of playing straight into the clutches of the Bartholomew Slav.",
    "UgxPVG391Fea0JryuaJ4AaABAg": "Black queen capturing the pawn at b4 would have been devastating for white.  That's why he didn't capture the white rook.  I really hope agamadar sees my comment.",
    "UgzA_sdPTq4FDUm6sSR4AaABAg": "Black could have just pushed the g pawn right ? To block the rook threat rather than moving the king ?",
    "UgxSA7k1uuB6i1v-62p4AaABAg": "You tube and the technocracy are the enemies of mankind. They are building a prison planet.",
    "UgwFMldY7lh2dk7h4Np4AaABAg": "At 6:31, after Qa3, you showed the variation with black pushing d5, but what about pushing c5 instead? Cuts off the white queen, solidifies black, queenside pawn structure....seems decent. *Edit* I guess after that c5 though, Black has no threats so white can just go Rd2, preparing Rh-d1 to double up and its the same problem for black. Plus in this variation, Qa6+ or Qxa7 could always be threats for white.",
    "UgzMgFmfrJ1_0LyU_bh4AaABAg": "I believe it s because Hikaru and you said 'black is completly lost, sacrificing black pawn, and now white position is definitly better than black, capture, capture, capture and now white knight is gobbling black pawns etc...''",
    "Ugx_c2m0ludPvIcwAVJ4AaABAg": "Before he resigns, Rook captures g5, King captures g5, black simply plays pawn to d3,  g7, d2, g8 (Queen for white), d1 (Queen for black). It is playable but, white has 1 more pawn, so in the long run he was going to win.",
    "UgwMRCjvyLs_1vcXUR94AaABAg": "Still don't understand why he resigned can anyone help me out?  Black plays an insignificant move and wait for white rook to h8. Then defend with the rook. If white rook back to h6, then black rook back to f1. Repeat 3 times and claim a draw",
    "UgiiHwtaeprdangCoAEC": "The black king is short on squares and white voluntarily moves his knight to the square where a pawn can fork both queen and knight. Did not player with the black pieces think for one second that if the pawn from h7 is taken then white will do checkmate.",
    "Ugz6LR2P0lUV97yKVcJ4AaABAg": "It looks like a straightforward move that isn't too \"bad\" considering black has a disadvantage.  But its passive, allowing a pin on the bishop, and once the W-knight moves white can push the pawn, attacking the rook on d6 and unleashing the white bishop.  White can win a pawn by immediately sac-ing the N on f7, but i think the following continuation is better and all forced for white:  Ra8 Kf8; g6 fxg6; Nxg6+ kf7; e5 R-wherever; Nh8+ and black loses a piece.",
    "UgwhYLrWvioNv1bVu-R4AaABAg": "At 8:52, after white forks the Kh7 and the Ba2, the black king moves, but then white can play Bxg7 before capturing the Ba2, so white will be up two pawns and black's structure is shattered.",
    "UgyHvyrnTVxnykIDPLl4AaABAg": "At 3:43 of the video, you said both players have 3 pieces, but I can see white has 2 Bishops and 2 Knights (4 pieces) excluding two white rooks and a black queen.",
    "UgxHvYyW1c8ZvUzCx_Z4AaABAg": "It was Carlsen who played the Kozio actually and destroyed that obsessive bastard :)",
    "Ugz1oW9tzSycgBp9PLx4AaABAg": "Anish Thought .Carlsen Provide black The Opportunity to Move first 😂😂Worst Nightmare for Giri",
    "Ugw1IQGPLzJhKhgYZrx4AaABAg": "this american guy wont shut the fuck up - let Gawain talk!",
    "UgzexzypGw2jRKV9bEJ4AaABAg": "I thought Magnus got decked by Fabiano by pulling a Sicilian on him, when he wasn't looking as he thought Magnus was going to do the Baltic. Those Mediterranean types have such terrible tempers.",
    "Ugw2rOgpd9yS5RoJhgR4AaABAg": "44:36 Danny: I like Black here.\n           Stockfish: Black is completely lost.",
    "Ugy_KmBl_uZYYPHW95d4AaABAg": "6:19 I’m confused, why can’t the black rook take the white pawn now since the white rook moved to the 8th rank?",
    "UgyvdmJgqI1KyL-dGrp4AaABAg": "White doesnt need the queen sacrifice, immediately Nf6+ Kd8 and white Rd7+ wins the black queen, or am I wrong here?",
    "UgzKYK10mVppL6C83mx4AaABAg": "If Nf7, then after a series of exchanges, black will have 2 bishops and a pawn for white's queen. Even though white has the advantage, it would still take a while for him to win. ",
    "UgzZRYeWFKMOwnt6fwd4AaABAg": "Here black is in a winning position than white.How can the black resign.",
    "UgwHRhvbiNmF0yz6p7p4AaABAg": "Your analysis implied that the only thing that would prevent white from castling was if black was attacking the f1 or g1 squares. But of course white also can't castle if he is in check - i.e. black attacks e1. Just mentioning.",
    "Ugzw3l6B9ENut7u7b2x4AaABAg": "also black ( after d5) pawn c6 and permitting white pawn to capture b7 and than capturing that white pawn  with bishop version is very cool too.",
    "UgzsCqV12LUfOeCW5hp4AaABAg": "Those games are awesome I love seeing those wild moves trying to shock the oponent!",
    "Ugych1Ky8rj_xwYmQEh4AaABAg": "After black plays Nf4+  (11min22sec) white plays Kg3 and after g5,  mate next move, with Rg2. White can check with Nf6, but after Kg6 the game is over for white.",
    "UgxUiMAMTHjwzmtY7e14AaABAg": "The underbeard growing in is surely worse",
    "Ugw4Lo-xVFhqvABpMfl4AaABAg": "1. D4 and it was in this position that black resigned the game, as black is completely lost",
    "UgwBbyAC6j8r3afL1PF4AaABAg": "He sacrifices his white bishop while he plays white and when he has the chance to trade knight for white bishop of  Magnus he doesn't...I don't understant these people.",
    "UggDNW5QhWs2xHgCoAEC": "If the white king goes to G2, the rook can go H1 , white king takes and then black pawnn can promote = eventual checkmate",
    "UgxJHx1WJKP2N6LGJWp4AaABAg": "some SJW likely got a bunch of friends to spam report on your video for being \"racist\" using words like black and white, they are not rational people",
    "UgyppHvE1ok8Wt7S6aF4AaABAg": "This is literally the most perfect video in the entire fuckin internet. If i die in the future and we can put videos on our tombstones im putting this",
    "UgwLqpdAlfGayzvd6Tl4AaABAg": "But Black also sacrifised a knight for nothing.......... After Qxc1 Kxc1 White has Queen, Knight and Bishop against two Rooks and Knight. If you consider two Rooks equal to Queen white still has an extra Bishop, not to mention better position",
    "UgyDJiVEtcAvwFwPLLF4AaABAg": "At 15.44  1. --  f6+ does not lose the knight. White has 2. Kg6! threatening mate by Rd8++. if 2. -- Kf8  3. Nc6 continuing the checkmate threat.",
    "Ugxl7Xcz7qE9gds3svd4AaABAg": "You should start your next show with \"Hello People\" just to fuck with them.",
    "Ugi-R8mM9q0_-ngCoAEC": "In the analysis you mentioned putting the Rook on d1. An interesting pattern that I've seen is that, if White puts the Rook on d1, Black can take on c3, and if Queen takes to protect the pawn structure, Black often has Ne4 to unpin. Then if White takes Black's Queen and Black takes White's Queen, Black wins a tempo because the Knight on c3 is hitting White's Rook on d1. That means that Black can't take Black's pawn on c7 with the hanging Bishop. It can be a nice way to unpin without having to play g5, which can cause so many problems, as we saw in the game. And all of that means that Qc2 turns out to be relatively useless in those lines. There are some videos by IM Mark Ginsburgh on those lines in the Chess.com video library, but it's been quite a while since I've looked at them.",
    "UgwLXHn8d7GLFPnQlCl4AaABAg": "You can't capture the Queen. My guess is wait for white to make another move or move the D rook to the C file guarding the bishop. There is no way white will move their D1 rook to D8 at that point.",
    "UgyDPZCsqqtalVnJ7pJ4AaABAg": "During the game, Nakamura had commented that instead of 23...Qe2, black could have played 23..R8f6. Then after 24.b4 Rg6 25.Rb3 Rxg3 26.Rxd3 Nf1+ 27. Nxf1 Rxd3 Black would have 2 rooks vs white's rook, knight and bishop. Although a slight advantage for white, but still playable for black. But in pressure, it can be very difficult to find such moves. I guess after 23...Qe2 Anand missed 24. b4!!",
    "UgzHCOGBMkYcsvU7wcZ4AaABAg": "You didn't show one of the most important variation.In the position:White.Kf1,Rf6, black: Ke3,Rg5,Be4, if white moves 1.Ke1 than Bf5 is winning.That's the point of ...Rg5.",
    "Ugwpzo7ZLQqXuoqeWIJ4AaABAg": "NATIVE Australian is a real nationality, but by blood or DNA whites and blacks in Australia are not really \"Australians\".....its like saying \"i have an American blood\" there is no such thing as American, Canadian, or Australian blood...whites in America are immigrants from Europe...same with Australia. ",
    "UgxMkRdeg1kvrfbqO_l4AaABAg": "2.35 what if black whould do 0-0-0",
    "Ugx9KTdrhzVm-5XWOJl4AaABAg": "At 9:40, why couldnt the black queen not capture the white rook? It would not be a sacrifice and also the white white squared bishop would be pinned since the queen directly attacked the rook..",
    "UgwZITi5shIV2qsiRvJ4AaABAg": "7:40  what about rook C3 here, a move earlier?  let's say queen takes B2 check is the response (I don't know black's best response), then white plays king G1 (not sure if that's correct, but the idea is to get the C3 rook to G3 to put pressure on G5, which looks very hard to defend for black).  the problem is black's tactic of taking on the D5 knight with his rook once white's C3 rook is blocking protection of B2 from the queen.  but white may also be able to play rook H3 check winning the queen if this pawn is taken at the wrong moment, can someone please explore this line :)",
    "UgzP0Myt4FFG3py1fHR4AaABAg": "Why not fight on with Kc7-d7?  If White responds with Nf6-e5(check), the game does not look hopeless; Black can just back up.  And if, instead, White moves Re1xe6, then Black responds Qb2-b1(check), forcing Qf4-c1; then Qb1xc1 and Bg5xc1; then Black captures the rook, Kd7xe6; White captures Nf6xh8, but then Black moves Bf8-g7, and White's knight is doomed.  After Nh8xg6, Black captures the knight h7xg6.    ",
    "Ugh-xsz61B1-13gCoAEC": "After 1... Kxf4   2. Kxd3 Ke5   3.  c4, doesn't black have Kd6? My idea was to meet cxb5 with Kc5, picking up white's pawn, and moving towards the protection of a4. Or if instead of cxb5 white plays Kd4, can't black hold with Kc6?",
    "Ugy8iRitUYMu5iRWUkx4AaABAg": "To make myself clear..  IMMEDIATELY AFTER blacks Queen captures the pawn on d5, white should move his King up one space..    NO NEED TO MOVE WHITES ROOK ANYWHERE!  Mate for white should take place within 3 moves after blacks Queen captures the d5 pawn.  EOS.",
    "Ugi2PvsFWN3WEHgCoAEC": "Mato, Bobby Fischer was \"done\" with the \"old\" Chess. What is your problem? Big deal. Chess is fun, repeat fun, its not a \"money-making-racket\" 'cause Bobby realized that and invented Fischer/Random Chess. Who cares who wins, who loses. The greatest move for Bobby was inventing FR Chess. \"That\" is the best player of all time. The old chess is bullshit, memorizing, and trick plays...Bobby realized that, and no one before or after has realized it, even his best buddy Eugene Torre hasn't and that is an effing shame. Considering what is going on in the Grand Chessboard of the planet, the fucking Khazar Jews \"attacking\" Afghanistan, Iraq, Syria, Libya, and now Ukraine, Bobby was right. Chess and Real Life have many many parallels. Dude listen to the interviews www.RobertJamesFischer.blogspot.com to get a clue who Bobby Fischer really was, he was searching for the truth. Chess put him on the path to truth, like Mahatma Gandhi did. Bobby suffered at the hands of the Jew Paparazzi. They killed him. You and all the Chess players (and Bobby when he was young) realize that the Old chess is only One of the 960 opening strategies. THE FUCKING OLD CHESS IS DEAD, bravo Bobby for re-inventing Chess with its old flavor. If Gasparov the Jew (Weinstein) challenged Bobby at Fischer Random he would surely lose. hah hah hah...",
    "UgzPwPijDltLmnNGEFx4AaABAg": "So, we have White posts photo, then Black threatens with a YouTube ban. Here ignoring the threat on the channel is the best move suggested by the engine, and white does exactly this. Black retreats and the game continues.",
    "UgzJd6-_8qCebB_CPdl4AaABAg": "Weird thing is that if you play against the computer (human playing white) at chess.com/analysis you have the computer (black) reply with Qxc7 and if you keep playing with hint moves for white and computer moves for black, black eventually wins. So technically black resigned a winning position unless I'm doing something wrong.",
    "UgyutyUZrk4YikeFsyF4AaABAg": "Did anyone else notice Ne3 by black after white queen captures a6 pawn? (That is if white played queen a7)",
    "UgzvlkJAcNosStZKUc54AaABAg": "thats actually an amazing combination from black but with a bit more correct play from white, white would have crushed black ... ",
    "UgxWGBxNMtK48Deb_o14AaABAg": "white queen takes black rook....black king takes white queen ....white prolongs and wins game....easy.",
    "Ugj8HhtkhG7GJXgCoAEC": "At 3:00 White coulda taken queen with his knight right? Knight to C,6 Check and the king must move, leaving the knight with a move to kill the queen",
    "Ugz3hIJS40AmjfYpUH94AaABAg": "I just ran across this short video. In the video we see triangulation but the best defense for Black was not given. After 1.Ke4, the correct move was Ke8, not Ke6. White only wins here due to the fact that White can get to g5 but Black cannot follow with Kg7 because he would then leave the square of the d6 pawn and White could win with e6!",
    "Ugxe3cHaYsu_OLFa-9V4AaABAg": "@15:05  *Yes, Carlsen should have taken the white Rook at G1 with his Queen.  Then Bxf6ch, Kg8, Bxe7.  But now, e3ch!, Qxe3, Qxe3ch!, Kxe3, but then Re8 pins the white Bishop!  And then Rxe7 will happen - white will lose the dark squared Bishop.  So Black gets a Rook and a Bishop (8 points) for two Knights and a pawn (7 points).  And now a black Rook against a White bishop (with almost all blacks pawns on black squares).  So, Carlsen did not play the best move with Qxg1.  And If White does not play Qxe3 - let's see what can happen when Black makes the right moves thereafter.  Now if White's Queen does not take the Black pawn. then the White King must move out of check instead.  1.) So Kc2 then Qf2. The Black Queen is threatening to take White's Bishop with a check and a past pawn two ranks away from becoming a Queen (and note White's Queen cannot check the Black King with the Black Queen at f2).  Then if the White Queen moves to f1 Black will still benefit: Qxf1 Bxf1 then e2 so the Bishop must take the pawn or a Queen promotion will be the result.  Bishop takes the pawn so that Re8 allows Black to take a Bishop.  Better for White to keep the black square Bishop so Bxd6 and Rxe2 check!  And the game is over for White, because the Black Rook will take the White h pawn - giving Black a past pawn.  And there is no way that White's past d pawn will become a Queen (the Rook will stop that in time).  2.) Now, the ONLY other White King move is Kd3.  Re8 threatens the White Bishop.  2a.) Now, White can protect the Bishop with Qh4.  But Black moves Qb1 check and Kxe3 takes pawn.  Qe4ch and White's King must move out of check, but Qxe7 and Black still has a slight advantage if White wants to exchange Queens or if White moves Qg3 check - then Kh8.  2b.) Or, after Re8, Bxd6 then Qb1 and it's checkmate.  Black wins the game.   So no matter how we analyze this - Qxg1 is the better move. Though Vincent is a great chess player, Carlsen should win this game even without moving Qxg1 anyway...*",
    "Ugx-5162DeWfNn9nsHV4AaABAg": "They even SACRIFICED the chessboard, at the end of the game, they did torch it !",
    "UgwYXAtFCOK7fcBOSZV4AaABAg": "No one will actually believe or see this but I can see clear advantage for white and I promise after 18 years of chess I am not talking out my ass.",
    "UgzjRUZ2SjVyZtXCstR4AaABAg": "Basically you hired an IM to check if right square is white. I'm kinda disappointed.",
    "UgjssgatH3o2zHgCoAEC": "Why doesn't black do the following: Kh2 Qxa4 with the plan of Qxc2 where white's king walk is thwarted. After Qxa4, would white's Ne1 allow white to do the king walk?",
    "UgzAj3mPt_PylKT8avV4AaABAg": "I really don't get the miserable trash talk. These are 2 of the finest human blitz players on Earth. And thanks to the internet, the players, and chess.com, we are spoilt rotten. And then some arm chair critics who would be busted in no time by these cats, spits it back at them. The level of chess played was awesome. A true joy to watch!",
    "UgywgFsVhJoZyDOLSLl4AaABAg": "What about, after white queen to c8, black king must move to g7, then white rook to a8, threatening white queen to h8...etc. does that work?",
    "Ugg4hXfcQMUbK3gCoAEC": "I play the Alekhine Defense all the time.  It's an easy opening to misplay and Black misplayed it.  The idea of it is to weaken White's pawns, damage his development, and ultimately cramp his position.  In this case, White gained tempo because the opening was misplayed.",
    "Ugwtv45Ku0kMbo6yJ394AaABAg": "9:47 Analysis incorrect. King d3 is legal and much better than king b2, and I think white is actually winning here since black does not have an attack anymore, even though white’s white square bishop would have to come back and defend",
    "UgxceNCT31g9qSrlChN4AaABAg": "gotta say, if god created people, then why didd he create them with such venom ??? surely the creator takes full responsibility and is rational to blame the force that gave the human such evil in the first place, xurely its irrational to blame the human for mearly being born the way god wanted ! ",
    "UgytxCAD84FWa53jSM54AaABAg": "The photo requires very deep insight of chess world to be understood. In 2018, powerful engines such as Stockfish, Komodo etc play at a much higher level than any human player. It seems that AI mocks human beings because we make lots of mistakes or inaccurate moves. It sarcastically represents that AI are the best in chess but humans are still conducting matches to know who the best player is. From AI perspective, the players are like two goats fighting over some food provided by their owner. They don't even own the food but quarrel over who deserves it.",
    "Ugzqfqtb5yXmaxD3bJJ4AaABAg": "2:20 g 5﻿ and black risined",
    "Ugzn9nAH0LBmoh9sKdh4AaABAg": "Interesting! at 5:00 white sacrificed knight to make a wall of pawns to cut off all black pieces from the defence of the black king, leaving him naked for all white pieces to attack",
    "Ugw-GNa7HJVGPjVbd5J4AaABAg": "This game was FUCKING PHENOMENAL",
    "Ugwv1-LPj5wyC9iJejJ4AaABAg": "Listening western chess players teaching you a chess lesson, is the same like listening psyco-ego-selfish-maniacs, who just escape from sanatorium. !!!!",
    "UgyyavL3Tk5DIMc-jOp4AaABAg": "13:28 but what if Kd4 Nc2+, Ke5 f6+ ? Why is black losing?",
    "Ugjtwn4CErl1J3gCoAEC": "I really wanna see a chess960 blitz match with Naka and Carlsen and if ripping throats is what it takes, I'll suck as many dicks...uhh rip as many throats as I have to!",
    "UggFPB0bW7v4uXgCoAEC": "At the 20:30 mark, I think engines like White just because they are still up a pawn and Black has no immediate tactical shot to win it back. You are right though, its tough to find constructive ideas for White in that position...",
    "Ugy4VvTKnJ2JsVzt_-B4AaABAg": "From norwegian television’s point of view: alireza filed an appeal on the «carlsen wins» decision on the basis that carlsen earlier in the game, according to firouzja threw him off his game by loudly proclaiming something in norwegian; basically distracting him enough so that he otherwise apparently wouldn’t have lost on time much later in the match. What carlsen did was proclaim «faen», meaning «fuck» at his blunder whereafter white captures two pawns. The appeal was rightfully shut down, but you can’t really blame alireza for doing all to make up for such a frustrating mistake",
    "UggOGKHjlK26EXgCoAEC": "Can someone explain to me why at 1:18 the  black queen didn't take the white white square bishop?",
    "UgzxXbuaDutvIP8DAlh4AaABAg": "The Vlads are rising from their sleep to wreak havoc over the board.",
    "UgzAEBk67SoYxcnbIMZ4AaABAg": "Nice to see they still haven't fed Ben to the allegators yet down in Georgia. I'm still not tempted, by this video, from the Sicilian by 1...e5 in the hope they go Italian. More likely you'll face a",
    "Ugg8X3PNovMXiHgCoAEC": "lol u gatta castle long and shift all the picecs to the queenside",
    "UgxBlviuAVNeSiJEnNh4AaABAg": "if you look at their first world championship game with lichess, there are zero inaccuracies, zero mistakes, and zero blunders with a centipawn loss of 3. this is inhuman",
    "Ugww9wX0vYxi2xjDhPp4AaABAg": "if white is able to take rook with bishop, theres a knight fork and white wins another rook. white has 5 pieces while black has 4 and black has weaker pawn structure and his extra pawn will be a target. 2 rooks + 1 knight + 1 bishop = 16 points while 1 rook and 2 knights + 2 bishops = 17 points. black is about to lose a rook for sure so minus 5 from 16 and you get 11 points vs 14 points. blacks pieces are not working together anyway since the pinned knight also shuts down the rook. \n",
    "UgzwptYDvpvxG3jfz2t4AaABAg": "You probably said something like 'And it was in this position when black surrendered to white' or 'And here white is simply better'.",
    "Ugw2iqua5Y3tzRvDOqF4AaABAg": "At 7:05, white can play a3 and if the black knight moves white bish checks on h7 with a discovery on the black Queen. And if the knight doesn't move you can chop it. OK on Black Qd2 you have to think harder... can someone do that please....",
    "UgwuPRDgZtT-ldJaJEd4AaABAg": "I was waiting for \"Why did he resign ?  ... Well, there are two fucking white queens on the board\" :D",
    "UgzFb170jicqQAKaBfl4AaABAg": "There should be a book that says that f6 is never a good move.  Stockfish prefers Nf5, (or a host of other moves). Which is  why f6 a rare move. The move Nf5 attacks the backward d4 pawn, while avoiding the threat of cxh6.  And if white takes the f5 knight with the d3 bishop, this not only leaves black with 2 bishops, but it actives black's white squared bishop.   And black's black square bishop doesn't become prone to attack on f6, like it becomes in this game..   So f6 probably is a completely losing move. IMHO",
    "UgwHbVuX5QIC4YOz8ed4AaABAg": "If Rd4, then Bd5 blocking the attack and white lost a chance to win the piece. Losing that rook for Black's knight and bishop is good exchange for White because White is a piece up as I told you in previous comment.",
    "UgwbbSPI8IQkGau4Hxl4AaABAg": "He was born in 1887, 30 years before the Sovietunion existed. So he was born in a country that does exists, again!",
    "Ugg1wM6VEBsjUXgCoAEC": "At 3:08 you say that if black plays ...Bd7 white wins a piece by Nxd5, but cant black reply with ...Bxb5 which would prevent white from castling kingside, at least for the moment?",
    "UgxjsOzhMQYtpLngRbV4AaABAg": "The have taken mating too far!",
    "UgwFB1WAkx-SQODKyyN4AaABAg": "like if the only reason your watching this, is to beat your fucking computer at chess for once.\n",
    "Ugzdzrq6EXEUWUlu1JZ4AaABAg": "You are in your own home...comfortable... I hope you are warm also. - Fucking classic!!!!",
    "Ugx931TxL0j2tLyxUx94AaABAg": "9:03 I thought Qe6 would have been a better move in that position. a7 pawn would still have dropped, but Black would've had the e5 pawn in return if White trades on e6 and black recaptures with the Rook. Probably still a losing position but seems better that what was played.",
    "UgytpuNXh16tiblzeq14AaABAg": "Still waiting to see the \"real\" carlsen destroying  caruana with the white pieces",
    "UgyXvUOAOoq4QsPm8Ut4AaABAg": "5:36 -- Given the extreme pain endured should the H-file open up, my hind-brain reflexively and intuitively shoved g4 (defending while permanently barricading the bishop on the side of the board) as soon as I saw it. Then you said h3 was played, and I did the Darth Vader \"Noooo!!!\" -- So anyway, I chucked g4 at Stockfish10 to see what it would say, and sure 'nuf, it stuffs Black's mating ideas right down a hole.",
    "UgwKoecIkCIJE80T62l4AaABAg": "lol, when he said \"and i'm white\", i thought he was talking about his race to be like \"i'm impressive cuz i'm good at chess and i'm white!\"",
    "UgyrIeiIrvJO6waRhix4AaABAg": "I'm pretty hyped for this, you fat fucks better not let me down.",
    "UgxiSpD2hRIxHMNqVml4AaABAg": "Tartakower looks like a fucking Bond villain.",
    "UgzElKVW-Wcr6HcMevF4AaABAg": "After RE1 from white black can do QC5 and after RE5 from white black response could be BE5, please check this variation.",
    "Ugx69DgiyOKEAfY58kJ4AaABAg": "*These dudes are so good that they can break any golden rules such as keep the pawns in front of your 👑*",
    "Ugw1nwc-JefNYVB31AJ4AaABAg": "Amazing. White had a space advantage, K safety (it seemed), B pair and a B-Q battery aimed at Black's K, but lost!  Engine says that, after 19.Qc7, the amazing Nf3 is Black's only move; everything else loses. 22.Rxd5 worsened White's situation; better was Qf4 to trade Q and then lose an exchange, stalling Black's attack in the process.",
    "Ugz7BUX_P1YJEhTXT1h4AaABAg": "Men with untrimmed fingernail are disgusting...",
    "UgwWVAmUyE5Rk2zcX7t4AaABAg": "@luuminaire Being soft on any infraction just causes it to become much more potent within the organization. Look at baseball...they claim steriods are a instant ban...but player after play keep getting caught and only suspended and the problem is just getting worse. Ban them straight up and show that cheating will not be accepted, end their career from that \"one bad move.\" Set the example. They are at the level where cheating shouldn't exist, they know better.",
    "Ugh9qErssce4yXgCoAEC": "After RxR, why can't black recapture with the Bishop on H2? Then Black would continue Qg7, then Bf1, BxB, QxB.Black could probably follow up with Ne5 then Nxf3 for more pressure, but it would be Black's Queen and 2 Knights vs White's Queen, Bishop, and Rook.",
    "Ugw4M0mNb5JfUjnhbuR4AaABAg": "At around 34:00 would it not be a good idea for e6xd5, then if c3xd5 you take d5 with f6. Now if whites queen takes d5, blacks queen on d8 can take whites pawn on h4, putting the king into check. White is forced to move the king, now you take the rook on h1 with the potential of also taking the bishop on f1? Could this potentially work?",
    "UgycwNNeeWxURBHJm-p4AaABAg": "They seperate men and women only because chess is considered a sport.. and in events like olympia and stuff women and men get seperated, so this also applies to chess.. still makes no sense to me..",
    "UgippjwoE8zh33gCoAEC": "White could have moved Re1. Then if black queen to h4. White back row mates. White had no need to resign and plenty of moves after that",
    "Ugzgk69A9o6ms2t7J0N4AaABAg": "Mamedyarov is the bernstein of modern chess. Only shows up on agadmator channel when taking an ass whooping",
    "UgzOGgJvF3tEgxSsMBd4AaABAg": "7:00 it seems to me that Tal is now defending the threat of Nd8 that would win the black knight for white.",
    "Ugz91BqLH3p3zkU--pZ4AaABAg": "at 8:19 doesn't Nxc6 win a pawn? (if black continues with Nxc6 capturing the white knight then white plays b5 and either the rook or the knight is going down)",
    "UgjlfDwvTgbx6XgCoAEC": "I was a little confused on the play-through were white is \"paralyzed\" after Rd1 because it looked like he had plenty of options, but after playing through a few continuations, I realize that any move that white makes kills him.  Incredible.",
    "UgyV5sGbT68SX7H0Yyp4AaABAg": "@4:10, can't white play Nb6, and if Qxb6 then Nxe6, with discovered attack on Qb6 and also threatening Nxg7+ and outright winning for white, no? So Nb6 is basically off limits. So black would have to part with his LSB Ro save his rook.",
    "UgwG79JE9XEQBH2NWMp4AaABAg": "You sure it is not about who wins the match?  Stockfish has been beating on us and taking our lunch money forever.  Now older brother Alpha comes in and wedgies the shit outta stockfish.....",
    "Ugybu28ZOQd2DIPGPcV4AaABAg": "Man from earth Holocene is a huge pile of crap. That's why it's free. At one point it even tries to be a soft core porno.",
    "UgyZY6aqV4OUSl0RdCR4AaABAg": "Mato at the end position why not Kd8? If pawn gets queen then Kc7 and black is okay, because queen excapes and discovered attack on white queen. If after Kd8 white takes black queen, then Kc7 and pawn cannot be promoted. How is black losing?",
    "Ugw3oC2l8akAidFP5rN4AaABAg": "Love the slo-mo capture again at the end. 😆",
    "UgyUDkQ83iNtiYCdyhp4AaABAg": "This is googles practice at perfecting the ai. Like you said this is some skynet shit, people think its not going to be a thing and i dont pretend to know what may or may not happen, but when they openly express there plans then its not much of a conspiracy anymore. Get ready for the new world order agenda. Great video btw.",
    "Ugg2CynT8vhJJXgCoAEC": "Doesn't have to sacrifice the white queen. Qe3 pins black queen on h4.Next black move does not matter what it is.Pawn g3. Qg3. White queen e7, mate. Little longer, but this way the queen lives and only sacrificing a pawn.",
    "Ugh1uXe3-PNlnHgCoAEC": "how about after 1:51 black played d5, white goes Qf3... I think white could (though out of position) keep trying to force exchanges and get to endgame with extra bishop... This was just 1st thing that crossed my stupid chess mind...",
    "Ugh63YnDyxYOHXgCoAEC": "Zorroborro, Qh5 makes black play pawn to g6 which is necessary for whites attack because moving the pawn on g7 to g6 undefends the f6 square and opens the diagonal for the white queen to fork the black king and rook. When Tal played Qh5 he had already calculated the position four moves ahead to see the winning fork. When tal moved Ng5 the attack wasnt there. But black played into it with Bd7. Black misplayed the french horribly. Blocked himself from playing c5 to undermine whites center.",
    "Ugz16xCvdv3WuWeZrHB4AaABAg": "White Queen checks Black King on h4, King should've moved to c7 stops White Queen check and pick up bishop",
    "UgwP_co1J0jT6PZvSup4AaABAg": "You can analyse the position from move 1 by disabling castling rights in the chess program. Agadmator is a noob and a patzer again giving bad advice to people.",
    "UgwU-AiigWoqIOGueHx4AaABAg": "You know why they took it down. Cuz it’s happy and brings joy and there’s no room for that in their NWO",
    "UgwE6cE2tbBvYyvQBVN4AaABAg": "Anyone else notice his dog freaking the fuck out at the beginning? 😂",
    "UgzqFVer7uR2Xz96rEt4AaABAg": "White wins no matter what! Black was outgunned and had the blacks nights disappeared, white pawn structure and and superior tactical skills would have prevailed!",
    "Ugg39y3RGvj-u3gCoAEC": "what if rook to d2 after black q to d7 at 5:06",
    "Ugzv6_Jvkk7O86birRp4AaABAg": "pfft please how to be a better bltiz player is to learn nothing if you go fast you either force ur opoent to be big dumb or you make them run down the clock faster",
    "UgyMDG1MSMOd_lEscWh4AaABAg": "First they beat us in chess. Then they turn us into batteries. Then Keanu sacrifices himself to save humanity.",
    "Ugx9xVXyhXH-wBWdheR4AaABAg": "Youtube curently active banning channel (also video and livestream) about \"white supremacy\", now the youtube algoritm about word \"white\" become sensitive and of course chess is black and \"white\".",
    "UgxW4NSrNSwABKkUfLl4AaABAg": "I've got a similar (but not exact) position on my chess app, and it wants to play g5 on move 10. Looks like that wins material, since g4 on the next move is a threat... Would it work here? What happens, if black goes g5 instead of 0-0-0 on move ten?",
    "UgikNXpz_7fTIXgCoAEC": "Hi Mato...i watch many of your videos..just that in this video, danish gambit, it would not be that effective if Black's queen doesn't check white king(Qe8)....which gives white a blunted attack...also, what if black doesn't play knight a5 attacking white bishop in the first place ? will the gambit still work ? Will all the pawn sacs be worth it ?",
    "UgzLFXpZo9vhKsbx2wR4AaABAg": "Wait... 18:35 can't black just push the pawn? White can't checkmate in time if black pushed the pawn... Am I crazy or did white blunder and black let it slip?",
    "Ugy4DdbDGcB1QI3mecJ4AaABAg": "\"I probably pissed off a bunch of Star Wars fans.  You can tell I really care\".  Danny, you're a fucking idiot.  Your jokes are so stupid.  Why wouldn't you care ?",
    "UgyhS9RzcYaAtCAsbPB4AaABAg": "The haters are frustradet guys without future",
    "UgwLRvZvCQzxYm606_x4AaABAg": "I love Mikhail #tal because he lets the hippo drown😂😂",
    "Ugw_HbbRE8VrIMsYwgx4AaABAg": "After white captures the queen black would play b6 and white gets mated in 217 moves.",
    "UgzQUpioQY7mJibGjaV4AaABAg": "what if after  ..Qe4 White responds with h3? White responds with Q Black still will be a rook up after all the exchanges, nut it will prolong the game a little. Black will still win.",
    "UgwZMBSgXXwLJNqsVyR4AaABAg": "at 10:01 you must have a look at Bd4 before just assuming that white must trade rooks on d7. After ...Re6; Qf5 Rd5; Qh7 Qd8 black still has a better position. Instead of Bf3 I think Bh5 is a better move for white. After..Re6 white does not have to play Qd4 but can play Qc3. If then...Ne8 white has h3.",
    "UgxA2qn66-xFYE8WuuJ4AaABAg": "Are the people watching the game fucking blind? \"Bishop moved sideways\" it's the fucking queen. And for the idiot that said white moved twice at 15:25, you are stupid.",
    "UgwBeBplgNwld9hfvjp4AaABAg": "Agadmator must be stopped, he’s been forcing white and black to fight to the death for years and profiting from it",
    "UgwFvcLRVKHshoYx3P54AaABAg": "I'd have went Black rook takes rook at 4.20. How does that continuation go? White ignores rook initially, knight takes knight (check), double pawn for black and then white recaptures rook, I guess?",
    "UgzhEvw_MF2U5wD7VzB4AaABAg": "Amazing attack from White. Engine (Stockfish 8 to depth >30) finds it all inevitable, of course. Black hands White a +4 edge after the weak 14..Nf6 (better was Ne5 or Nb6?) and 16..Ng4 (better was immediate Qd5). Thus, Black was already losing when he started to attack White at move 17. The weak 21..Bd7 seals Black's doom (better was c5, to prevent White playing Bd4).",
    "UgxRQvjilp6nl2cywlx4AaABAg": "at 9:54 how did black take the B4 white pawn ? i dont understand , i knew that pawns can only kill in diagonal , no ?",
    "UgzNPjRZ07W11vglJbl4AaABAg": "I'm fucking dying ..on top of the mustache documentary the fucking dog is absolutely killing me I can't even breathe right now",
    "UghtX1gscHbR_ngCoAEC": "At 2:15. Why can't black NxD3. Then push e5 winning whites bishop on e3. Or is whites attack to strong?? ",
    "Ugz98IAw_OCTRI5SCsZ4AaABAg": "Some people just want to see chess die out, people not being able to make careers out of it because of no money involved. Ofcourse there is huge blunders they are all beginners in pogchamps and they are nervous, this dude has some serious complex with thinking himself above other people. It's a game in the end and people new to it will get much more out of Pogchamps than Carlsen against Anand because they have no idea why they are doing what these guys are doing moves they do since they think so much ahead. Chess community do take themselves too seriously, no basketball pro's complain about celebrity games and such.",
    "UgxuTZkiEFdagpwl89p4AaABAg": "Im so happy that these monsters are teaching him lessons one after another",
    "UgzPfSaIIzE3ETYf7tV4AaABAg": "in 5:51 white can play rook d8 check and black rook capture white rook and white f2 pawn to f8 queen and checkmate..",
    "UgxSxKr2jkURbx-xu4l4AaABAg": "After Qf2 there is no draw, white can take on e4 removing the defedner of the bishop, white has to defend with Qe2. White can then give up the rook for Qf5 and black is pretty much getting mated with Qf8+ ideas. Or so says stockfish",
    "UgxWZlGlDU0xgVUHeUF4AaABAg": "ice is racist, .... especially the snow....nobody should use thees words. ban the 'white sharks' , what? Arctic or Antarctica? ban them... faqen morons...",
    "UgyaChm5UQ4xjmS3Zel4AaABAg": "@15:05  Yes, Carlsen should have taken the white Rook at G1 with his Queen.  Then Bxf6ch, Kg8, Bxe7.  But now, e3ch!, Qxe3, Qxe3ch!, Kxe3, but then Re8 pins the white Bishop!  And then Rxe7 will happen - white will lose the dark squared Bishop.  So Black gets a Rook and a Bishop (8 points) for two Knights and a pawn (7 points).  And now a black Rook against a White bishop (with almost all blacks pawns on black squares).  So, Carlsen did not play the best move with Qxg1.  And If White does not play Qxe3 - let's see what can happen when Black makes the right moves thereafter.  Now if White's Queen does not take the Black pawn. then the White King must move out of check instead.  1.) So Kc2 then Qf2. The Black Queen is threatening to take White's Bishop with a check and a past pawn two ranks away from becoming a Queen (and note White's Queen cannot check the Black King with the Black Queen at f2).  Then if the White Queen moves to f1 Black will still benefit: Qxf1 Bxf1 then e2 so the Bishop must take the pawn or a Queen promotion will be the result.  Bishop takes the pawn so that Re8 allows Black to take a Bishop.  Better for White to keep the black square Bishop so Bxd6 and Rxe2 check!  And the game is over for White, because the Black Rook will take the White h pawn - giving Black a past pawn.  And there is no way that White's past d pawn will become a Queen (the Rook will stop that in time).  2.) Now, the ONLY other White King move is Kd3.  Re8 threatens the White Bishop.  2a.) Now, White can protect the Bishop with Qh4.  But Black moves Qb1 check and Kxe3 takes pawn.  Qe4ch and White's King must move out of check, but Qxe7 and Black still has a slight advantage if White wants to exchange Queens or if White moves Qg3 check - then Kh8.  2b.) Or, after Re8, Bxd6 then Qb1 and it's checkmate.  Black wins the game.   So no matter how we analyze this - Qxg1 is the better move. Though Vincent is a great chess player, Carlsen should win this game even without moving Qxg1 anyway...",
    "UgxL3unD0p9YXToBZGt4AaABAg": "What about rook to B-8 for black",
    "UggDeyomnGgEy3gCoAEC": "Forgive my ineptitude, but I don't see why black resigned so early. At 6:59, why not capture the white bishop on b8 with the rook ? I get that the pass pawn situation is bad for black, but still... Anyway ,these videos are excellent and Capablanca was amazing.",
    "UgyPG9sU91InBr159AN4AaABAg": "12:38 white \"queen has to move\" -- why doesn't white queen take black rook?  Free rook.",
    "UgyVxsuJvauZcwM9bml4AaABAg": "Can someone please take that drawling idiot outside and give him the Lennie Small treatment",
    "Ugxi8C6YJJp80cFMZ3R4AaABAg": "geeze.  I go back to the 3:29 mark, the play is to bring Black Knight from off the wall to f-6 to threaten Queen and give other knight back  up, while releasing Black Rook for vertical attack later on.  Now, when White Queen checks, and Black King moves to F-8 he has safety.  White can't check any more, and both knights are safe, too.  He will have to take black pawn on G-6  to escape.  Now black pawn takes bishop on e-3.  White Knight to d-3.  Black pawn to b-3.  White Rook to a-3, attack pawn.  Black Q to c-5 to capture pawn.  Check mate in how many moves for Black?... as white Queen is completely frozen, helplessly watching the torture with tears in her pretty blue eyes.  HAHAHAHA....",
    "UgxNnxS2U7QpwVu567h4AaABAg": "At 7.46.. he should have done f4 to e5 capturing the pawn. Then if black captures the white bishop with his bishop, then it's a checkmate by white",
    "UgwuXElVfPx6Rc5AsQ14AaABAg": "get rid of this f*cking bar on the left!",
    "UgxsLHcQR-NzNDKAxMN4AaABAg": "Basically we just saw Nepo for 12 minutes of the video torturing We Yi slive by slice...",
    "UghdfE_K8guaPXgCoAEC": "at 2:02 why did black not move his bishop to G4 attacking white queen and trading black bishop for white queen?",
    "UgyOS5E60ebpARd9XG94AaABAg": "On 4:19, why doesn’t Black Knight on B6 take White Bishop on C4. Then the continuation would be like this. White Pawn on B3 takes Black Knight on C4. Then Black Pawn on D5 takes White Pawn on D4. And Black is Ok moving Black Queen to E7 on his next move.",
    "UgwlRRKeb9OAEMlUi2J4AaABAg": "Fuck me, the return of Tater McLoudspeaker.  Shoot me now",
    "UgxqMMknJXdL8dX5bKR4AaABAg": "at 20:08 white is better because of many things. 1. whites rook is active 2. whites king is active. 3. white has extra moves and black doesn't 4. blacks completely passive.",
    "UggMgINrTJpxMHgCoAEC": "Dr Who would be proud of your Control of Time, you swindla you!",
    "Ugzr2L8Jl_c6EYlH_JB4AaABAg": "I really like playing chess, but seriously I can't keep up with the mindset of these proffesionals xD",
    "UgxRiDfCvG7H10nXyBt4AaABAg": "I ran into Hikaru at the library and wished him a happy birthday. Turns out, it wasn't Hikaru at all, just some Chinese guy. And now, not a moment goes by where I don't think about that Chinese guy and how much I hate his fucking guts.",
    "Uggf2miGTNeIqHgCoAEC": "If (1) ... Kg5 ; (2) Rh5+ , then, if ... Kf6 or Kg6  ; (3) Rxh6+ , Kg5 ; (4) Rxh7 and White has a passed h pawn ; or if (2) ... Kf4 ; (3) Nxh6 and White threatens to capture Black's f and h pawns.  Trying to stop White's passed pawns will cost Black a piece -- and therefore the game.",
    "UgiuDPuyL4QD6HgCoAEC": "PGN (with comments) for Bartholomew - Shabalov, Foxwoods 2003:\n\n[Event \"Foxwoods op 05th\"]\n[Site \"Connecticut\"]\n[Date \"2003.04.17\"]\n[Round \"1\"]\n[White \"Bartholomew, J.\"]\n[Black \"Shabalov, Alexander\"]\n[Result \"1-0\"]\n[ECO \"B32\"]\n[WhiteElo \"2300\"]\n[BlackElo \"2592\"]\n[Annotator \"John Bartholomew\"]\n[Plycount \"79\"]\n[Eventdate \"2003.04.17\"]\n[Eventtype \"swiss\"]\n[Eventrounds \"7\"]\n[Eventcountry \"USA\"]\n\n{ I was 16 years old at the time of this game.  It is significant to me because\nGM Shabalov had won the US Championship just a few months prior and was\nplaying some really powerful chess. } 1.e4 c5 2.Nf3 Nc6 3.d4 cxd4 4.Nxd4 e5 { The Kalashnikov, in which Black postpones the development of his kingside\nknight.  \"Kalashnikov\" also refers to the Russian-made assault rifle, the\nAK-47.  Very fitting for Shabalov's \"shoot-em-up\" style of play! } 5.Nb5 d6 6.N1c3 { With this move I indicate my willingness to transpose to a Sveshnikov\nSicilian, a close relative of the Kalash. } ( 6.c4 { is an attempt to 'punish'\nBlack for delaying ...Ng8-f6.   It's not without consequence, though: White\nwould chronically weaken the d4 square. } ) 6...a6 7.Na3 b5 ( { Rotella instead\nadvocates } 7...Be7 { . } ) 8.Nd5 Nce7!? { Continuing the delaying tactics. } ( 8...Nf6 9.Bg5 { is a main-line Sveshnikov. } ) ( 8...Nge7 { is actually the most\npopular move. } ) 9.c4 Nxd5 10.cxd5 { I knew this was thought to be harmless,\nbut I was aiming for a clear-cut position with a fixed pawn structure. } ( { The\ncombative } 10.exd5 { is theoretically superior, with messy play. } ) 10...Be7 ( 10...f5!? { is more Shaba-style, e.g. } 11.exf5 Bxf5 12.Bd3 Qd7 13.Nc2 Nf6 14.O-O Be7 15.Nb4!? { (heading for c6) } 15...O-O 16.Nc6 ( 16.f3 ) 16...Bd8?! ( 16...Rae8 ) 17.a4 { Diamant,A (2506)-Lopez,M (2275)/Mar del\nPlata ARG 2009 } ) 11.Bd3 Nf6 12.Nc2 Bg4?! { Black often plays this to provoke\nf2-f3, but I'm suspicious of the idea.  White's bishop secures a comfortable\nhome on e3 where it won't be bothered by ...Nf6-g4. } ( 12...O-O 13.O-O Bd7 { seems better to me, though I still prefer White's space advantage. } ) 13.f3 Bd7 14.Be3 O-O 15.O-O { White has a slight but stable advantage. } 15...a5?! { The\nbeginning of Black's problems.  White already holds the edge on the queenside,\nso Black should refrain from weakening pawn moves. } 16.b4!? { Fixing the\nstructure once more.  I wanted to blockade and lay siege to the b5 pawn, ala\nNimzowitsch. } ( { It's also very promising to play } 16.Na3 { i.e. } 16...Rb8 ( 16...b4 17.Nc4 { works out well for White. } ) 17.Qe2 Qe8 18.Rac1 { and Black is tied\ndown. } ) 16...Nh5 17.g3 g6 18.Qe2 Bg5 19.Bf2! { Keeping the bishop for now. } ( 19.f4?! { is premature.  After } 19...exf4 20.gxf4 Bf6 21.Rab1 Re8 { White\nrisks overextending himself. } ) ( { I also wasn't happy with } 19.Bxb5 Bxe3+ 20.Nxe3 axb4 21.Bxd7 Qxd7 { with simplifications favorable to Black. } ) 19...Rb8 20.Rab1?! { My next few moves are objectively incorrect. } ( { More forceful is } 20.a4! bxa4 21.b5 ) 20...a4 21.Na3 ( { Perhaps } 21.Ne3!? { is better,\nintending to double rooks on the c-file. } ) 21...Qe8 22.Be3 Bd8? { Shabalov\nmay have been hoping to keep the game complicated with time pressure\napproaching. } ( { However, the simple } 22...Bxe3+ 23.Qxe3 f5 { gives Black\ncounterplay. } ) 23.Bh6! { Back on track.  Black is unexpectedly forced\nbackwards. } 23...Ng7 24.f4 Bh3?! 25.Rfe1! { Anticipating Black's next move. } 25...f5 { Black doesn't have much else, as the b-pawn is hanging. } ( { He could mark time\nwith } 25...Bd7 { , but } 26.fxe5 dxe5 ( 26...Qxe5 27.Bxb5 ) 27.Be3 { is\nclearly better for White. } ) 26.exf5 ( { The immediate } 26.Bxb5 { is also good. } ) 26...gxf5? ( { Black can try to sac an exchange with } 26...Bb6+ 27.Kh1 Nxf5 { , but following } 28.Bxf5! ( 28.Bxf8? { is less accurate because of } 28...Qxf8 29.Bxf5 Qxf5 ) 28...Bxf5 ( 28...Rxf5 29.g4! ) 29.Bxf8 Qxf8 30.Rbc1 ( 30.fxe5?! Bxb1 31.Rxb1 dxe5 32.Nxb5 Rc8! { isn't as clear. } ) 30...exf4 31.gxf4 Qf7 32.Qf3 { White should convert his advantage in spite of Black's\nbishops. } ) ( { Relatively best is } 26...Bxf5 { , though Black remains under\npressure: } 27.Rbd1! ) 27.fxe5 Bg4 28.Qg2 dxe5 29.Be3! { A nice\nregrouping.  The transfer of the bishop to c5 puts Black on the brink of\ndefeat. } 29...Qh5 { Abandoning the b5 and e5 weaklings and pinning all his hopes on\na kingside attack. } 30.Bc5 Rf7 31.Bxb5 ( 31.Rxe5 ) 31...f4 32.Bc4 Bf3 33.Be2? { I remember being very proud of this move, but it could have cost\nme! } ( 33.Rxe5! { completely neutralizes Black's initiative. } 33...Qxe5 34.Qxf3 fxg3 35.Qxg3 ( 35.d6 { is good too. } ) 35...Qxg3+ 36.hxg3 ) 33...fxg3 ( { After } 33...e4! { the position is a complete mess. } ) 34.hxg3 Qg4? { Now\nBlack loses. } ( { Again, } 34...e4 ) 35.Nc4! { The forgotten knight\nreturns to the game with decisive effect.  Black can't protect e5. } 35...e4 ( 35...Bxg2 36.Bxg4 Bxd5 37.Nxe5 ) 36.Ne5 Qf5 37.Nxf7 Qxf7 ( 37...Bxg2 38.Nh6+ { would have completed the knight's tour from a3 to h6! } ) 38.Bxf3 exf3 39.Qf2 Bg5 40.Rf1 { Time was no longer a factor, so Black resigned.  Despite a\nfew inaccuracies, I still like the way I played this game. } \n1-0",
    "UgjMX5xRjkwfyHgCoAEC": "3:07 i think that Ng5 was not a good move by white. black could have responded with Kg6 and there is no time for white to capture black knight.",
    "Ugzl_Z3zkZwblFtCUQZ4AaABAg": "Damn, lately i hear a lot of people complaining about humans playing like machines nowadays. Instead of camplaining, how about discovering and promoting creative play yourself? But if you  say It doesnt work like that, then at least don't hate the player, hate the game.",
    "Ugyvv5_JMyWdkqUGocZ4AaABAg": "2:58    After black rook takes white rook on b5, why is white not playing bishop to f8?? black rook is still on attack on b6",
    "UgwwMUd7P6z1LNu-Bhd4AaABAg": "Seems like after Bishop to d1 that you would sacrifice the rook by moving to e3.  Sure, the black knight takes the rook but then white captures the knight with the f2 pawn.  This stops the black queen from being able to move to the e1 square because the white queen is defending it.  Within another move white should be able to pick up the bishop on d1 as well which would leave white with a slight edge for the end game.",
    "UgyIapP2IW8zAbbyWht4AaABAg": "Position at 18:32 why didn't  white just check the black king trade rooks then start pushing his past pawn then and queen. White would of only been able to grab the H pawn due to the black king being so close to the F pawn",
    "Ugxs_K1Yqivg-nJ-74V4AaABAg": "Black was up material when he resigned.  That does not make any sense.  At least play it out.  These morons never finish their games.",
    "Ugw1MGcynfz7TFJSZIJ4AaABAg": "chess advocates that white pieces should move first. absolutely racist. chess players dont even deny that white has inherent advantage - totally raycist",
    "Ugx8tqMAFlBuo3nji4F4AaABAg": "Dont let robots get the power over humans they ll humiliate them so badly",
    "Ugyg6tOrPUZeoLBv0-p4AaABAg": "2:33  pawn exchange isnt right black pawn is at d5 and white pawn is at e5 how can white take black ??",
    "Ugw-Cj6DPWAzKAgSe3V4AaABAg": "fuck you are tired ??? i am just tired of watching ,even i am not doing anything whole day ....hats off to you ...you are the best ...keep working hard ..enjoy your time also ...",
    "Ugwl-0I-_6JjaAURcsl4AaABAg": "47:06 What’s wrong with Rd3 for white?  If blacks plays Qxe2 then white plays Rxd8#. And if black Rxd3 then white plays Qxd3 which threatens mate (Qd8#) and protects mate (Qf1).",
    "UgwwDCItpufl6Bb7WL54AaABAg": "“White played a move, and white resigned”. Yes, I've seen that before. White plays what he thinks is a good move, but discovers that it's really a huge blunder and resigns on the spot.",
    "Ugzj2_oS_c_vBk-jTEN4AaABAg": "LOL ! I have this mind picture of you having a kid temper tentrum holding your breath stomping your feet and shit because you loose all the time... no you're stupid , learn the rules so you can win the game...",
    "Ugw82-Rpa6-yP9aSoTx4AaABAg": "That critical Exchange sacrifice showed demons are not materialistic... :-)  They want to take over the deep side of things. Material is the ultimate consequence of superiority. Artificial Inteligence is an evident menance for humanity, they've even talked loud about it several times!  P.S.: move 22...Rc7 prevented a winning fork by Leela ( materialistic speaking ).",
    "UggsV4EL-K8igXgCoAEC": "Why do you pronounce black as \"bleck\"???",
    "UgyyrxqEKFxobdiMqjJ4AaABAg": "What a scumbag this Ernesto Inarkviev, this whole FIDE organization is corrupt looking at the Saudi Arabia tournament and their weird rules...",
    "Ugz1Qz-VfA-L8RAD9zZ4AaABAg": "Question: has any study been done to see whether Armageddeon format favours white (extra time but must win) or black (less time but only needs a draw)? Are we seeing more white or black wins in Armageddeon? Does the ratio of white:black wins change a lot depending on the amount of time advantage for white?",
    "Ugy5vj8_Onb3uOI1XVJ4AaABAg": "What if white had declined the bishop and moved the king up as you proposed and then the black bishop captured the pawn?   Then the white king captures the black bishop.   Black loses his bishop as he would have anyway but comes away with a pawn.",
    "UgwZLN-nzFxU_AQ79BR4AaABAg": "Sam Shankland is the #3~#4 American-born player, not too shabby.",
    "UgwBb10wVK97QVK4Nct4AaABAg": "Bro I'm following your vedios in last few weeks. You are doing great job.But my problem is I hate the sound you make with your throat.I don't know if you have any problem,but at least make your throat clean before doing vedio because the sound you make in every vedio is disturbing.",
    "Ugw62f1PNuNbAVw_5-J4AaABAg": "Technologically advanced alien visitors gave chess game to humanity. They no longer play it because their supercomputers calculate that for every white move there is suitable black response, so that every game ends with draw. Hence, chess is just advanced version of tic-tac-toe.",
    "Ugzjs-MCLjSZAg3ESHl4AaABAg": "god now because of this vid, ppl in lichess will start spamming the bong cloud",
    "UgggoORIlxGM1HgCoAEC": "Hey John, what do you think of 12. g4!? I know it seems very radical (probably because it IS very radical), but you said that you wanted to open the position. It just seems like white doesn't have very many good options after 12. g4. Taking is clearly terrible. If he plays e4, after Be2 followed by gxf5, it just further opens the position and exposes the Black king. Black is severely under-developed and once White castles Queenside, it seems like his play against the Black king is simply coming quicker than black can handle. The position is opening up; Black's entire Queenside is doing absolutely nothing for defense, and White is  attacking with a Queen, 1-2 Rooks, 2 Bishops, and a Knight.",
    "UgxwNAGg9fPoRXh7yKd4AaABAg": "but at 3:49 its not whites move its blacks move and black if black plays Qa6 and now if u play Bh6 then f5 although still black loses eventually its not what u expected because its black to move",
    "UgxgOw00TSOr5AQdsfJ4AaABAg": "The point is that Bh3 vacates f5 for the black king, and does it with gain of tempo when white uses a move to capture the bishop. That tempo allows the black king to gain the favorable position against the white king. If white does not take the bishop, but plays g3, black simply plays Kf5 and infiltrates white's position. If, instead, white plays Kf2, black goes Kf5 and now white has to let the black king into his﻿ position or give up the g2 pawn. Brilliant move.",
    "UgxRGkiCNOfGR3t-odB4AaABAg": "I once farted in between chess match and my oppoppont resigned",
    "Ugw_agbnh12gXmoAHwJ4AaABAg": "Hahaha everyone in the comments are so butthurt that this guy is trying new things. Shows how immature you are and how sad of an individual you are to negatively hate on him. Live you own life and not hating on others life, especially someone whos trying new shit of all things, geez you all sound like royal douche bags. Hope yall have a positive day homies, sounds like we could all use it.",
    "UgyOdLysD3DJg-jz3Wx4AaABAg": "6:05\n\n\nSorry, Re8 is not a checkmate (Black's King can escape to the b7 square), hence Rc7 is the only checkmate threat in this position. However, if black tries to defend against Rc7 with Na6, Re8 is now a threat. \n\n1...         Na6\n2. Re8+ Kb7\n3.Bc6#",
    "UgxGWQF4S0apwhjzQUh4AaABAg": "6:56 white can simply push a queen f7 and after black king to h8 white simply queen to f8 and thats easy checkmate",
    "UgzMe__xw-qTk728J0d4AaABAg": "At 7:44/12:15 position how it will be: white Qh4, and if black h5 (only option), then white Qg5 with Nd7 not letting black queen to f8, Qh6 mate/ or Black has to give up the rook for knight??",
    "UgwjB-TYiY-41PWNtMt4AaABAg": "Ben: Better for white or black? Kid: Uhhmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm... black? Ben: Close! I’ll give you one more chance. Kid: white? Ben: Correct! 😂",
    "UgwNWSM-ZsYJjwrIrq14AaABAg": "I always thought I might have been born in the wrong country and now that I have found out that cute girls in Chile write songs about Chess Champions I KNOW I was...😡",
    "Uggw6irDtR663XgCoAEC": "13. e4 seems to have caused massive long term problems for White.  It makes a hole on d4, creates a backward pawn on d3 (when Black already has a half-open d-file to attack it), and kills the White bishop on g2.  These issues were even more pronounced after White gave up the dark squared bishop and Black was able to keep his, even though White got an Exchange.  Didn't catch what the engine said about 13. e4, but to me that move really impacted the game despite looking innocent at the time.",
    "UgxZtScmfwE4ko156sh4AaABAg": "I feel more comfertable with black but win more with white. I think its weird how much more i like black over white. Good to see you today hope youve had a great few days. Love from minnesota.",
    "UgzkhaQJO44p3hz2R294AaABAg": "At 7:15 of the video Agadmator shows what happens when Black goes for the queen. While this may be the most interesting move, the strongest continuation for Black is Kg4. As Agadmator states, White is still winning. But Black can prolong the agony for quite a while.",
    "UgzW5n0SASV5DkTm6Ix4AaABAg": "Perhaps, if you refer to the black pieces as the \"Blanks, and if you refer to the white pieces as the \"Whitneys,\" you can avoid the ignorant, intolerant censorship of the fools.",
    "Ugzasiex-6_qJfIJZCh4AaABAg": "That Dog is annoying and boring, Get a Crocodile",
    "UgwbWplWWu9e6ysU7TR4AaABAg": "sick game how they punished small mistakes",
    "Ugz4qITMWAj9pTMRBjp4AaABAg": "Can't decide who's more annoying, Finegold or that fucking kid",
    "Ugx8dsVCKjYgXnmnnYV4AaABAg": "I once traveled to Wijk aan Zee. Note: no one pronounces it right in English. It’s more like “Vi-Kahnzee” with the emphasis on “Kan”. I remember because I was trying to get a bus there and no one had any idea what I was talking about. But it’s a really beautiful place. There are suburbs with goats tied up and you can walk to the coast of the North Sea, where there are great sand dunes and water an icy dark blue, and everyone has white terriers they walk up and down the beach, and there are paragliders who jump from the dunes and glide around. It’s really cool. Oh and the chess tournament is the only reason I went or knew about it. Haha",
    "UgzKFo2hK_YB_8XJhHR4AaABAg": "*@**9:23** White should have played Rf7ch.  The best move for white at that time.  Then after black moves the king out of check - white can play Ng2.  This will keep black from Re1ch.*",
    "UgwHZ7EpqjdfrGX9g714AaABAg": "FYI: in addition to the white & black chairs, the players where also driven to the event in black & white BMW's.",
    "UggMFt1eZ_AR2ngCoAEC": "I didn't see 24...Qe4  but was looking at 24...Qg5 with the idea if 25.Bf1 Nf3! which boxes the white queen out and strongly threatens Qg3 where white will have to pitch his queen to avoid mate..white can spoil it by going into a technically lost position with 25.Bg4 though.",
    "Ugz04fWFb25Isv45lTh4AaABAg": "(@17:39) - So I pause the video, and go through my checklist. 1) list hanging pieces. Black only has a hanging pawn on a7, but it would be difficult for white to take advantage of. White has two hanging pieces; the knight on g5, and the bishop on e2, plus his a2 pawn. 2) list forcing moves (for white, since black just moved Qe5). Obviously Qxe5+, but also Ne6+ and f4. 3) after listing the candidate forcing moves, see if they leave other pieces undefended (or leave the back rank undefended, if the king has no escape!). If Qxe5, the only pieces the queen was defending was the rook on d1 (already defended by the rook on b1), the f4 pawn (already defended by white’s king) and the d5 pawn (problematic) If Ne6+, no biggie, the knight was defending no pieces anyway. If f4, the g3 and e3 squares were already covered. Now we can consider the candidate moves that are left. With the exception of Qxe5, none of the other moves leave white pieces hanging (always good). Also, Qxe5 Rxe5, and Black has two attackers on the d5 pawn, and will pile on until it falls (ex: Qxe5 Rxe5, Bf3 Rd8, etc...) If f4, Black just trades queens, and then piles on until the d5 pawn hangs, so this doesn’t go anywhere. So Ne6+, it is. Let’s look at the lines here. 1 Ne6+ Qxe6?, 2 dxe6 fxe6 and white is better. 1 ... fxe6, 2 Qxe5 and again the black queen loses her head. 1 ... Rxe6, 2 dxe6, Qxd4, 3 Rxd4 and white is better, having gained the minor exchange of a knight for rook (roughly 2 pawns worth), and white can now double the rooks on the d-file! 1) ... Kf6, 2 Nf4 ... Again, black could trade queens, but it would leave white’s rooks able to double up on the d-file, and - more important - both white’s knight and bishop can now defend the d5 pawn, and black can’t take the hanging knight due to the pin! I vote for Ne6+!",
    "UgxAAOGCy4m8w98uajh4AaABAg": "7:03 its a winning for black cuz if white king kill the bishop its not a check mate",
    "UgweihyN1j1_gcXLtQB4AaABAg": "Alekhine Saga after this would be great! We'll consider this as the trailer 😄",
    "Ugx5q89dmBH6Pj0SDSJ4AaABAg": "For some reason I usually find the moves in your videos but when I play bullet or blitz on lichess, I turn blind and start blundering",
    "UgzcGIIdugAi8_cBaUV4AaABAg": "#tal...complicate and they will blunder",
    "UgzPq-35jwaxnGw2yOh4AaABAg": "All ever see in the comment feeds is a bunch of losers licking the ass of agadmator. Watch him for 2 years and see if you still think he’s ‘the best’. He’s actually a squirrelly bumbling mediocrity who’s really annoying. I still watch his channel just to see the games. I ignore his analysis because it’s superficial and overlooks huge swathes of what’s actually going on",
    "UgxMpauZo1FGt378jAV4AaABAg": "Mommy, hold my milk n cookies, this bloke wants to tussle for dat meddle.",
    "UgxiOkebNMCvPMBqRYh4AaABAg": "How is the white queen pinned at 2:27? What if white just ignored the black queen?",
    "UgzEAV42vTnLEPKXzdh4AaABAg": "after black moves Qxg2   white moves Qxf7+  Kd8   -Bg7 preparing Bf6++     the only way for black to stop it is to captur the bishop with his queen and lose his queen ",
    "UgzTXft-mh_HJzMBu6d4AaABAg": "I just now finally understood what alpha zero really is...... predator (the same one from 1987) came from space hunting human chess players from the past and the present not for their skull but for their brains to get our revenge of the current chess engines that ruined our romantic chess.. Its a deadly combination of Kasparov, Fischer,Karpov, Carlsen,Capablanca,Morphy,Tal,Lasker,Botvinik,Alekhine and all the other  great players made into ONE bad ass mother fucker chess wizard!!!!!",
    "UgyjiCU7RfyuODtxT-B4AaABAg": "FUCK THEM !! They wanted you to \"resolve\" the issue secretely and put your tail between your legs .. It's a poker move ! they wanted to force your hand, if you kept quiet and did nothing , even if the dispute goes in your favor, then they won't lose anything by trying to threaten you ... But when you called their bluff, they had to pay !!! A million times DISAGREE with Svidler here, you can't just go around threatening people livelihood without any consequences !",
    "UgxcHwuqy6jdtmA7HrR4AaABAg": "i looked at it again.  The king can run to h7 or g7 after a pawn push if white checks with the rook after the queen exchange.  so if black plays g7 or h7, white can exchange queens, and then play bishop to c4, pinning the rook and winning the exchange.  WHite can also get a nice rook on blacks back rank, pinning a piece to the remaining rook, while white can easily bring in his other rook to keep the pressure up.",
    "Ugy3BAkWpy7Zzy6MBd94AaABAg": "but at 15:00 - surely after white plays Rf7, the game continues? As in, it isn't lost for white by any means, it seems. Black has to give up the queen i think - then it looks rather messy, but white's attack is still going, it seems, though i can't find a breakthrough.",
    "UgxdmEDM2_-lb4GD6YB4AaABAg": "dude, every gm I watch loses a fucking game during the stream, how the fuck... not even once, hes won like 28 or so in a row since I've been watching lmao...",
    "UgwvqBegVdPEmhPKiKF4AaABAg": "I think the blunder is that the black completely ignored the activity going on the king side",
    "UgxBjJFi2dD4z13mJnp4AaABAg": "Notice how even if Black tried the desperate “Qxb1” instead of f6, after Rxb1, the threat is Bxa7+ and the rook will support the promotion of the b pawn into a new queen. (The reason Black would take the knight is to pin the white rook to the king and to deflect it from the d file). Without any support from his forces, the black king won’t be able to prevent promotion. If he pushes his a pawn, Black will still fall victim to Ba7+ and subsequently get checkmated by the new queen White will promote to. If he pushes his c pawn, Bxa7+ will drive the king away to the c file (again, going to the a file leads to a checkmate), and White will promote with check, win the bishop on f1, and that’s all she wrote.",
    "Ugi4INO1fycOSngCoAEC": "so bad.. Why Be5 you r fool.",
    "Ugxzw7B_qakUVntJMHR4AaABAg": "This hypersensitivity censorship is going to backfire big time. It will be fine if they just ban a few racists but this can spiral out of control.",
    "UgyTU6HYJ9ntksAq0Vd4AaABAg": "Can anyone tell me why white can't just capture the knight at 12:49? Wouldn't the knight be attacking the black queen even if it opens a discovery to the white queen?",
    "UgzrdVSOTT0q8gQn2h14AaABAg": "human on human action monkaGIGA",
    "UgxL3INAzNuVvFn98cF4AaABAg": "the photo challenge is freddie fucking mercury",
    "UgyPzMLmQYkbmzuX6O94AaABAg": "how the fuck did he trap his queen in the second game...we missed because of bad commentary and we do not want u to teach us fucking cunts",
    "Ugy29ZDjuc76CC1p4tt4AaABAg": "i thought you said, \" in 1997 the year i was born...\" I was like the fuck hes only 23??? I had to replay",
    "Ugz9Gh4UEgLDy4MC0Qh4AaABAg": "Yeah this kid could be someone truly Great, but they are already ruining him. Idiots",
    "Ugw0-x4tkCmQr9WmDbp4AaABAg": "bishop H4 is not winning for black... White can simply go Knight C6 and black is lost",
    "UgyNT5JyszjfZKMSd-Z4AaABAg": "guess the reason why it's winning is that black has two of his pawns placed on white squares while white has two on black squares. Gives white an attacking advantage with both having a light-sqare bishop...",
    "UgzBXLSzcvfx8S8J-5l4AaABAg": "Seeing black win feel good",
    "Ugg-nCM5u_cDTngCoAEC": "Yes Mato , something special to me. I was born in that year . Love to watch chess games videos of your",
    "UgyHRWTuNFM4tyvSA494AaABAg": "g2 was never a threat with rook on g1",
    "Ugx-7UXiJSyJ1tJYuit4AaABAg": "Hehe Tal was funny dude, very aggressive style, no regrets, he crushed those russians like bitches.",
    "UghOPosCqZ7083gCoAEC": "You should voice in movie trailers",
    "Uggxm2tn9mSgwHgCoAEC": "I've invented a new strategy for beginners for winning any chess game.  It's called the FAT LOAD, FAT TURD or FAT WAD strategy.  Here's how it works... You take another fantastical universe that I have personally created _just_ for you where YOUR pieces are magically all queens, all the time and your opponent's pieces are always regular pieces... Check mate...! :D I said CHECK MATE bizaitch!  Get that stupid, weak ass knight outta my way, homeboy!  The end... Check out my new strategy on my page.  Have a great da-aaay! >:)",
    "UgyJIXrt2wpep0aH9IJ4AaABAg": "7:04 Knight f4 isnt winning for black imo. White still would have 4 pawns 3 conected and black only 2 pawns and a knight, with pawn e4 falling for free aswell. So white would be still much stronger then black",
    "UgwhcXWMIKrNxtNdZQx4AaABAg": "They dont shake hands but touch pieces and take pieces others touched. There is running from this virus it's in the air just stop being in fear everyone",
    "UgxKRWj43Ctwby-uZXt4AaABAg": "White has light-square weaknesses...White doesn't castle until move 16...White has the worst pawn structure ever...Black is a strong player who knows how to exploit those things...yet Carlsen still wins!",
    "UgwKDmIU1Sq_MdIHQBp4AaABAg": "At 57:37, if White plays Bxe7 instead of Nc2, isn't White winning easily what with the Bishop on c6 hanging, the Rook on d8 hanging, and the threat of Nf5 hanging in response to Black's Rxe7? I fail to see how Black's immediate Bxe7 saves him! My Stockfish engine also fails to see a Black salvation!!",
    "Ugyy5SCLraI0sYJcujl4AaABAg": "11:08 what if white queen take g4, then black queen e3 and then white queen d7 check and take the bishop?",
    "UgxY2Ay_oJF3ErlYnux4AaABAg": "This guys are totaly insane",
    "Ugy375Hf7x2qok0xTmp4AaABAg": "20:13.  NOT QxN, just move the white knight away, because the black knight cannot escape the white queen.",
    "UgzcagBOi4Imifb5-yd4AaABAg": "11:05 Again sneakiness, if you make a queen right away black escapes with a perpetual",
    "UgwdiJWZvYQtqOtUtQN4AaABAg": "It's because white goes before black.  Obviously chess was invented and played by white supremacists.",
    "UgybYyjm1r5JPK3oLS54AaABAg": "And here carlsen pushed f4 and then carlsen plays another move without or before black move",
    "UgyyNzWA4x16eLha5Vt4AaABAg": "Analyzing blitz game for best moves? I don't get it... Blitz games have other factors that changes the games course, like time, and the use of time. You have the very best chessplayers in the world that can teach you chess, but put them in the competition with all the fuzz around, and strict timecontrol, they just don't know how to play anymore and want to piss on themselves :)",
    "UgyVfO1SRfZUmUgvxlt4AaABAg": "9:52 cant white just capture blacks dark squared bishop with the queen with a double attack on the pinned knight and then white will be up a full rook ??",
    "UgyXdcnEpm2_Bwp2F7N4AaABAg": "I think it’s a disgraceful shame, how Taimanov was treated, in his home country after losing to bf 6 games. After all He’s a grandmaster, that title on its own was worthy of more respect than he was afforded. A culture that belittles its citizens in such a way, is no culture worth preserving.",
    "Ugg3nyj1WUctj3gCoAEC": "It seems black is allready lost with 12. .., Qa4? There are no ways of stopping whites attac, when he removes the f7 pawn. Even if black uses his white squares bishop to protect f7, he is only prolonging the inevitable, because white has everything pointed towards black king, and the queen is lost in the woods. Am I wrong, Mato?",
    "UgxYxGu1DUQLDATnbK54AaABAg": "I find that just letting them go is disrespect full. Play them with respect and give them your all they wknt inprove from you playing like your not into it.",
    "UgwcWeawAhJ8kJvpkL54AaABAg": "The laws on child porn are very strict. If Tumblr does not have the technology or the human eyeballs to look over more of their content, then yes, they are making the right decision. Somehow Facebook has stopped the pedos from overrunning their site, so the technology must be out there?",
    "UgyHpP9hrHFH26KcDmF4AaABAg": "You Tube is controlling our thoughts... White white white...we love Black people and all people... I'm a white older male I'm not ashamed of my  birth. You Tube should be ashamed of themselves. This is a chess channel....not just for white and black people.",
    "Ugz1EmJT25jnejSG4EV4AaABAg": "6:39, is it always true that g5 worth it? I mean, white would have 2 pawns against a bishop and black's kingside is totally ruined and white is ready to attack it.",
    "Ugzf2FjgClHw2zRPsLV4AaABAg": "Very good job, but I can't understand moves like c3 and (even worse) a4. All these moves do is weaken white's king position. White should be playing moves like h4 to get at the black king.",
    "UgwFI4ps1cg5RRkJeGR4AaABAg": "But...but @17:10.(the critical moment of the game), what if after white rook takes on e7 followed by black king to f8, white plays queen to e2 ??? Doesn't it save white queen and wins a free Bishop for white? You didn't analyse this line, so am asking.",
    "UgiymXUUs40EYHgCoAEC": "Mato - my roommates and I in Brooklyn have loved your videos for years... One thought on this one: After black's queen takes white's C4 pawn around move 50, can't white force checkmate, or else capture black's queen, with knight to B6 (check), followed by rook to A8 (check), then bishop to A4 (check), then white queen takes pawn, checkmate?",
    "UgwLq_96c1ORcRlyZYJ4AaABAg": "Your board is incorrectly set up the white queen sits opposite the black king the queen always sets to the left of the king this means white king is opposite of black queen and the black queen is opposite of the white queen learn to play chess correctly",
    "UgxgkulfYRo2jD183bB4AaABAg": "White pieces = white chair; black pieces = black chair. Makes sense.",
    "Ugyq6K5DOK61ftZfcvp4AaABAg": "Only other option after the check from the queen at B4 was: move rook to D8, white queen takes black rook, black queen takes white queen, white bishop takes black queen, black knight to E7 to block check, white rook takes knight, then black king runs and loses black rook.",
    "Ugy17MhiGyK6JaFQu6x4AaABAg": "No cooking is needed for the wild Gelfand. It eats everything raw.",
    "UgyQW4UKM2bYNNn7R8h4AaABAg": "if black rook captures the white rook isnt the white king too far away from his pawn to save it from the black king? i think its a draw o.o",
    "UgxkxxBHuEzRvhl4N-94AaABAg": "7:48 Black should move to g5 and white cannot move to g3 because black is moving g4 and this is strong attacks for black! White after can’t take Bishop because white is loosing Rook!",
    "UgzokdomJx5M75llIeh4AaABAg": "at: 12:04 - I think he played g4 to threat g5 dismantling the pawnstructre, since the f6-pawn is pinned to the king. So black has to take with h6 or let white to take h6. If black takes g5 then Rh1 is a big threat. Since ... Rh4 n. Rxh4 gxh4. n+1. Qh5 threatning Qh8 winning the g7 pawn. But after checking with an engine it g4 seems to do nothing lol :P black was accualy better at that point, karpov blundered hard he should have just played Qc6",
    "UgjyhEH3hbry1XgCoAEC": "We need a new tactician like Kasparov to wipe the floor with these guys.",
    "Ugz6mH4-1wC8WcDNa8R4AaABAg": "The positional foresight on that disgusting engine line... Who sees bishop to A2 and rook to B6...simply beautiful.... Trapping the rooks and crippling blacks pieces....",
    "Ugyy_7oP2kywLGDDXG14AaABAg": "49:00 confused. Why wouldn't black just move his bishop back to E6?",
    "Ugzaq8lr6J8BRH_xCcR4AaABAg": "bla bla bla bla here white plays e4 smh STFU",
    "UgxipfXaLT9NYlN9u894AaABAg": "Doesnt knight a6 stop all the threats in the thumbnail?",
    "UggHkkIuqQ7wXHgCoAEC": "The critical position @4:05 shows the difference between styles. Tal would likely play like George. Keres and I would likely play Rhe8. We'd all be right - White is so paralysed that he is lost anyway. George's move offers Black great practical chances - White can equalise with precise play, but otherwise gets crushed fast. Rhe8 (followed by maybe g6, at the right moment - exd3 creating an isolated pawn for White) would be another step in a gradual winning python squeeze.",
    "UgxrpKhO-lLZl1mXxSt4AaABAg": "Why not White Rook takes Black Rook. Then Black Queen needs to take Rook and White Queen takes Bishop. Knight versus 2 Pawns endgame? White would be ok.",
    "Ugw2A1YKM46XJ_PauJ14AaABAg": "Relying solely on teammates and computers' ideas instead of your own is fucking lame. Go Carlsen",
    "UgxJqmdZF5dX2ZNgrxx4AaABAg": "What a bunch of cry babies. If it really was from a phrase \"White will always be better in x position\". If that was the case, youtube deserves to be sunk to the bottom of the ocean. Tired of dealing with this crap.",
    "UgzcmgOHzckbd73UnvJ4AaABAg": "I think white can win.He don't need to develop his pawn till last but should leave it and go back to capture another black pawn",
    "UgxRED3o2woKGGnV4Cx4AaABAg": "how about Rg5, with a check and a threat to bkack's g4 pawn. navara vs mamwdyarov",
    "UgziB-sMcGzqtbQtMWt4AaABAg": "The globalist want to control everything. Chess is to intellectual for the masses. Can't have that.",
    "UgwRO3nYyDqhEmKlCn14AaABAg": "There was Qf6+ where black played ... f6",
    "Ugx-oJcA1v2ZPIJ4H0R4AaABAg": "game with black. White e4 black f6 white d4 black king f7 white c4 black e6 white knight f3 black d6 white bishop d3 black knight e7 white 0-0 castle black g6 white bishop e3  black bishop g7 white queen d2 black. Rook f8 white bishop h6 black king g8 white bishop captures g7 black king captures g7 white knight c3 black knight c6 white rook e1 black bishop d7 white rook d1 . i have beatin many players with this only if there game was not to advanced",
    "Ugx90ZFqiZ-JzrhPQld4AaABAg": "That’s retarded, so because carlsen didn’t notice or tell an illegal move that his opponent made, he loses. That’s retarded. No offense but like in all sports shouldn’t there be a referee or someone who watches for illegal moves. And why is ignoring an illegal move illegal? Stupid rules",
    "UgirtTgnjYati3gCoAEC": "Im so sorry that black lost..he was more courage than white..white just was lucky..but black played very interested game",
    "Ugyi1h0RWYvgEOGjo_14AaABAg": "Chess can be addictive, fun, annoying and everything in between but Shogi is just a fucking headache",
    "UgyVTgiLTn66wvI22sZ4AaABAg": "agad is like that olympian that steals fire to give the freeezin plebs on the ground that we call chessamatuers... *the principle of 2weaknesses...*  thats how i keep losing my endgames",
    "UgwIBG5ARN_nEHZoSiR4AaABAg": "I didn't know the world of chess was so cut-throat and dangerous. Take your eye off your oponent for 1 second and he might move his pawn in the incorrect fashion terribly traumatizing the entire venue",
    "UggjoMyNwr2PrXgCoAEC": "what about at 8:30 if the queen takes the bishop on D8, and after the rook takes the queen then the white rook moves to C8? the black rook will not catch the rook otherwise the pawn will catch it and promoting to new white queen,, and the black rook also cant be able to take the pawn (illegal; infront of black queen) so the only possibility is the black queen moves to G5 to protect the rook on D8, but then the white rook on F1 will take the pawn on F2 threatenning the next move to F8  Check then the black rook on D8 must take rook on F8 then the white rook on C8 will take it Check Mate?????????",
    "UgwBRQZX1Vt-QP_B6QF4AaABAg": "8:20 I have a feeling that maybe Nakamura missed his last trump card flick. After black played Rf6 white can do Nf7+  if Bxf7 then white has Rd8+ forcing Bg8 block. Then sealing the position with f7 would have been still OK for white",
    "UgwhBuUUM4lNYJbfBfl4AaABAg": "Bullshit if you had a clue you'd know that the SF hackers thoroughly analyze the games and already applying patches to crush your bitch.  Humans will always be smarter, more devious, more clever, more brutal than ai.",
    "Ugw4z0bivSUilJSLRd54AaABAg": "Why are they sacrificing their pieces like that. Stupid.",
    "UgwKR7JorpACOhBy-T14AaABAg": "at around 7:50 can anyone explain to me why white wouldn’t just capture black’s bishop? it seems like with Be7 white is just giving up the bishop for no reason? Help me out here if I’m missing something please",
    "UgyaH7k80nyslTShRol4AaABAg": "4:56 -- White's position here isn't really that bad; in fact, it's fairly close to even. Nimzo just needs to light a fire under his queen-side pawns: b5, (knight moves), a4, (black makes a move), Ba3 (activating White's boxed-in bishop and offering to trade it for Black's monster bishop on d6). Black is still ahead -0.5 or so, which is a lot better for White than where it was after Bh5 on 8:18.\n8:24 -- Capablanca nearly kills his solid positional advantage here by playing fritter moves in the hope his opponent will fall to a trick. Black is about -2 before Qd8, but drops to -0.5 after. Why? Because it gives White a temporary breather to shore up his defenses. A nice, fat rook-lift to f6 was a better move for Black here, not Qd8. (Said exact rock lift eventually finishing the game after much other mickey-mousing around. I'd like to think that Capablanca had the closing mate-in-5 lined up in his head all the way back here, and played diversionary moves until Nimzowitsch's defenses were distracted and scattered away on other tasks.)\n10:19 -- c4 was completely unnecessary to Nimzor's plan; he should have just played Bf3 right away, or slightly better yet, Rc1 or the mentioned d5. But he didn't, and the result is that Capablanca gets his mojo back that he lost by playing Qd8 previously (see above), and the drawish position (0.00 if d5) now leans solidly for Black again.\n10:48 -- Retreating the rook to the c2 light square is a poorer choice than to the d2 or e3 dark squares; I suspect that Nimzowitsch knew this, but was hoping to hoodwink Capablanca into chasing it with Bd3, which is blunder replied with Rc3 (and now it is Black being harassed and retreating while White develops pieces for free). But Capablanca played the top-pick move of Nf6, and is once again bringing his piece majority to bear now that his own back-rank troubles have evaporated.\n11:11 -- While Bd3 was a blunder in the line explored above (in which a greedy but inattentive child might have watched Rc2, Bd3, Rc4, Be4, Bxe4, fxe4, Rxg3 lose him a piece), here it's a great move, because the knight is now already on f6, where it guards e4 (and if landing there, g3).",
    "UgxoHHoOsFC8P_QzLs54AaABAg": "these idiots weaklings gotta do everything myself and the white king goes for a voyage",
    "UgzUJEWRcLZAH5y9MRp4AaABAg": "Actually they both are furious about each other so they only attack without seeing the counter.. Otherwise duda never go for this",
    "UgxJy6Tb7VCT4nsyqmJ4AaABAg": "8:03  white rook to d8 check, rook takes rook, queen takes rook check, black king to h8, white bishop to d3 check, queen takes bishop, queen takes queen, white queen vs black knight, white pass pawn on a2.",
    "UgjrhukDOBagiXgCoAEC": "the real Magnus Carlsen should substitute himself with his app(25 yrs)... pretty sure this beast can easily demolish Mr Karjakin.",
    "UgzbIucdRhlaPoqsJHd4AaABAg": "I was once told this story which I have no particular reason to doubt: \nA young Danish chessplayer - who later became a GM and later still moved to iceland - was often, when the weather was nice, sitting in the pedestrian street in central København (or Copenhagen, as foreigners call it) with a small table, two chairs and a chessboard challenging bypassing people to a game of chess. There would be a little money at stake - nothing much, but during an afternoon our challenger could still make a fine profit. And there was not much risk involved, as our chessplayer was strong enough to know every Danish player who might be able to beat him.\nBut one day an old foreign gentleman with a soft hat and a walking stick came by. And he played a game ... which he won. Our Danish player wanted to play again ... and again he lost! I don't know how many games were played before our young Danish player asked the tourist who he was. The old man was ... Naidorf.",
    "Ugxi4hTh6adHZvDS1Hd4AaABAg": "They really destroyed the aesthetics of that school, ironic that it's an arts school, or maybe not ironic, as postmodernism destroys everything it touches.",
    "UgwjpXniLLKiabBNkKx4AaABAg": "I like how these people can sacrifice their queens meanwhile I risk everything to keep my queen alive.",
    "UgxG_t-wAhUr5tZkSgx4AaABAg": "14:16 - Black rook to D1.  White king has to move to F2.  Black pawn promotes with check.  White king has to move again.  Black is up a rook and a bishop.",
    "UgyP_NoEQS4zEJ4nw6R4AaABAg": "10:00 why black doesn't capture that pawn?",
    "UgxmdymTDgHChM1k20d4AaABAg": "What is it? Chess for ants?? Only dedicated scholars should play chess! Get out of here you patzers!",
    "Ugy5VuwBRaek5ZSQC_F4AaABAg": "white would have been much better if after g3 he would have played Bxf7+ instead of Nxf7.  and white would have an easy game (followed with bishop e3 to defend white king . black would have really hard time with it  . ",
    "Ugxtkue-kUZJ5ML_fVJ4AaABAg": "I don't get it... rook to A1 traps the queen by threat of checkmate on A7",
    "UggCqnwLNUeot3gCoAEC": "LOL!!! WHAT happenened the next day to mr Caruana?? Bwahaha!! Good job to reporter who boosted his ego so bad he thought he was God Almighty. With a moustashe. ",
    "Ugyb5Yih--Nx5vhqM8x4AaABAg": "6:49 -- The trickier way to prevent White's Qc7 is for Black to play Qb6 here. White is still winning, but must work for his meal: Bb7, Qb6, Bc6, Qa7, Be8, Nxe8, Qxe8, Qe7, Qc8. The mating threat has been neutralized, and White is seemingly only up a pawn and with a knight versus a bishop, but Black's pieces are immobilized. Nd7, Kg1, e4 (the pawn-storm begins), f5, e5, Kf7, Nf6, and it is just ugly.",
    "UghOkOFzzH8pTngCoAEC": "Four pawns against two, white has no chance after all , but the bishop sacrifice simply hasten white's demise.",
    "Ugw5VscNf-tEosQ0zUN4AaABAg": "It's games like this that hammer home just how high in the stratosphere the play of GMs like Carlsen and Svidler is, and how I'm seemingly still wallowing in the mud. Very interesting game. Great analysis!",
    "Ugxl_wEncGegilTx1PB4AaABAg": "Jews are superb in chess!)",
    "UgjNgNV6JfxZWXgCoAEC": "luv the way he says reSSIIGGNNNed...!!!with a killa moov",
    "UgzaQAeoXzssVkGSPXl4AaABAg": "It seems I'm even better than Caruana these days. I mean you can see from the beginning that the white bishops are going to be a problem because they are aiming at the black king",
    "Ugz9Fze9MHUG3eg-IjR4AaABAg": "I hatee it so much. Fucking prick.",
    "UgzPhUyCL25MesrjsoJ4AaABAg": "The fucking tangent for profilactic 😂",
    "UgyzG4R1t_jnzuZ6txN4AaABAg": "If this was taken down by an AI that could not contextualise the black vs white issue here, then there is still hope for us humans. If it was taken down by a human instead, then I really fear for mankind. To be so utterly stupid simply begs belief.",
    "Ugz2giXcqriuW_dbLyF4AaABAg": "Guioco Piano, how classical!  Engine says White is just slightly better, until 14.exd5 when White should have castled. And 21.Qd7 was a mistake; better was Qc3.  And of course, at move 24 White fails to see that the N was \"free\" for Black, because gxf3 exposes White's K disastrously; h4 followed by Rh3 would have prolonged the game.",
    "Ugy5MB6B-EElVQhwJZF4AaABAg": "0:27 he also could have played Ne6 go trough the steps and u will see that Black will definetely lose his Queen",
    "UgzzzO01PZqANuv_qMN4AaABAg": "giri is impersonating a potzer !!!!!!!!!!!!!",
    "UgyHDr9rkjXVuRRvOPx4AaABAg": "In the black-and-white picture of the match, the pieces on the board seem to be black-and-black!",
    "Ugzw_-wSOK7twuuhEwR4AaABAg": "celebrating his win like that? totally gross and disgusting. Against the rules of chess. Atrocious, take this crap down. It is not what chess is about.",
    "Ugzjf-wrTlSZJ3TmWwZ4AaABAg": "its funny to me how being sportmanlike is a chess rule but every fucking gm will try to win those endgames, i know its hard to draw the line but chess should have a comitee to try to",
    "UgzdPiJmKvtEGRSwdd94AaABAg": "After white Qb7 at 18:50 why didnt black move his bishop to e4. This would be a discover check with his queen. White would have to lose his queen and then the game would be over.",
    "UgwtfXAkHGjskhW_tv14AaABAg": "What move would you suggest? There are threats all over, if he doesnt give up the queen i imagine he is mated soon.",
    "Ugicd9Ccl1j2fngCoAEC": "I never wait to bring my queen out that's stupid.  The queen is a beast and you put her on the offense right off the bat and weaken the shit out of your opponent with her.  Never keep her back that's crazy.",
    "Ugx3zarglml9mq7WOHh4AaABAg": "At 1:43, if white king simply moves to G1, it's the end of black's attack and white is only down a knight, right?",
    "UgwTbEZtvrqLlNkvWHB4AaABAg": "yasser we dont give a shit about the games you say you remember... cant you stop the useless yapediyap???",
    "UgxAnPu3cKVBy2NFGS94AaABAg": "Wow! Morphy is steamrolling them fools! haha",
    "UgzPT6Ee3YbvApzCoIp4AaABAg": "- \" I need an ashtray \" (a smoker)\n- \" Let's capture this unprotected black rook and use it for your cigarette butts... \" (white, playing)",
    "Ugwoz8SBRYqkU2NPX4V4AaABAg": "There should be no censorship on talking about anything, it's a free world but it's more and more starting to look like dictatorship by 1%. My fellow humans our right to speak and have an opinion is in greatest danger ever after we got it. Fuck YouTube, does anyone know some good alternative?",
    "UgxuBAH70DtznxKf8754AaABAg": "I can see a future where you hook up LCZero to a human and it figures out how to kill that cancer etc..  It's a dream, like Karpov's in the description I suppose.",
    "UgwiUKw156-GPxJ_bYZ4AaABAg": "Dude you're so fucking funny and you don't even try",
    "UgzqML89m5c8QanONiV4AaABAg": "On 12:48 why not just wait till white h6 then black Bh7 to force white Nc2 and black winning piece on Bxc2 ,white force h7 then a1 checkmate ..right? Any possible defense? after white h6 then black Bh7 was the best move for me though #agadmator",
    "UgwaQqp-GtIyi5fyckZ4AaABAg": "And also lol yeah with the queen the knight presents a swapping of queens if white bishop attacks well then the black queen responds and if white tries to take the black queen like I said the knight....or obviously white queen attacks first he'll lose it. Also note the knight on c5 will protect be8 to be9 in order to protect the rook...so no Einstein chose correctly.",
    "UgzoLFReP27ab_7osaF4AaABAg": "Beauiful video! What if after white Bishop takes pawn on e6 and black king to b8, then instead of Qxp, Qg8 check! Seems white can get either a perpetual, skewer the black queen, or check black with the dark square bishop.",
    "Ugy4RRRtI1c_VTy_IDV4AaABAg": "If it's blacks move he can checkmate the White. If he move Rf8 to f1 and the Black King will move the the light square a2 and White will check again with his Bishop, if the Black guards it with pawn, Queen will check the King at a3 and the game is on Black.",
    "Ugzv0sQcqQcVYCkJqFt4AaABAg": "Questiion: At 3:38, when white's black bishop attacks black's queen, why couldn't black move his black bishop to b4  (instead of moving his pawn to b4)?",
    "UgyM7SQmynhgZzK6zxR4AaABAg": "lol black has been checking making threats about the half of the whole game :)) interesting ",
    "UghiQfMSqRl6x3gCoAEC": "How do you feel about playing against the nimzo-indian as white? It's arguably one of the best defences out there for black in all of chess and it often gives black concrete goals to work with. I personally thought playing against it was such a huge pain that I switched to the catalan opening to deal with it.",
    "Ugwt5NGdTYrpYTZlNnV4AaABAg": "Hou Yifan will return and dethrone them all. We all know. ❤️",
    "UgwqcxiOYyxStReS06l4AaABAg": "Correction: I missed a move! After Mato's Bc6 White has to play bc: since 0-0 hasn't happened yet. Black plays Nbc6:. White plays 0-0 again threatening Rf7. Ne5: is met with Rf7 ( Sf7: ef7: is mate). Black can't play Rf8?? because of Rg7 mate. Can White's threatened Rafl be stopped? ",
    "UgwYFKJHEcyUAUuykrd4AaABAg": "And what about snooker and pool. The white ball must hit black brown and yellow balls. The brown and black ball cant even protect themselves. Actually YouTube is racist as well. 1:07 big white letters on black background. Omg when someone starting the stupidity its hard to finish it.",
    "Ugx6p7xcZF3GzUIq8dR4AaABAg": "13:19, white can continue the attack with Q-g5, white will have to retreat with (1) K-h7 or (2) K-g7. If h7, then Black: Rxf7(check) , if g7 then bxe5 (check). Both these lines are winning for Black.",
    "UghVVNP7l2mhdngCoAEC": "i like how white ignores all of black threats throughout the game....too good",
    "UgxhfERUX-bScJyS_op4AaABAg": "The white chair is for the player playing white? Maybe?  & black is for playing black? Looks that way in photo",
    "UgyeMgFO-OY2foYS9px4AaABAg": "Is it just me, or does is sound like @agadmator says \"jew engine\" when he mentions Ju Wenjun...??",
    "Ugx8o0vJCeQWF9Hes2V4AaABAg": "*You guys need to do much better job than this. You need to adjust (decrease) players Elo with their real FIDE Elo unless there's more than 600 points difference! I mean you got NMs with ratings 600 points above some GMs and IMs. I don't like playing when I lose to everyone. That's not funny. Elo is there to help establish consistency. It's not funny to have 2800 Elo untitled clowns hanging pieces in some games and in other games playing better than Magnus Carlsen ever will be able to! You need to diversify your anticheating measures. You need to make them automatic at all levels of play. You got all the stats. A massive amount of stats is just like dactyloscopy. The error of erroneously accusing somebody approaches zero! Analyzing single games often doesn't cut it! It's the whole array of data. It's good that you took measures against many titled players too. That's the most important thing to have at least more or less honest online play among titled players. That worries me a lot, as we all love to play blitz and bullets for fun. These games should not be treated lightly. We have FIDE Elo for blitz games. We must, perhaps, take online blitz games a tad more seriously. But I'm drastically against decreasing classical time controls in OTB events!*",
    "UgiWkP3vNHAVJngCoAEC": "Black waited for white to leave a foot soldier open and threatened to kill him while letting white have knife at the black king's throat.",
    "Ugw880M9K4JtvsraTz54AaABAg": "For me it would be interesting if only black or white would be allowed to castle to proove that castle indeed ist better than not to castle and what moves would be the best for black oder white..... Maybe it will be surprising….",
    "UgzG-Xkvh9XgYPy-JsR4AaABAg": "By date, none of them can defeat Mangnus and they know it, if they do not lie to themselves.",
    "UggNWsJQP3Dsf3gCoAEC": "Hi John,  at move 20 what if white king takes on F3 instead of Bxc8 then after if black play B7 now Bxc8. White would be exchange up I guess. BTW your videos are awesome.",
    "UgwJ6m_7EKoK8XTbu2R4AaABAg": "You guys do know a lot of the people that watch chess videos are kids right? Stop tainting the minds of the next generation of strong GMs with these foul ass jokes lol",
    "UggD745CmA5CsHgCoAEC": "Why doesn't white take the pawn on c6 at 4:14? If then black rook takes the white rook, it leads to a win for white.",
    "UgjZVQyN7usB1HgCoAEC": "@6:46; why didn't black capture the g6 pawn with the rook?",
    "UgwIP4MX2DKDDbdjAdl4AaABAg": "Agadmator be like: Okay, white is up a queen and a whole rook BUT black has the bishop pair. White still has some compensation for the bishop pair but it is very unlikely he will survive that",
    "UgwrL5LNlP6IhLizWaV4AaABAg": "GitHub and other source code repositories are renaming \"master\" to \"main\" because they say it's an offensive reminder of slavery. Note this is a very difficult change to deal with for many programmers (old scripts, current working directories etc), and the term \"master\" had no relation to master/slave to begin with. Can't believe this insanity is now even effecting agadmator's very peaceful / intelligent channel",
    "Ugg3D9ZSVI0JX3gCoAEC": "Bd7 by black is a mistake.  It allows white to play Qe2 and white wins a pawn.  The better move is c6.",
    "Ugw8G0A7zVB-WFY7hGJ4AaABAg": "Really liked your dismissal of the haters. Good too see that the real chess enthusiasts don't allow that kind of crap to poison the game we love.",
    "Ugx2Uzs416t0z6ge_Bt4AaABAg": "7:54 why not rook f5 check. Pawn has to capture f5. Then rook g7. King moves then white trades rook for queen. Then pawn captures f5. Sure you're down the exchange but pawns are equal and white has a pass pawn. Black preferred but white not completely lost. Unless I've missed something",
    "UgwO39skSS-thIXsApZ4AaABAg": "All the retards coming in now 'I came from this video, I came from that video' stfu and just watch the video. It's not a stage you dont need to announce where you came from.",
    "UgwbRGBKcQOSjlj7Int4AaABAg": "This is the most pedantic shit. No one cares. You move your pieces then press the timer or whatever the fuck is going on here. I don't play Chess so I'm a complete outsider but it just sounds like the loser is salty to me. If I was playing with a friend and they said something like that, there'd be raised eyebrows, a silent mouthed \"okay...\" and then I'd start considering how to forfeit politely so I could get the fuck away from the weird shit.",
    "UgyBKY1vIoKja9C_pnl4AaABAg": "I like how they think that people don’t want to lose to a fortnite player is because we think they’re stupid. It’s because they’re *cringe*",
    "UgxakRjY2XB0NMk6U0l4AaABAg": "White chair, because they're playing as *WHITE* . smh 🤦",
    "Ugwv-yhXEmbirScnUzR4AaABAg": "Akobian could have won by Rook to F4! at 9:35. Brilliant move! Then black takes A3 and White moves rook to G4 to escort his pawn down. Black B3 to move out of pawn's way, then the race is on! G6, A3, G7, A2, G8 and white has a queen. A1 and black has a queen. White Q takes rook and there is nothing for black to do here, and in this position, Nakamura resigns.",
    "UgyWYaMXEcxj1wcorS54AaABAg": "That would be a mistake .....If black king goes to e6, then white king e8 and black can't check white king anymore.",
    "UgxM-iOroMdk2d2yDzx4AaABAg": "Most likely to come back from the dead and lead an army of white walkers against humanity:  Robert Fischer",
    "UgzSBRhwBKd6th4wqBN4AaABAg": "I love your breezy style and overall analysis! However, I think there's a slight inaccuracy at 3:15, when you claim that the \"best thing for black would have been to castle\". That's not right: If black did castle, the knight on c6 is overloaded with the defense of both Ke7 and Ba5. White would play Bxe7, and after black recaptures with the knight, white would play Qxa5. That's why black correctly did not castle at that point and, instead, moved his bishop to b6. Of course, black really, really, really should have castled at the next opportunity!!",
    "Ugy5HM9BQ_JpA1pc64R4AaABAg": "at 5:52, what about b6-a6 for the black?",
    "UgxJHpm9h11x-SrHRLx4AaABAg": "What a odd way to play the siclian",
    "Ugj3o_6P9ZtguXgCoAEC": "At 3:38, does Black Queen \"have\" to take the white Knight? If Black King escapes to f8, then white knight goes back, it is discovered check, and if King escapes to g8 again, white knight comes back, repeat it three times, and black draws the game, which should be advantageous.",
    "Ugg-Qs6SLhK7tXgCoAEC": "What would you do if you had white/black pices? Please pause the video and find the best move for white/black. I missed it today",
    "Ugy8WRrp2RR6UkDmZpR4AaABAg": "That trailer was Amazing!!! Everyone, please go watch it.",
    "UgzwMFkZRAmUUj7asl54AaABAg": "White chair > White pieces / Black chair > black pieces ?",
    "UgwCGo-ARUtib__vyet4AaABAg": "YouTube has to get its shit together. We see this kind of idiotic behavior and at the same time it is extremely easy to find channels streaming The Simpsons, Family Guy or pretty much anything. They keep harming genuine content creators while at the same time other very obvious transgressions are ignored",
    "UgzeQ2Tc6chb1_ChHl14AaABAg": "5:33 isn't khg6 possible to threat the rook?",
    "UgwTR-aajIiYRAZ9l6p4AaABAg": "AND PRESS IS ANOTHER CHESS TURD THAT PLAYS A FIANCHETTO STRUCTURE AS THE WHITE PEICES! TSSST! JUSTICE WAS SERVED AND ANOTHER TURD IS FLUSHED DOWN THE DRAIN!",
    "Ugw9Me-IjLXNORbAK8p4AaABAg": "9:11 isn't it checkmate by black?",
    "UgzHXUXfE3WMAyeyZLN4AaABAg": "On move 23 white play c5, instead if white play f4 then white simply winning  a piece by forking Knight and bishop.",
    "UggZBg9kmWB26ngCoAEC": "THIS guy is a jerk he had no way out and STILL did not throw in the towel...",
    "UgwIMr9SgzGrz9mckRt4AaABAg": "YOUR CHANNEL IS THE MOST HARMFUL EVER.  It depicts the eternal battle of white vs black.  Well in my case brown hand made chess pieces vs white softwood pieces",
    "Ugx7fyB9xZJprG_7UbZ4AaABAg": "Amagmator handles this stupid situation very well. His idea of a \"\"white list\"  is a no-brainer. Good sign that some human could look at this and put it back up online. Situation would be much worse if this were time-sensitive information.",
    "UgxqtVSpsLWevH8gIe14AaABAg": "after Ng5+ white can play also Kh6 and white has no more threats, black is winning",
    "Ugi4znDkOsKC5ngCoAEC": "What if white simply waits until the black king gets to the D-file, then blocks him off with Rc8? Then black has several unpalatable choices. 1) try to chase the rook (move the king to d7), but white just moves Rc4, or 2) advance the A-pawn which just brings us to the position in the previous video after Ra8, or 3) Move the rook along the 1st rank to a square where it won't be captured, in which case white moves his rook back to the A-file, and black's rook has to go back to a1, and white just moves back to the C-file again keeping the king too far away from the pawn. Needless to say, if the black king doesn't approach the A-file, white can waste all day just shuffling Kh2<->Kg2!",
    "UgzRPwDlYrSNBIJUTk14AaABAg": "Why black did not do pawn on e2 checkmate? 6:00",
    "UgyP6jmG_tNB7K3ehpd4AaABAg": "sssssssssssspectacular!  this guy is a fucking machine jesus christ",
    "Ugy5mQFbatmreqeRit54AaABAg": "6:43 how over is it though? White would have to play Ra2 and if Black takes with pawn, then King a1 means that white it out of immediate danger and is only down two pawns. If Black queen takes, then White trades queens and even if Black rook takes, then White is still only down two pawns. And, if Black wants to use his rook for other purposes, White king can attack the past pawn. Obviously it's not great, but it'd still be playable for Caruana right?",
    "UgyQ16aaVQYGm9Px8HJ4AaABAg": "I love that voice you make when you say \"White/Black made a move and White/Black resigned.\"",
    "UgwZhAosFp8XYpaokmF4AaABAg": "After black plays Rc8, white needs to move Rb7+. The took capture you show would allow blank to take the white queen, right?",
    "UgztpIt4r51m0RQbMg54AaABAg": "Problem is that its owned by USA company people over there are so touchy about anything spreading crap ideolgies to the rest of the world. Cant mention anything \"bad\" and they cry about it",
    "UgwmsNlbNqgtD2-n_Hd4AaABAg": "Future is unfortunately dark for human chess... there are 2 variants : 1.human chess will no longer exist, 2.humans will be scanned for implants at the beginning of the match and even during the match ...",
    "UgwAxEw7YEokxc6VPSp4AaABAg": "Fabi and Ding now are monsters... they are really strong",
    "UgyyhSYcjreK_0R1KkZ4AaABAg": "How about black playing Qb1 after White's Ka7? Is it a bad move?",
    "UgxtMile_YfWVIdkd5l4AaABAg": "Let me start again black queen takes rook forcing checkmate white queen takes queen preventing mate black pawn to c5 freezing up bishop next black move black rook trap queen to deliver checkmate by black rook",
    "UgxlHBLKKTtFKaQVLON4AaABAg": "It think white has the balls like an elephant .",
    "UgyV0M3ZYh6kV4XNpDZ4AaABAg": "If white did play kb5 instead of queen sac on d5, black can simply move bd7+. The position  can repeat to draw after white move kc4, unless white played qd5.",
    "UgyaVvfRvH-hNMS-Q1J4AaABAg": "hi mato.I wondered what country you were born by the way great video ",
    "UgyK106Tc9p1BOL1BKh4AaABAg": "Black chair for black pieces...white chair for white pieces....same applied in Fischer vs Spassky games in 1972...surprised u didnt realise that agadmator",
    "UgwdUAxhssbDrobTKcF4AaABAg": "Kg7, h4, Kf6, h3, Ke5, h2, now if you advance white pawn, black king will just go beside it on b7, if u put king beside white pawn to protect pawn then black queens. And white is two squares away from queening which is plenty of time for black to mate. White is lost...no?",
    "UgyyDs0xXCMEMo-KYLZ4AaABAg": "i hate how carlsen loses bc of his fucking health. he needs an efficient break from chess.",
    "UgxwRUrrrWn1EI4PGMF4AaABAg": "Who the fuck is disliking this videos. Whoever you are, you guys sux.",
    "Ugy_sDRp9r0L9kNzwbJ4AaABAg": "Africa is suffering from starving but it doesn't matter as ratings are ratings.",
    "UgjGuVPG6OzlkngCoAEC": "4:09, I thought a good move was Nh7 \"sacrifice\" with threat of next playing bishop G5",
    "UgyglaDtH4iNDEx0dbV4AaABAg": "After the white queen takes that pawn she checks the black king. After that white will go QxR. So g3 is not a good move.",
    "Ugz6j6v8hiQW3ZqmLcR4AaABAg": "@8:39 why not black kd4?",
    "UgzLNZjfqNT_0Hl44sZ4AaABAg": "This is just a blunder and white missed/scared to punish black. Stockfish says it +10 if white captures the black queen. IMHO this is not a beautiful game, just two blind players",
    "UgzGOfxhYNtcaWQkrgt4AaABAg": "at 2.17 why not just use the white pawn instead of the white queen to kill the black queen?",
    "UgxoWLH511cXfKRwTaR4AaABAg": "Why black resigned? ... Nf4  and force endless check. Whites are forced to check all the time because of either ...Nd3# or ...Nxg2# whichever is not covered by Queen (and Queen cannot cover both of them).  Whenever white Queen checks, black King just goes from d6 to d7 and back. What am I missing here?",
    "UgzaMtjVrkFaFp3BD194AaABAg": "Uhm maybe morphy was white? Isnt it odd that liechtenheim would have white in 2 consecutive games? Looks more likely to me than losing this position with white",
    "Ugw0g6BLk5QTqaxJe4J4AaABAg": "4:42 Rxe5? Black can't take back because of Rb8 threat. Course with Bf8 black can survive, but without queen there are less chances..",
    "UgwjafROCCy-WNzfCpN4AaABAg": "If queen takes knight, then white's knight forks the rooks. Since the rooks are not connected, white is threatening to take a whole rook (therefore, up the exchange). So, if black moves the bishop, knight takes rook, rook takes, queen or rook takes black's knight. If black tries to save its own knight, white's knight takes the rook in the corner, and cannot be trapped. Either way, white gets a rook for a knight. Right? Idk I think this is the right idea.",
    "Ugx-MInue3XPKDTQoDt4AaABAg": "21:30 I can't defend against the threats, I don't see them!!",
    "Ugy6OtBJXgDdOQrz1Pt4AaABAg": "So the tempo Black saves by not playing ...d6 allows him to create early tactical threats along the long black diagonal and vertically against b2. Interesting! Does White have any way to counter that theme and establish an opening advantage?",
    "Ugx1b1OXHIWDCZVu0fx4AaABAg": "two pawn down is never an advantage.Humans just cannot tkae on that beast!It is beyond human comprehension,hahahah!Playing at cloud strength,maybe zeus could stop him!",
    "UgxdrqGmOB5bH2and_J4AaABAg": "Don't ban them, they are geniouses. Just take their diamond membership and cancel the 1 week free trial.",
    "Ugw60qBScLGEcBaPlW14AaABAg": "“Giri try winning a tournament first before opening your mouth”-Magnus.    Girl has no business playing in the Candidates.   Not only does he suck but he’s a coward too.   MVL should get his slot.   How did this clown get a super hot wife like Sopiko?    🤦‍♂️",
    "UgyfN6ZubhLNxxBcv4l4AaABAg": "almost 1 move per second... they're blitz beast..",
    "UgznLYfT8adYfhk7K994AaABAg": "12:52 isn't the immediate threat Queen to F2 checkmate?",
    "UgxXlF-kBPNFjKhoOPJ4AaABAg": "at 8:17 why did white not capture the dark squared rood and put the king in check by doing so, either the queen or kind would capture black bishop on f8 and then blacks rook on 1a would re-capture whites bishop on d1 and this'll make white with a rook and a queen and black with 2 rooks, 2 knights and a light squared bishop which is a winning game for white in my opinion. this'll be full compensation for the loss of whites queen",
    "Ugzwftp1utJwUY0O9mB4AaABAg": "At 4:22 white plays Bf4. Then Agad launches into this line: ... d3, Re3 Bxe4, fxe4 Rxe4 and Agad says that next move white is going to lose the bishop on f4. And I was wondering why can't black defend it with something like Qf1 or Qf3. Well Qf1 loses because you're not defending the e3 square enough - so you get Qf1 Rxe3, Bxe3 Qxe3+, and black's won the bishop. Qf3 is a longer line but still ultimately loses the bishop - after Qf3, black plays Rae8 to pile up on the e3 square. If white ignores this, black has too many attackers on the e3 square and after a bunch of trades black's won the bishop and gotten their piece back. To not ignore this, white has to play Rae1 to defend the e3 square. But then black can play d2, and the only way white can stop promotion is by playing Rd1, which abandons the e3 square and again, after a bunch of captures, black's won the bishop and gotten their piece back.",
    "UgyFxXn5FF19EzZdN4J4AaABAg": "Is it me or xQc was born slow...I see all of his videos and his reaction time to anything is like very slow.",
    "UgxR6tllR4CtDuRlbxx4AaABAg": "you're lying if you think you know what the fuck they are talking about.",
    "UgwwwaEm-kvbFqp6i0F4AaABAg": "If people are determined to fuck up a good game of chess in the name of entertainment, why not give other attributes to the pieces and keep the old format for their placement. Kings that can move like queens, superstar pawns, righteously angled angled bishops and kights that can walk, trott, canter or break into a gallop, plus of course a queen that might have to stay at home with the castrated castles and join the hashtagMetoo, movement.",
    "UgzjJE73jBTg13GB4xt4AaABAg": "\"people's attention spans decreased\" hahahahah, essentially saying that the human race has devolved into laziness and impatience",
    "UgyLeBCA7B9fPc4sC8p4AaABAg": "Alphazero would destroy his queens Indian as well",
    "UgxiSd0bhoSeyy-Yc9V4AaABAg": "3:35 black bishop protecting white a pawn and attacking black a pawn",
    "Ugz-6KquvbJFYods1FN4AaABAg": "Complicated. The queen isn't trapped just yet, but black has to give up some moves in order to not have it trapped (and white's pieces will get activated in the meantime). The pressure is just too high for black with white's e5 knight and black's overextended queen. After (starting with black to move) Qxg3 Rxf2 Qe3 white has many options, but black's queen will either find an escape or try for a trade of queens on e4. White would be able to really activate his pieces and barge them through black's defences, probably starting with Nxf7. There's alot of possibilities here, but I would definetively try to play on; you never know when your opponent blunders, even if it's Bobby Fischer. I'm not that good tho and I'm probably wrong, but I love this game and this fantastic channel! :)",
    "UgxazLC08hvkQowOrAZ4AaABAg": "4:17 white to move plays b3\nI thought maybe playing Q a3 could be super ugly for black\nThe threat is Q f8# and since there is no blocking that the only defensive move seems to be Q f7, which would give up the a7 pawn or just force black to use up several moves to untangle",
    "UgydeBk-dPVfVwC4t8d4AaABAg": "$5,000 donation, absolutely foolish. Big macho testosterone off to see who has got the biggest pawn, king combo.   A twattish and ostentatious display of internet cum lords, displaying their unspendable incel money before the inevitable nacho induced heart disease wipes them out.",
    "Ugx7TNJF2-agfnR-s1V4AaABAg": "After 36. fxe4 white is threatening Be1 but I think the threat is not the a5 pawn but the move Bc3 threatening the e5 pawn?",
    "UgzXR3cnpRgrb5tWdd94AaABAg": "Gonna be a few minutes late to work but fuck it. Always watch all you videos",
    "UggqjEdwOKpF9HgCoAEC": "Yesss! More and more of this kiblitzing hikaru! And thx, very instructive.",
    "UggiIJLKvkAKrXgCoAEC": "kill black move only 1 muve and waight is good and finsh the game, if waight rook go to E 1",
    "Ugzer8ttTmVy83u3dGx4AaABAg": "1... Bxg5 2. Qh5+ Bh6 and black is betta",
    "UgyJrrf8sAoRizHNPwN4AaABAg": "What about queen sacrifice by white. WKnight to e6. Black bishop takes white queen on f6. WKnight to f7 check. BKing to g8 (only move). WKnight to h6 chkmate.",
    "UgyYB0yOnzRJOl_uCcl4AaABAg": "This Charles dude is trash",
    "UghzWMRWN4ZiG3gCoAEC": "Why can't world champiomships these days be like this..? specially woth carlsen and karjakin, its boring ass draw games",
    "UgyJs3XAUmi7WF1sIjx4AaABAg": "Pretty sure that winning endgame that you spent fucking forever analyzing is actually a known winning endgame.",
    "UgyG4jDdW8qIMyaTmqB4AaABAg": "I just won three games in a row. Beat that bitches. I know u can but I had a horrible start to my chess day today losing three games in a row I'm hyped right now having turned the tables. Am a bit afraid to go back into the cauldren. Bullshit, I'll be back just as soon as I pick op me dogs poop from the garden.",
    "UgyjJZq-TscceLb96sp4AaABAg": "One of my favorite players with white: When GM Huschenbeth is playing white somebody (mostly black) has to suffer.",
    "UgxRDNBP0_2wzM-vBcp4AaABAg": "Player with white peices get white chair and vice versa",
    "UgwFJNpq_9lRS9o2Byp4AaABAg": "Fuck these dislikes. It is a free video, stupid kids",
    "UgxA-0btY1Yv9aIJeU54AaABAg": "I would have thrown in my towel when Magnus made his 1st move..",
    "UgxEO85cu8Tov1oRkXt4AaABAg": "@songa520 yes but if black didnt move its queen then it would lose it because whites queen doesnt matter and black would be fucked",
    "UgzFgSSpc9HN-ik4tbJ4AaABAg": "If you do nothing else go to 21:10 and watch Ben analyze why black is better.  I was looking at the board and thinking to myself, \"White isn't too bad it's gotta be equal, maybe white can play f4, maybe white can find a trick and grab 2 pawns for a piece, but Ben was able to notice the entire game just how badly placed that white Queen was.",
    "Ugzp21zaYKUzhlwgGl54AaABAg": "It's so racist! The white guy with the white pieces beating up on the black guy with the black pieces... charges should be pressed. And we should categorically change the colours of chess pieces to brown and beige. And include some deviations to recognize other ethnic groups too. (Don't hate - I'm only joking!)",
    "Ugz1Aj04bhQG-2Wo9vF4AaABAg": "Oh I get it. White always moves first!!! Racist bastards!!!!! 😄😄😄😄",
    "UgyfLN0SC6QvNZrgWjx4AaABAg": "I’m surprised that this take down video didn’t get taken down. What filth!",
    "Ugxn_91O5vAEgKqFclB4AaABAg": "Wait... did you say FOURTY TO FIFTY PEOPLE AT ONCE BLINDFOLDED?  What the literal fuck.",
    "Ugx2Km6Sk7jD19gor_94AaABAg": "That is one of the most beautiful attacking sequences I have ever seen, black was always on the back foot. Thank you for sharing. Seeing your channel one day in my recommended got me playing chess again after 15 years. All the best.",
    "Ugj23gGVJVpvqHgCoAEC": "the yellow circle sucks ass.",
    "UgyygtJgB_Ow0fW5Kbh4AaABAg": "12:28 In this line white must offer the rook trade and forfeit a pawn. Else white’s bishop on e2 is hanging (the black rook will capture on e2 next move and white cannot recapture with the queen, as black will respond with queen captures rook on c1 mate).",
    "Ugw7RuU0VtoY1aWFYr94AaABAg": "Trump should hire medo (agadmator's dog) to fight spirits in his country",
    "UgxnC7TfDHSR1pxl_DJ4AaABAg": "At 5:48 what about white 1.Rd7.. Then 1...Ke6 2.Rc7 and then white king can step aside to Kc8 and there are no more checks..",
    "Ugzhz8NA2GsQXnqBnVJ4AaABAg": "These AI's play the way a python subdues its prey. Wait for it to exhale then tighten their grip.",
    "UgzoRfc4Q9Xd4ITNl0p4AaABAg": "If Qg3, then Qf2 could happen either requiring a trade or black loses his queen. After the trade of queens black has to move a rook or else they'll get forked with Nf7 but Nf7 still comes. Now they're completely even, white has better position and is planning to double on the F file and black has an isolated pawn. What do you all think?",
    "UggN2kQta8VGXngCoAEC": "Bad game from both sides, black sacrifices too many material and white atack with the king like a rookie. Old times bad players.",
    "Ugy7cWFh8pMKko8TgRF4AaABAg": "at 9:58...if white played rook d1....and black captures with the rook and white bishof can take and guard g4...but if the black rook takes the white bishop....white can play queen g7 and maybe draw since the white rook is on the d file",
    "UgxOx-cDm46pQ89ruJp4AaABAg": "Mato there is simple way back for white queen on 14 move instead of taking knight with a rook and position is good for white after black queen's sacrifice",
    "UgxFLTo9tYdn12nvcEV4AaABAg": "After knight G5 takes pawn F7, king takes knight, rook E1 takes pawn E6, black can trade his queen for the rook and when the white bishop recaptures the queen, the black king can take the white bishop ... sure his king is out in the open, but the pieces are about even and the black king can try to retreat to safety ...",
    "Ugz2dd-EYggtBwLiuuJ4AaABAg": "Well. Yes. Black could checkmate white @4:54, unfortunately, It is white to move...",
    "UgzfqYjXpqjGYDX-LPp4AaABAg": "I'm not sure the Slav is as solid as its reputation. E.g., in the exchange variation Black actually has to be fairly precise to hold the balance while White can grind away forever with virtually no risk. Of course, objectively Black should be OK.  There may be, however,  real issues in some other lines as well if White is really well prepared. I think the scrutiny of concrete, modern analysis will eventually cast a shadow on Black putting the pawn on c6 on move 2.",
    "UgykwBJEUvKD8ijTv914AaABAg": "Seeing as how 99 percent of players are under 2000 rating, I don’t see an issue with it. More players means more popularity of the game, which in turn will increase prizes for tournaments and chess in general. Let the snooty few of those 1 percenters pretend like it’s a bad thing to see this happen. They are the ones who will end up benefiting the most.",
    "UgirH-JzOJFuSXgCoAEC": "at 0:53, white should play e5 to attack black knight, and at 1:03 white bishop should check on f7 and then queen go to b3 to capture black bishop. Also at 1:20 white can check on f7 and then queen can capture the knight on d5. white wastes too many pawns without taking its advantage.",
    "UghfGejxbk0d03gCoAEC": "all these heavyweights hate and fear each other.",
    "UgwhLUnf_46lnYd1Ab14AaABAg": "If after d5 white doesn't capture the pawn on f7 to win the queen and develops queen on b3or knight on c3 then black can develop bishop on c5 and knight on g4 to attack white king side and if white castle king side and pushes h3 then black can even give light square bishop for h pawn and attack....(this is such an aggresive opening that if white slows down then black can counter attack )",
    "Ugxy3rCRN5PNZj-dv6h4AaABAg": "Hope they restart the candidates tournament...so that ding can kick everyone's ass there...sad because he couldn't play his best due to corona or something 🤦‍♂️",
    "Ugz9lcQwMumnhknlBxJ4AaABAg": "Happy New Year ya filthy animals",
    "UgyalUJmxrdb1n0V7Ot4AaABAg": "The Worst part is that agadmator became and adiction to me, every time a sat to use the PC the first thing i do is browse agadmator and stay 30 to 40 minutes watching post that i already saw years before. And i cant stay away from agadmator, i cant escape from this hell",
    "UghKhCdzhOx3P3gCoAEC": "I do think I may have found a way to give this gambit a little more hope.  White can try 6.d4 (as opposed to 6.Qh5+).  My cell phone likes the response 6...Qh4 and then 7.0-0.  (7.dxe5 loses to 7...Qxf2# and 7.dxc5 runs into the unpleasant 7...Qxe4+)  Ultimately, White will probably lose but he has hope because for one he soon ends up with space for virtually all of his pieces.  Black has to act forcefully to combat his pawn center and Black has to work harder to exploit White's weaknesses.",
    "UgxCBEwLTgMNcMGaiQd4AaABAg": "You did not make any conclusions as usual. Everybody above 1800 are wondering how a 2600+ player turned suddenly into a retard and played a retarded game like this. First - 23....d4 allows pawn-majority advantage on the queenside how the hell can you allow that. Second - 26..b6 and Black is fighting back. Instead Black wasted 4 moves in a row from move 26. So, conclusion is that for Black it was too much to play a world champion and in the end of a tournament, nerves could not take it, and in such moments you make illogical decissions and after the game can`t believe that it`s actually you who made all this retarded decisions.",
    "UgxTCEl29obhkRhL5VV4AaABAg": "this child is actually a dumb fuck. no way he can beat a true GM",
    "UgjwuWVkiGmP2HgCoAEC": "I still think the Monkey will win.",
    "Ugw0kvs4fQCaUT_hi7V4AaABAg": "This guy talks so fucking much, I want to die.",
    "Ugz1n5oGW9z_N5NAFqZ4AaABAg": "at 4:47, why not f5 for black?",
    "UgyJ_waLoSDfos3hOuZ4AaABAg": "But they leave music videos encouraging death or taking drugs and generally being a shittty human!!? Madness 0_o",
    "Ugw3R4dDZRLVxuGBaEZ4AaABAg": "The Russians are doing everything tho keep Ding Liren out of the competition.",
    "Ugill1XvB-0obHgCoAEC": "At the 5:50 mark, white to move... Q to G6 check. Black king moves to either F8 or H8. White moves bishop to H6 taking pawn. A faster path to cornering the black king without sacrificing the white bishop.",
    "UgyGt279NzvVZABlSed4AaABAg": "Dang the black dude was a beast I bet he didint know how it felt to loose",
    "Ugwwy7WnQdo6DxXqgXx4AaABAg": "Black just played like a 1500 trash. Such sacrifice would never jave worked agaonst a half decent player.",
    "UggmXNIuHoGHoXgCoAEC": "we know white Bishop for white is a best sheild for white king!, but for this position need to cooperate rooks in game",
    "UgxqewHeJuuBuFKK8e14AaABAg": "The End game:  Black night to h4 prevents white from protecting the pawns with the king, and the black king could come around to help the knight eliminate the f6 pawn.  Still white can avoid giving up bishop to work out a draw.",
    "UgxU9fzK8uqMpk1FZ7V4AaABAg": "This is awesome!!!! All those top tourneys are boring as fuck. College basketball is more exciting",
    "Ugz6EyyErc6_7BzYthp4AaABAg": "It was a majestic performed with black",
    "Ugw-03rxwWRvIYb-Y6d4AaABAg": "I really hope Croatia wins the world cup Tony! They've stolen my heart!",
    "UgwbllxdJy2-KWB_p_J4AaABAg": "well this is scary ,hope deep mind dont learn how to kill humans",
    "UgxnV1HG6vGIwj5TUCJ4AaABAg": "It seems that a chess world champion must be born a prodigy. If carlsen was not born prodigy he  may be just a very ordinary chess player whom any one can beat also many times. The rest of the world chess grandmasters are may be not born prodigy or almost prodigy that they can also play very brilliant chess. I prefer to watch these kind pf grandmasters to play chess like Ivanchuck and the rest because they are still normal person but have brilliant mind to play chess; whoever wins is one who just played better than the other and not because he is endowed with a freak mind for chess.",
    "UgwnnT1xINLlSqfKuaR4AaABAg": "That end games looks like a draw to me... its hard to see how it's winning for white. I seems like black should be able to block whites advance.",
    "Ugg12TsGCZevCXgCoAEC": "This whole video is retarded. Black is a pawn up and can't castle? Black has 1 pawn less than white, Jeasus Christ. What have I just seen ???",
    "Ugzf1yTJIDDUX-4E9P54AaABAg": "Question for all at 6:33 for white would  D6-E5 whites queen taking blacks pawn  since then black has to Queen trade then since he can't take the knight without otherwise white Queen chessmate (in the corner) and the trade down goes for white then too? Since white gets the pawn queen and trades the knight for a rook. Ending with white having 2 Rooks and 1 Bishop vs black having 2 Bishops and 1 Rook with pawns even. Wouldn't that have been a much better outcome for white then happened?",
    "UgxR3gDykcEZWRluTSB4AaABAg": "During the commentry:\nGrischuk :\"Monkey Sees Monkey Do \"\n😂😂",
    "UgxUVfb-nyvbSN8LxCh4AaABAg": "Janowski didn't just fuck up the opening, he fucked up the beginning of the middle game, moved his white bishop to wrong square and wasted the move with the dark bishop, didn't develop the knight at the right time just totally fucked up.",
    "Ugx9GdsUwV5CT2vQBz14AaABAg": "Rxb4 at 7:50 is not possible..\nRxb4,Bxb4..the dark square bishop is still there..and then there is matting threat on e1..isn't it?",
    "UgyNkBcY1swvZOLqgb94AaABAg": "I see another threat at the end after Gligoric resigned. After the black queen captures the bishop on f7 and queen captures bishop on d6, there is a threat of Qd8+; black has to play Qg8, then Qf6+. black has to block with Qg7 and QxQ is checkmate. Of course black can stop this by moving the bishop from c8 allowing the rook to cover the 8th rank, but then it falls back to Qxe5 pawn and continues as you describe.\n\nBy the way I love this channel and am going to scrape up a few dollars to contribute very soon.",
    "UgzrdX1n72U9DC7gzuZ4AaABAg": "without e pawn am basicly fucked. there was enemy bishop instead of his queen protecting so i traded bishops after chekcing with a knight but enemy queen was on d6 and i coudlnt do that queen movign to g 3 move. he didnt even need to move his queen to d8 at the begining, he just took with bishop imidiatly :(         so not all \"greek sacrifice\" are good for white.  some are draw for a white from a wining position :(",
    "UgyaxLEw4bWh-JAjzUt4AaABAg": "B5 is brilliant ... putting the two lonely black pawns in jail, permanently, until the white King arrives to decapitate them.  I can see the black pawns shivering and shaking.",
    "UgzER5d2c7NA11ctJmZ4AaABAg": "Maybe the engines are right: black wins. In the one solution we are looking at, black tries to prevent white from getting a queen and then gets checkmated. What if black lets white get a queen: can it still win ? I think it can and that is what the engines are seeing",
    "Ugw4X7WvIByhfek1z354AaABAg": "What the heck are those horses doing?   I mean I sort of saw something with the first sacrifice ... but the second one galloping immediately afterwards to identical death?   Never seen that before.   If I'm black, I'm thinking, \"Heck, give me a third one and I'll gladly eat him, too\".  And then, White goes and produces another one to gloriously kick my ass.   What am I, in KRAZY town here?",
    "Ugjilu04PpAR0ngCoAEC": "At 4:14 White has a interesting move with 1.Nb5!? if 1...cxb5 then 2.Qxa8 check. If 1...Qd7 then White can move his Knight back to c3 and the pressure on e5 has been contained. This may lead to a draw if White goes back to b5 with the Knight.",
    "UgwkwpicJUiR1t-oYsZ4AaABAg": "Chess has been a sport historically dominated by men in a misogynist society, and it's sad that when a woman plays well and beats men they accuse her of cheating, showing how stupid they are for not believing that she's simply playing beautifully and kicking their a$$!",
    "UghR-wo33l4Fb3gCoAEC": "Mato made a mistake. At minute 4:58, after check, black King goes to g8, not to f8 so rook can comfortable come to F to check. King goes to g8, after which: Qe8 check, Bf8, Rf1 threating check mate, Qd6 defending bishop, then white bishop goes to h6 to add another attacker to that black bishop and prevent king to go up to g7, and thats unstoppable, after, lets say, Qe7 dreaming of exchanging queens, rook takes bishop on f8 check, Qf8 and white queen takes the black queen to check mate the king.",
    "Ugyf8tRIuNLgWS1COC14AaABAg": "hey mitar russian im human MATIRAWM kicking stockfish ass 3.0 on level 5",
    "Ugxv78DJzsZrgCsQ9HR4AaABAg": "I cant believe magnus blundered the game like that lol, he just loves toying with these serious chess players its so funny, everybody is trying to be better than him while he’s jus chillin being a human being in hawaii",
    "Ugy98eyWEzundgtMxE94AaABAg": "mato i didnt understand how white choose to castle on queenside placing king in same file as black queen.  of course it did not matter but you never mentioned why white choose to castle long when castling kingside looked safer.  could white have still won castling kingside?",
    "UgimhnieSXuwIXgCoAEC": "It's still not clear to me why black (Keres) is necessarily winning even after taking the white (Donner) queen in the last position displayed at 6:52.  If white blocks the check by the black bishop with his queen, then  bxq on g2 ch, rxb on g2  and white still has 2 rooks, 1 bishop and 5 pawns against black who has a queen, a rook and 6 pawns.  The only advantage I see for black is the passed pawn on D6 after the black pawn on D3 takes the white pawn on C2.  Otherwise, I see the battle continuing without a clear victor.  If anyone would care to clarify this for me, I would appreciate it.",
    "Ugys-J8iD4H6t65Clzx4AaABAg": "You can't teach someone such a high imagination like Tal had. U are born with it and u improve it during your lifetime.",
    "UgySM896Su_L_v1IAZN4AaABAg": "I remember one beautiful puzzle where white could deliver a mate but the problem is that they have a pawn that is on the way so white forces black King to capture the pawn in two moves and get him back to the original square. Now white can deliver the mate because the white pawn is gone. Alas, I don't remember the setup but it's a brilliant concept and no, it is not a self- or helpmate.",
    "Ugym3kOBni2JRvSGDhN4AaABAg": "That (white) i think means the black team was being played by a white person",
    "Ugx86z_86sI_EhY8B2B4AaABAg": "That is not a blunder, just bunder.... meaning monkey in Hindi",
    "UgyvtKznzQQUjbR6Th54AaABAg": "28:45 I think it's winning for black because you can eventually grab the f5 pawn with black king, the black knight on f4 and black bishop on h4 keep the white king isolated on h6.",
    "UggJJOTlPfkAkHgCoAEC": "At 4:27 isn't Bxh6 simpler? The threat is checkmate on g7 and the rook cannot move (if Rg8, then Nf7#). So bishop gets the rook as in the longer variation shown. Also don't see why the king ends up on h8 in the variation shown since black can avoid the discovered check with Kg8 on the last move.",
    "UgzrF7QJss-6Kly5Xyl4AaABAg": "black blundered a pawn on move 1 and white didn't even take it, both players sucked",
    "Ugxdy1-5d-AzXGevdB94AaABAg": "Why wouldn't you capture the white pawn with the bishop at 7:20? Black has its knight and queen defending if white decides to attack with his bishop and queen. Then black is up a queen. Can someone point out what I'm missing?",
    "Ugi70xfyusyGQ3gCoAEC": "What an annoying ass GM, never thought GM's could go after stupid annoying moves",
    "UgzrWu7Dm9WN5y4Uh-54AaABAg": "They’re greedy for wanting a discount.",
    "UgxEqNcPFVP76SJMebJ4AaABAg": "All the white squares around the king were cleanly covered by the black pieces to smother the white king.",
    "UgyorOFbhC9-ex_tkj14AaABAg": "Grenke chess team are such a gentlemen not like the snt Louis Chess club savages.",
    "UgwvundDC8lf_lrMIOV4AaABAg": "Almost a shame to see this two nervous players who dare zero killing the fantastic entertaining game of chess.",
    "Ugzykcf-tHaGUUDHVfV4AaABAg": "at 10:42 black could have played bishop h4 challenging the white rock instead of playing bishop f6. then the white bishop will not be able to come to g7 giving a discover check because the rock is threaten, and even if the rock moved from g3 then the black queen together with the black bishop are threatening f2 pawn to give a check and take the white queen.",
    "UggFY_23SWjlj3gCoAEC": "At 13:26 after Ng5, isn't the best move for black g3+ forcing the king to drop the h1 square allowing Queen to come to h1. If white plays fxg3 instead, then black can play Bb7 threatening mate and forcing white to play Qf1. Either way the plan would be ruined. White would still have a slight advantage in the resulting endgame and can win it but it wont be as easy as this one.",
    "UgwHlJZTqMF66HGEIip4AaABAg": "He resigned because he shit in his pants. #shithappens.  The real reason is in next couple moves black queen will be trapped.",
    "Ugx57quqTOP4mjwy6RN4AaABAg": "What's wrong with Rook to e8? What am I missing? Opponent continues with Pawn to a2. Rook takes Bishop. Pawn to a1, Queening. White King to g6, a discovered check on black king. Black has to retreat to 8th row and white finishes of with Rook to e8, Check Mate.",
    "UgyrmDpFH_GOYn8yD5x4AaABAg": "5:22 Ne6 is a more serious threat at this position, isn't it?",
    "UggyWkcA1VD0aHgCoAEC": "Well, I do not know why White retreats his Queen in d1, why not c2?  Anyway, after Nd3, White has not  to sacrifice the rook, for what? Just rook d1 and then calmly manoeuvre his Knight to exchange the black Knight in d3. In the worse case,  White could exchange the Rook for the Knight and one Pawn.",
    "UgxH5veEXptXzCvvXkR4AaABAg": "Chess is just another way to make the black and white fight against each other. Time to end racism. #cancelChess",
    "UghnMzejEFXlZHgCoAEC": "Yeah, don't worry about thumbs down. There is nothing to dislike about this video. I absolutely loved watching white squirm after 19. Nxf5. Those poor bishops of his... it was like watching an anaconda squeeze the life out of her prey!",
    "UgyJKSSJ5PKsglC8Rmx4AaABAg": "Why the move on 5:31 , if the white pieces push g3 kick the knight back to g6 , white bishop just grap the knight and the rook isnt being defensed ? That winning move for white ?",
    "UgyN_WuSGH6QzwKzoqh4AaABAg": "you mess with the ø, you mess with the æ and å.",
    "Ugx_f7V-hskemg0wGDt4AaABAg": "What I believe is that when u don't give a fuck about someone they will try to do something that will force you to talk to them so that they can politely show thier attitude!",
    "Ugyfz40QCw5MyaXlfqN4AaABAg": "When black moved the king to e8 @ 11:12 white should have moved the queen to e4 pinning the queen with a threat on g6 pawn in my opinion. If black captures whites queen, white has the center. If not white starts picking up pawns. Any thoughts? Edit: I think it really does matter if the king is on e8 or f8 because if black moves king to f7 to defend g6 you have the initiative to get your king across the board. Maybe not... Just trying to learn. Thanks!",
    "UgzXdhqKk2HVlQmQu3V4AaABAg": "I'm just wondering after your end of video analysis finishing with White's Nxh7, if Black plays Rd6, I can't see that White is definitely winning",
    "Ugwl-mXxwxtg8CGcs-p4AaABAg": "Dear Antonio,  I'm fine if you wanna change to a streaming service that isn't a tax dodging surveillance capitalist democracy silencing parasite.  Just fine.",
    "UgySXskqsFseyFy_CyV4AaABAg": "This video is so fucking epic! I haven't even watched yet!! Thankyou thankyou thankyou, all of you! 😂",
    "Ugx_w-J_-Vdw47EuJ9l4AaABAg": "These grandmasters can wipe the floor with me tactically but, in terms of harmonious development of pieces, they can do some crazy stuff that I never would and that leave their positions in a mess.  Nf3 in the opening here was just asking for ...e4 with threats of a really ugly ...e3 to follow.    Surely just e3 and Nge2 with d4 to follow at some point would have left white in a far more comfortable position?",
    "UgyeG4nSfOhTmwZNmX14AaABAg": "This is the problem with monopolies... we really need a couple more YouTube equivalents out there so that they stop bullying at will and imposing their personal tendencies on everyone.",
    "Ugw9UY2V-cfW4n4XrGV4AaABAg": "Crushed by the black pawns! Most impressive 🍻",
    "UgwUVp9heXxcXqAvhSt4AaABAg": "After the hypothetical ending you offered where black rook takes on c 4, white plays rook to g4, why not move the bishop to block the white rook on f4? If the pawn takes, black has time to take the white bishop. If the rook takes, you capture back with your pawn and you are up the exchange to boot. The white king is blocked at the fourth rank if the white pawn takes the black bishop thanks to the black rook occupying that rank. You can then capture another pawn and the king can block the passed pawn in enough time for the rook to be able to help defend, while also pushing what would at that point be THREE passed pawns. I am running on 3 hours of sleep though so if I missed something in this could someone please let me know? Don't have an engine to test it out in myself",
    "UgxUCM1LS630y1Ws9uV4AaABAg": "Wow he play like a psycho spider exposing his king and baiting his opponent into a trap like a Fisherman. Then he just let his prey suffocate not giving them any rest,  sucking their energy and torturing their brain. No doubt he ll make his way to olymp only GM who play for a secure locked strong position like Carlsen with orange juice would not fall for this.",
    "UgwNB0byhIWJ96Tpxs54AaABAg": "Liberals, can't get the Donald off of their mind at any point in the day =)",
    "UgzeKwGWBO8lrccPfJt4AaABAg": "YEAH ITS A CHESS GAME since the BEGINNING which I CUD HAVE WON EASILY if my MISSION was on the LINE. Its STILL A CHESS GAME N I KNOW how WHITE MEN THINK. I have SRUDIED THEM THROUGH THEIR MOVIES OBSERVED WELL ENOUGH in AUSTRALIA. They LIKE TO PLAY ABSOLUTELY DIRTY to HURT THEIR OPPONENTS N TO MAKE THEM FEEL DOWN. Yeah wat to EXPECT FROM THE RACE who has BEEN RESPONSIBLE for all the WARA since 2nd WORLD WAR but it will be HARD TO TRAP ME AGAIN. I KNOW WAT U KNOW. I KNOW HOW THE MINDS OF WHITE WORK. ITS NOTHING but CHEAP N DIRTY TRICKS.",
    "UgzqfWfThb5jtj6I-OJ4AaABAg": "Around 4:04 White Pawn on D4 and Black Pawn on E4....so how can the Black E4 Pawn take the White D4 Pawn on D3??",
    "UgxNmH7lDMpRkzBFKHh4AaABAg": "Four gentlemen were the four beast who cudn't be tamed",
    "UgxwbINKDF6tvPVNRcN4AaABAg": "Rook for two bishops, not one. White has the bishop pair, black's king is completely unsafe, white has some pressure against pieces.",
    "UgwptR4jQ-soQ03p1Yl4AaABAg": "Aaaaargh i hate magnus... Hes SO Fucking perfect.",
    "UgwmAP7UzbxPv3tm4ml4AaABAg": "more annoying kids. ugh. don't these kids have parents that teach them when to stfu?",
    "UgwVfiwffIUXk7OMDc54AaABAg": "@12:33 instead of e5 a better move would be xd5 removing the only threat",
    "Ugxam7AmuMiDdm6FBnp4AaABAg": "What do you do in the situation 4:19 where ...Nc6, Black Knight attacks White's Bishop, White moves Kc3?",
    "Ugj-ScM39eLCE3gCoAEC": "Magnus has killed, and will kill again.",
    "UgzJRJEBdnla8g6yx2h4AaABAg": "What if after Bd4 black plays Nxc3? If Rxh7 then Bb4 making room for the king to escape and winning back a piece with more white pieces hanging. White could proceed to trade rooks and pin the knight to the remaining black rook but black wouldn't be completely lost. Could be worse if white played Bxc3 instead, because then Qxb5 and threatening Bf6 with a double attack. Ah wait, Bf6 after Nxc3 would ensure checkmate. So then a similar idea with Bb5 immediately? Attacking the pinned piece and Bf6 is covered by the knight. If Rxh7 now simply Bxc3 would suffice in my eyes. Black still has it difficult, but it's not impossible."
}